{"totalArticles":6899944,"articles":[{"title":"Israeli attacks secret Houthi meeting site in Yemen","description":"Houthi security forces quickly cordoned off the house","content":"An Israeli airstrike early Sunday hit a house in southern Sanaa, Yemen, where a clandestine meeting of senior Houthi leaders was reportedly underway.\nHouthi security forces quickly cordoned off the house and ambulances were seen transporting casualti... [2573 chars]","url":"https://tribune.com.pk/story/2550935/israeli-attacks-secret-houthi-meeting-site-in-yemen","image":"https://i.tribune.com.pk/media/images/express-tribune-news-desk-21749968608-0/express-tribune-news-desk-21749968608-0.jpg","publishedAt":"2025-06-15T09:56:15Z","source":{"name":"The Express Tribune","url":"https://tribune.com.pk"}},{"title":"Nuts: Should we be eating more?","description":"Eating a handful of nuts a day could have numerous benefits, but it is important to know that high consumption of certain nuts could have some risks. ...","content":"In one of the opening scenes in When Harry Meets Sally, on a road trip from the University of Chicago to New York, much to Sally’s disgust, Harry insists on eating a bunch of grapes and spitting the seeds onto the road.\nAt one point, he forgets the w... [6149 chars]","url":"https://www.echolive.ie/wow/arid-41649245.html","image":"https://www.echolive.ie/cms_media/module_img/9315/4657613_2_seoimageog_2.29368093.jpg.jpg","publishedAt":"2025-06-15T09:51:00Z","source":{"name":"echo live","url":"https://www.echolive.ie"}},{"title":"Wanted person in Bukidnon nabbed in Kabankalan City","description":"BACOLOD CITY – A 38-year-old driver wanted for three counts of estafa in Quezon, Bukidnon, was arrested by police in Barangay Tapi, Kabankalan City, Negros...","content":"BACOLOD CITY – A 38-year-old driver wanted for three counts of estafa in Quezon, Bukidnon, was arrested by police in Barangay Tapi, Kabankalan City, Negros Occidental on Saturday, June 14, three days after he came home to his wife’s province.\nThe sus... [811 chars]","url":"https://mb.com.ph/2025/06/15/wanted-person-in-bukidnon-nabbed-in-kabankalan-city","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/15/19561.webp","publishedAt":"2025-06-15T09:45:08Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"The Best Watches For Life During Summer 2025","description":"Grab your flip-flops and beach shorts, slap on some sun-screen and enjoy the heat of summer with a cool watch on the wrist!","content":"Every year, the anticipation of summer grows parallel to the rise in temperature. Days get longer, hotter, and more action-packed with outdoor activities, and the lust for some refreshing coolness increases exponentially. And like every year, purpose... [6100 chars]","url":"https://monochrome-watches.com/buying-guide-summer-watches-seiko-5-sports-skx-srpl87-srpl89-hublot-big-bang-unico-summer-2025-rado-anatom-gradient-dial-bulgari-aluminium-chronograph-white-rubber-longines-legend-diver-39mm-white-spe/","image":"https://monochrome-watches.com/wp-content/uploads/2025/05/2025-Longines-Legend-Diver-39mm-White-Dial-review-8.jpg","publishedAt":"2025-06-15T09:35:16Z","source":{"name":"Monochrome Watches","url":"https://monochrome-watches.com"}},{"title":"2 sacks of floating shabu found in Cagayan","description":"false>false>CAMP Marcelo Adduru, Tuguegarao City, Cagayan –Police recovered two sacks of suspected shabu floating on the shoreline of Barangay Centro 6,...","content":"false>false>CAMP Marcelo Adduru, Tuguegarao City, Cagayan – Police recovered two sacks of suspected shabu floating on the shoreline of Barangay Centro 6, Claveria, Cagayan, on Sunday, June 15. Police recovered two sacks of suspected shabu floating on... [917 chars]","url":"https://mb.com.ph/2025/06/15/2-sacks-of-floating-shabu-found-in-cagayan","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/15/19559.webp","publishedAt":"2025-06-15T09:22:02Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"PMD says chances of rain, thunderstorm in Karachi tomorrow","description":"Humidity levels in the city expected to touch 70-80 per cent.","content":"Karachi is expected to receive rain on Monday, accompanied by a dust thunderstorm, according to the Pakistan Meteorological Department (PMD).\nThe PMD has predicted that a “westerly wave is affecting upper parts of the country & moist currents also pe... [1332 chars]","url":"https://www.dawn.com/news/1917303/pmd-says-chances-of-rain-thunderstorm-in-karachi-tomorrow","image":"https://i.dawn.com/large/2025/06/15135127e2016dd.jpg?r=135353","publishedAt":"2025-06-15T09:19:12Z","source":{"name":"Dawn","url":"https://www.dawn.com"}},{"title":"Suspect sought in deadly shooting of Democratic lawmakers in Minnesota","description":"Minnesota Police and the FBI kept up a massive manhunt on Saturday evening for a gunman posing as a police officer who killed a senior Democratic state assemblywoman and her husband in what Governor Tim Walz called a \"politically motivated assassination.\"","content":"Law enforcement establish a security perimeter near the residence of senior Democratic state assemblywoman Melissa Hortman after Hortman and her husband, Marc, were shot and killed earlier in the day, in Brooklyn Park, Minnesota, June 14, 2025. A 57-... [6322 chars]","url":"https://www.gmanetwork.com/news/topstories/world/949469/suspect-sought-in-deadly-shooting-of-democratic-lawmakers-in-minnesota/story/","image":"https://images.gmanews.tv/webpics/2025/06/2025-06-15T021854Z_35461121_RC2P2FA9R109_RTRMADP_3_MINNESOTA-SHOOTING_2025_06_15_17_12_23.JPG","publishedAt":"2025-06-15T09:14:35Z","source":{"name":"GMA Network","url":"https://www.gmanetwork.com"}},{"title":"NASA sets new potential launch date for Ax-4 mission to ISS","description":"NASA says a private astronaut mission could launch to the ISS as soon as June 19 as it works to understand an air leak on the station's Russian segment.","content":"PARIS — NASA says a private astronaut mission could launch to the International Space Station as soon as June 19 as it works to understand an air leak on the Russian segment of the station.\nIn a June 14 statement, NASA said it is working with Axiom S... [4169 chars]","url":"https://spacenews.com/nasa-sets-new-potential-launch-date-for-ax-4-mission-to-iss/","image":"https://spacenews.com/wp-content/uploads/2024/07/International-Space-Station-in-2021-scaled.webp","publishedAt":"2025-06-15T09:12:14Z","source":{"name":"SpaceNews","url":"https://spacenews.com"}},{"title":"Bitcoin vs. Open Interest - Should traders be worried by THIS divergence?","description":"Bitcoin’s price decoupling from Binance open interest may signal looming volatility and potential liquidation cascades.","content":"The chart reveals a sharp drop in the correlation between Bitcoin’s price and Binance’s OI, plunging below 0.1, a level that usually rings alarm bells.\nThis kind of dislocation often signals that traders are taking contrarian positions, betting again... [1085 chars]","url":"https://ambcrypto.com/bitcoin-vs-open-interest-should-traders-be-worried-by-this-divergence/","image":"https://ambcrypto.com/wp-content/uploads/2025/06/Samyukhtha-20-1000x600.webp","publishedAt":"2025-06-15T09:05:01Z","source":{"name":"AMBCrypto","url":"https://ambcrypto.com"}},{"title":"'No energy, intensity or aggression': Kerry boss Jack O’Connor bemoans lacklustre effort in Meath defeat","description":"Looking ahead to next weekend’s All-Ireland preliminary quarter-final expected to take place in Killarney, O’Connor hopes his team can wash this display out of their systems","content":"Jack O’Connor wasn’t hiding from the fact that this was a miserable Kerry performance against Meath as they surrendered their automatic All-Ireland quarter-final spot.\n“It’s a chastening experience,” he opened. “We were very flat, and lacking energy,... [2422 chars]","url":"https://www.irishexaminer.com/sport/gaa/arid-41651525.html","image":"https://www.irishexaminer.com/cms_media/module_img/9327/4663505_9_seoimageog_3160027.jpg","publishedAt":"2025-06-15T09:05:00Z","source":{"name":"Irish Examiner","url":"https://www.irishexaminer.com"}}]}