{"totalArticles":7244794,"articles":[{"title":"Путін заявив, що сподівається на нові перемовини з Україною","description":"Російський диктатор Володимир Путін заявив, що російські та українські меморандуми щодо перемир'я прямо протилежні. Але ведуться перемовини для по...","content":"Як повідомляє РБК-Україна, про це Путін заявив під час спілкування з журналістами.\nЖурналісти запитали у диктатора, як він оцінює меморандум України щодо перемир'я. На що Путін відповів, що він протилежний пропозиції Росії. При цьому він відмовився д... [1234 chars]","url":"https://www.rbc.ua/rus/news/putin-zayaviv-gotovnist-tretogo-raundu-peremovin-1751037292.html","image":"https://www.rbc.ua/static/img/_/v/_volodimir_gettyimages_2169797566_bd9a25df6b27175f3e70e72112df70d4_1300x820.jpg","publishedAt":"2025-06-27T15:14:52Z","source":{"name":"РБК-Україна","url":"https://www.rbc.ua"}},{"title":"У Лізі націй з волейболу збірна України здобула перемогу над Японією","description":"Збірна України здобула перемогу над Японією у Лізі націй з волейболу.","content":"Збірна України здобула перемогу над Японією у Лізі націй з волейболу.\nПро це повідомляє «Патріот Донбасу» з посиланням на Суспільне Спорт.\nПершу партію українці програли лише на “більше-менше” — 24:26, попри те, що мали сетбол за рахунку 24:23.\nУ дру... [603 chars]","url":"https://donpatriot.news/u-lizi-naczij-z-volejbolu-zbirna-ukrayiny-zdobula-peremogu-nad-yaponiyeyu","image":"https://donpatriot.news/wp-content/uploads/2025/06/znimok-ekrana-2025-06-27-o-16.50.52.jpg","publishedAt":"2025-06-27T14:06:30Z","source":{"name":"Патріот Донбасу","url":"https://donpatriot.news"}},{"title":"Камалія зізналася, яким методом виявила у себе рак грудей: фото","description":"Співачка Камалія поділилася шляхом лікування онкології та як виявила хворобу на першій стадії — як зараз почувається зірка ᐅTSN.ua(новини 1+1)","content":"Камалія / © instagram.com/kamaliyaofficial\nРеклама\nВідома українська співачка Камалія вперше публічно розповіла подробиці онкологічного захворювання, яке вона поборола чотири роки тому.\nАртистка в інтерв'ю YouTube-проєкту ТСН \"Наодинці\" згадала, що т... [1562 chars]","url":"https://tsn.ua/glamur/kamaliia-vpershe-ziznalasia-iak-vypadkovo-vyiavyla-u-sebe-rak-hrudey-vydalyly-limfovuzly-2856377.html","image":"https://img.tsn.ua/cached/372/tsn-7d69491ed57b2e0aebe0922b41d97a86/thumbs/1200x630/6d/9d/d8db7f1aac3c272fa9096066fc489d6d.jpeg","publishedAt":"2025-06-27T13:35:22Z","source":{"name":"tsn.ua","url":"https://tsn.ua"}},{"title":"Історична подія: телескоп Джеймса Вебба вперше зняв \"Сатурн\" за межами Сонячної системи - фото","description":"Космічний телескоп Джеймса Вебба, здійснив прорив в астрономії, зробивши перші прямі зображення екзопланети з масою, близькою до Сатурна. Розповідаємо деталі.","content":"The Guardian пише, що космічний телескоп Джеймса Вебба здійснив прорив в астрономії, зробивши перші прямі зображення екзопланети з масою, близькою до Сатурна. Розповідаємо деталі.\nЩо сталося\nКосмічний телескоп Джеймса Вебба, що працює на орбіті з 202... [678 chars]","url":"https://vctr.media/ua/istorychne-sposterezhennya-teleskop-dzhejmsa-vebba-napryamu-znyav-saturn-za-mezhamy-sonyachnoyi-systemy-279194/","image":"https://vctr.media/wp-content/uploads/2025/06/vctr.media-1751027449.png","publishedAt":"2025-06-27T13:24:00Z","source":{"name":"vctr.media","url":"https://vctr.media"}},{"title":"Орбан напосівся на керівництво ЄС, заявивши що Україну \"дурять, обіцяючи неможливе\"","description":"Угорський прем’єр Віктор Орбан звинуватив керівництво Європейського союзу у неможливих обіцянках Україні у зв’язку з її прагненням вступити до ЄС.","content":"Угорський прем’єр Віктор Орбан звинуватив керівництво Європейського союзу у \"неможливих обіцянках\" Україні у зв’язку з її прагненням вступити до ЄС.\nДжерело: \"Європейська правда\" з посиланням на 444.hu\nДеталі: Орбан вкотре повторив свої аргументи про... [1041 chars]","url":"https://www.pravda.com.ua/news/2025/06/27/7519078/","image":"https://img.pravda.com/images/doc/7/5/7519078_fb_image_ukr_2025_06_27_16_20_08.jpg","publishedAt":"2025-06-27T12:42:18Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"НАБУ та САП просять відсторонити віцепрем'єра Чернишова з посади","description":"НАБУ і САП звернулися до ВАКС з клопотанням про відсторонення чинного віце-прем’єр-міністра України від посади, деталі читайте на 24 Каналі.","content":"НАБУ та САП також просять ВАКС відсторонити Чернишова від посади. Про це пише 24 Канал з посиланням на САП і НАБУ.\nДивіться також ВАКС обиратиме запобіжний захід Чернишову: чи йдеться про тримання під вартою\nНАБУ та САП просять відсторонити Чернишова... [1376 chars]","url":"https://24tv.ua/nabu-sap-prosyat-vidstoroniti-vitsepremyera-chernishova-posadi_n2856796","image":"https://24tv.ua/resources/photos/news/202506/2856796.jpg?v=1751002916000&w=1200&h=675","publishedAt":"2025-06-27T12:10:29Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Відсутність світла - Росія нанесла удар по важливому енергооб'єкту - УНІАН","description":"Російські окупанти вдарили по важливому енергооб'єкту на Херсонщині. Це сталося напередодні Дня Конституції. Відсутність світла може бути тривалою.","content":"Через атаку є проблеми з електропостачанням у низці населених пунктів.\nМешканці Херсонщини мають підготуватися до тривалої відсутності світла, заявив очільник обласної військової адміністрації Олександр Прокудін.\n\"Напередодні Дня Конституції росіяни ... [1084 chars]","url":"https://www.unian.ua/economics/energetics/vidsutnist-svitla-rosiya-nanesla-udar-po-vazhlivomu-energoob-yektu-13050774.html","image":"https://images.unian.net/photos/2025_06/thumb_files/620_324_1751025898-8026.jpg?1","publishedAt":"2025-06-27T12:09:45Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Windows відмовляється від культового \"синього екрана смерті\" на користь чорного","description":"Один із найвідоміших символів Windows, «синій екран смерті» (BSOD), невдовзі зникне. Microsoft оновлює механізм повідомлення про збої в Windows 11: замість синього фону з сумним смайликом користувачі бачитимуть чорний екран із мінімалістичним текстом. Рішення має спростити діагностику проблем і","content":"Один із найвідоміших символів Windows, «синій екран смерті» (BSOD), невдовзі зникне. Microsoft оновлює механізм повідомлення про збої в Windows 11: замість синього фону з сумним смайликом користувачі бачитимуть чорний екран із мінімалістичним текстом... [2177 chars]","url":"https://dev.ua/news/windows-vidmovliaietsia-vid-kultovoho-synoho-ekranu-smerti-na-koryst-chornoho-1751025883","image":"https://dev.ua/storage/images/24/37/17/35/derived/1c35a971f451741a5a97ba1ecd07e980.jpg","publishedAt":"2025-06-27T12:09:00Z","source":{"name":"dev.ua","url":"https://dev.ua"}},{"title":"Орбан звинуватив ЄС у тому, що там \"дурять Україну, обіцяючи неможливе\"","description":"Прем’єр-міністр Угорщини Віктор Орбан звинуватив керівництво Євросоюзу у","content":"Прем’єр-міністр Угорщини Віктор Орбан звинуватив керівництво Євросоюзу у \"неможливих обіцянках\" Україні у зв’язку з її прагненням вступити до ЄС.\nЯк повідомляє 444.hu, пише \"Європейська правда\", про це він заявив у п’ятничному ефірі на радіо Kossuth.... [1061 chars]","url":"https://www.eurointegration.com.ua/news/2025/06/27/7214749/","image":"https://img.eurointegration.com.ua/images/doc/e/9/e9df35c-58c8b76---------------2025-06-26-103728.jpg","publishedAt":"2025-06-27T12:06:32Z","source":{"name":"Європейська правда","url":"https://www.eurointegration.com.ua"}},{"title":"Росія вдарила по енергетичному об'єкту на Херсонщині","description":"27 червня росіяни атакували енергетичний об'єкт на Херсонщині. У частині області зафіксовані перебої з електропостачанням. Що відомо - 24 Канал","content":"Вдень 27 червня голова Херсонської обласної державної адміністрації Олександр Прокудін повідомив, що противник вирішив занурити Херсонщину у темряву, атакувавши важливий енергетичний об'єкт, передає 24 Канал.\nДивіться також Цинічний удар Росії по Сам... [1368 chars]","url":"https://24tv.ua/rosiya-vdarila-po-energetichnomu-obyektu-hersonshhini-yaki-naslidki_n2857193","image":"https://24tv.ua/resources/photos/news/202506/2857193.jpg?v=1751024862000&w=1200&h=675","publishedAt":"2025-06-27T11:48:13Z","source":{"name":"24 Канал","url":"https://24tv.ua"}}]}