{"totalArticles":7115314,"articles":[{"title":"Президент Ірану оголосив про кінець війни з Ізраїлем","description":"Президент Ірану Масуд Пезешкіан оголосив про кінець 12-денної війни з Ізраїлем. Як президент Ірану заявив про кінець війни з Ізраїлем – читайте на Фактах ICTV","content":"Президент Ірану Масуд Пезешкіан у зверненні до нації оголосив про кінець 12-денної війни, нібито нав’язаної Ізраїлем.\nПрезидент Ірану заявив про кінець війни з Ізраїлем\n– Сьогодні, після героїчного опору нашої великої нації, чия рішучість творить іст... [988 chars]","url":"https://fakty.com.ua/ua/svit/20250624-prezydent-iranu-ogolosyv-pro-kinecz-vijny-z-izrayilem/","image":"https://cdn.fakty.com.ua/wp-content/uploads/2024/07/06/masoud-pezeshkian-768x432.jpg","publishedAt":"2025-06-24T18:33:00Z","source":{"name":"fakty.com.ua","url":"https://fakty.com.ua"}},{"title":"Український стрибун у висоту виграв престижний \"золотий\" етап Континентального туру","description":"Український стрибун у висоту Дмитро Нікітін тріумфував на \"золотому\" етапі Континентального туру в Чехії.","content":"Українець розпочав змагання з висоти 2.10 м, яку підкорив із першої спроби. Також він подолав і наступну планку в 2.15 м. Труднощів Нікітінін зазнав на висоті 2,20 метри, яку він взяв з останньої, третьої спроби. На наступну висоту вийшли 7 спортсмен... [294 chars]","url":"https://sport24.ua/uk/athletics/news/120024-ukrayinskiy-stribun-u-visotu-vigrav-zolotiy-etap-kontinentalnogo-turu","image":"https://sport24.ua/resources/photos/news/202506/53fc1ca9-0a56-434d-8863-22b1fde78bed.jpeg","publishedAt":"2025-06-24T17:20:00Z","source":{"name":"sport24.ua","url":"https://sport24.ua"}},{"title":"Toyota Land Cruiser Prado отримав дві нові версії","description":"Оновлений Prado отримав м’яку гібридну установку для Європи та вантажну версію для бізнесу у Великій Британії.","content":"Оновлений Prado отримав м’яку гібридну установку для Європи та вантажну версію для бізнесу у Великій Британії.\nToyota розширює модельний ряд Land Cruiser Prado, додавши одразу дві нові модифікації на основі дизельної версії авто - м’який гібрид для є... [2150 chars]","url":"https://ua.korrespondent.net/lifestyle/motors/4793302-Toyota-Land-Cruiser-Prado-otrymav-dvi-novi-versii","image":"https://kor.ill.in.ua/m/1260x900/4331222.jpg","publishedAt":"2025-06-24T17:03:00Z","source":{"name":"Korrespondent.net","url":"https://ua.korrespondent.net"}},{"title":"Людмила Кіченок з камбеком пробилася у півфінал п'ятисотника в Бад-Гомбурзі","description":"Українка та Еллен Перес у другому раунді здолали Чан Хао-Чін та Клару Таусон ⋆ Теніс на Sport.ua","content":"Українська тенісистка Людмила Кіченок вийшла до півфіналу парного розряду на трав'яному турнірі WTA 500 у Бад-Гомбурзі, Німеччина.\nУ другому раунді українка та її напарниця Еллен Перес (Австралія) у двох сетах переграли тандем Чан Хао-Чін (Китайський... [908 chars]","url":"https://sport.ua/uk/news/772997-lyudmila-kichenok-z-kambekom-probilasya-u-pivfinal-pyatisotnika-v-bad-gomburzi","image":"https://pic.sport.ua/images/news/0/19/64/og_uk_772997.jpg","publishedAt":"2025-06-24T16:55:00Z","source":{"name":"Sport.ua","url":"https://sport.ua"}},{"title":"Удар по навчальному центру ЗСУ","description":"Росіяни атакували навчальний центр Сухопутних військ ЗСУ 24 червня 2025 року. Що кажуть у ЗСУ про удар, чи є поранені військові - 24 Канал.","content":"Про це начальник управління комунікацій Командування Сухопутних військ ЗСУ Віталій Саранцев повідомив в ефірі телемарафону, передає 24 Канал.\nДивіться також Зниклі безвісти під час війни: як їх шукають і що слід знати рідним, аби не потрапити до шахр... [985 chars]","url":"https://24tv.ua/chastina-shahediv-bula-zbita-suhoputni-viyska-pro-udar-po-navchalnomu_n2854725","image":"https://24tv.ua/resources/photos/news/202506/2854725.jpg?v=1750783578000&w=1200&h=675","publishedAt":"2025-06-24T16:45:18Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Саміт НАТО уникнув питання про припинення Трампом військової допомоги Україні, - WP","description":"Серед союзників України складається розуміння того, що адміністрація президента США Дональда Трампа не готова надати Києву нову військову допомогу.","content":"Припинення військової допомоги з боку США може знизити шанси України на досягнення успіхів на полі бою.\nСьогодні, 24 червня, розпочався дводенний саміт НАТО в Гаазі, учасники якого обережно оминають розбіжності, намагаючись показати єдність. Водночас... [4429 chars]","url":"https://www.unian.ua/world/zbroya-dlya-ukrajini-samit-nato-uniknuv-pitannya-pro-pripinennya-trampom-dopomogi-kiyevu-13047960.html","image":"https://images.unian.net/photos/2025_06/thumb_files/1000_545_1750782240-9509.jpg?1","publishedAt":"2025-06-24T16:31:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"характеристики та ціна нового смартфона від Xiaomi","description":"Компанія Xiaomi представила на світовому ринку середньобюджетний телефон Poco F7. Детальніше про те, що відомо про смартфон, характеристики та ціну Poco F7 – читайте на Фактах ICTV","content":"Компанія Xiaomi презентувала новий смартфон Poco F7 з флагманським процесором, великою батареєю та розширеними ШІ-функціями.\nЙого вже називають однією з найцікавіших новинок сезону за співвідношенням ціни та характеристик.\nPoco F7 – характеристики та... [1669 chars]","url":"https://fakty.com.ua/ua/styl-zhyttia/nauka-tekhnolohii/20250624-smartfon-poco-f7-vid-xiaomi-harakterystyky-ta-czina-v-ukrayini/","image":"https://cdn.fakty.com.ua/wp-content/uploads/2025/06/24/poco-f7-768x432.jpg","publishedAt":"2025-06-24T16:16:00Z","source":{"name":"fakty.com.ua","url":"https://fakty.com.ua"}},{"title":"Удар по ліцею в Білгород-Дністровському 23 червня","description":"У Білгород-Дністровському 16-річний хлопець врятував друга після російського обстрілу. Діти разом з директоркою перебувають у лікарні, що відомо про героїчний вчинок - читайте на 24 Каналі.","content":"Про це повідомляє 24 Канал з посиланням на начальника Одеської ОВА Олега Кіпера.\nДивіться також Наступного дня після випуску: росіяни поранили школярів під час атаки по Білгород-Дністровському\nСміливий вчинок 16-річного Марка з Білгород-Дністровськог... [1163 chars]","url":"https://24tv.ua/udar-po-litseyu-bilgorod-dnistrovskomu-23-chervnya-shkolyar-vityagnuv_n2854635","image":"https://24tv.ua/resources/photos/news/202506/2854635.jpg?v=1750780489000&w=1200&h=675","publishedAt":"2025-06-24T16:15:49Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"ВАКС обиратиме запобіжний захід Чернишову: чи йдеться про тримання під вартою","description":"ВАКС розгляне 25 червня клопотання САП щодо застави для віцепрем'єра Чернишова – підозрюваного в одержанні хабаря. Розслідування веде НАБУ і САП - 24 Канал","content":"Розгляд справи відбудеться суддею Віталієм Крикливим 25 червня о 11:00. Клопотання ґрунтується на підозрі Чернишова у зловживанні службовим становищем і отриманні неправомірної вигоди в особливо великому розмірі. Про це повідомляє 24 Канал із посилан... [1401 chars]","url":"https://24tv.ua/oleksandr-chernishov-sap-prosit-dlya-vitsepremyera-zastavu-bez_n2854677","image":"https://24tv.ua/resources/photos/news/202506/2854677.jpg?v=1750778129000&w=1200&h=675","publishedAt":"2025-06-24T16:01:55Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Трамп злив у мережу листування з Рютте","description":"24 червня Трамп оприлюднив листування з генсеком НАТО Марка Рютте. Той хвалить президента США за його рішучі дії в Ірані. Що відомо - Геополітика","content":"У своїй соцмережі Truth Social Дональд Трамп опублікував скриншот повідомлення, надісланого йому генсеком НАТО Марком Рютте, в якому той вітає президента США з \"рішучими діями\" в Ірані, передає 24 Канал.\nДивіться також Трамп вирішує все: ЗМІ звернули... [812 chars]","url":"https://24tv.ua/geopolitics/tramp-oprilyudniv-perepisku-ryutte-shhodo-iranu_n2854692","image":"https://24tv.ua/resources/photos/news/202506/2854692.jpg?v=1750780628000&w=1200&h=675","publishedAt":"2025-06-24T16:01:42Z","source":{"name":"24 Канал","url":"https://24tv.ua"}}]}