{"totalArticles":6776524,"articles":[{"title":"Rare strawberry moon in Toronto to illuminate sky","description":"As we approach summer, June’s strawberry moon will illuminate the skies Tuesday but this year, it will appear larger and lower on the horizon — becoming the lowest full moon since 2006.","content":"Country\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's So... [4996 chars]","url":"https://www.thestar.com/news/gta/toronto-could-see-a-larger-and-reddish-strawberry-moon-tuesday-heres-what-to-know-about/article_b6b0d379-ec65-4074-886f-cd2303b2f733.html","image":"https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/5/94/594c5565-732e-5ecc-9fc2-bbbb1dd1f703/6848408645387.image.jpg?crop=1837%2C964%2C0%2C81&resize=1200%2C630&order=crop%2Cresize","publishedAt":"2025-06-11T01:09:06Z","source":{"name":"Toronto Star","url":"https://www.thestar.com"}},{"title":"PMVICs report 45% of inspected vehicles failed brake test, 37% with defective headlights","description":"Are road crashes becoming more frequent, or is the prevalence of cellphone and dashcam use only highlighting their horrific regular occurance? One thing’s for...","content":"Headlight beam alignment and intensity is tested with a highly precise instrument to ensure it doesn't glare oncoming vehicles.\nAre road crashes becoming more frequent, or is the prevalence of cellphone and dashcam use only highlighting their horrifi... [5022 chars]","url":"https://mb.com.ph/2025/06/11/pmvics-push-for-vehicle-inspection-as-solution-to-rising-road-crashes","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/11/18425.webp","publishedAt":"2025-06-11T01:06:25Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Using causal machine learning to identify potential ALS treatments","description":"Potential treatments for amyotrophic lateral sclerosis (ALS) and other neurodegenerative diseases may already be out there in the form of drugs prescribed for other conditions.","content":"Potential treatments for amyotrophic lateral sclerosis (ALS) and other neurodegenerative diseases may already be out there in the form of drugs prescribed for other conditions. A team of researchers from Lawrence Livermore National Laboratory (LLNL),... [5478 chars]","url":"https://www.news-medical.net/news/20250610/Using-causal-machine-learning-to-identify-potential-ALS-treatments.aspx","image":"https://www.news-medical.net/image-handler/picture/2019/5/futuristic_techno_design_on_background_of_supercomputer_data_center_-_Image_-_Timofeev_Vladimir_M1_402c068791b640469e416c4f55d84afe-620x480.jpg","publishedAt":"2025-06-11T01:04:00Z","source":{"name":"News-Medical","url":"https://www.news-medical.net"}},{"title":"Those ‘what I eat in a day’ TikTok videos aren’t helpful. They might even be harmful","description":"They might seem like harmless fun but in fact they can reinforce dangerous ideas about food, weight and body image.","content":"You may have come across those “what I eat in a day” videos on social media, where people – usually conventionally attractive influencers wearing activewear – list everything they consumed that day.\nThey might seem like harmless fun but in fact they ... [5406 chars]","url":"https://theconversation.com/those-what-i-eat-in-a-day-tiktok-videos-arent-helpful-they-might-even-be-harmful-257127","image":"https://images.theconversation.com/files/671493/original/file-20250602-56-qr1831.jpg?ixlib=rb-4.1.0&rect=0%2C396%2C5000%2C2500&q=45&auto=format&w=1356&h=668&fit=crop","publishedAt":"2025-06-11T01:03:00Z","source":{"name":"The Conversation","url":"https://theconversation.com"}},{"title":"Australia and South Africa greats pick the winners of WTC final 2025 at Lord's; is Temba Bavuma listening?","description":"Six of the top legends of Australian and South African cricket picked their favourites to win the World Test Championship Final 2025. | Cricket","content":"It's all come down to this. Australia. South Africa. Lord's. The World Test Championship final. Two teams that deserve to be at the Mecca of cricket. Australia, the defending champions, are featuring in their second WTC final. South Africa, their fir... [4281 chars]","url":"https://www.hindustantimes.com/cricket/australia-and-south-africa-greats-pick-the-winners-of-wtc-final-2025-at-lords-is-temba-bavuma-listening-101749570865000.html","image":"https://www.hindustantimes.com/ht-img/img/2025/06/10/1600x900/Temba_Bavuma_Pat_Cummins_1749571442675_1749571447311.jpg","publishedAt":"2025-06-11T00:57:02Z","source":{"name":"Hindustan Times","url":"https://www.hindustantimes.com"}},{"title":"Lung cells in COPD patients show higher levels of soot-like carbon deposits","description":"Cells taken from the lungs of people with chronic obstructive pulmonary disease (COPD) have a larger accumulation of soot-like carbon deposits compared to cells taken from people who smoke but do not have COPD, according to a study published today (Wednesday) in ERJ Open Research.","content":"Cells taken from the lungs of people with chronic obstructive pulmonary disease (COPD) have a larger accumulation of soot-like carbon deposits compared to cells taken from people who smoke but do not have COPD, according to a study published today (W... [3452 chars]","url":"https://www.news-medical.net/news/20250610/Lung-cells-in-COPD-patients-show-higher-levels-of-soot-like-carbon-deposits.aspx","image":"https://www.news-medical.net/image-handler/picture/2014/7/Respiratory-620x480.jpg","publishedAt":"2025-06-11T00:34:00Z","source":{"name":"News-Medical","url":"https://www.news-medical.net"}},{"title":"Scott Wolf divorcing wife Kelley after 21 years","description":"Scott Wolf and his wife, Kelley, are divorcing after more than two decades of marriage. The '90s heartthrob's estranged parter announced the news on Tuesday.","content":"It was a good run.\nScott Wolf and his wife, Kelley, are divorcing after more than two decades of marriage.\nThe ’90s heartthrob, known for playing Bailey Salinger on “Party of Five,” married Kelley in 2004, and they share three children: Jackson, Mill... [4095 chars]","url":"https://nypost.com/2025/06/10/entertainment/scott-wolf-divorcing-wife-kelley-after-21-years/","image":"https://nypost.com/wp-content/uploads/sites/2/2025/06/106267446.jpg?quality=75&strip=all&w=1024","publishedAt":"2025-06-11T00:26:00Z","source":{"name":"New York Post","url":"https://nypost.com"}},{"title":"Protecting Canada’s livestock industry with a new vaccine bank","description":"Canada is making significant progress towards the creation of a dedicated foot-and-mouth disease (FMD) vaccine bank. This will build on existing prote...","content":"Protecting Canada’s livestock industry with a new vaccine bank Jun 10, 2025 | 3:42 PM\nCanada is making significant progress towards the creation of a dedicated foot-and-mouth disease (FMD) vaccine bank.\nThis will build on existing protections for the... [605 chars]","url":"https://panow.com/2025/06/10/protecting-canadas-livestock-industry-with-a-new-vaccine-bank/","image":"https://d2ksr9467jthww.cloudfront.net/2025061021060/da327dea-fb3c-4f79-80a2-7a1cead1dcdd.jpg","publishedAt":"2025-06-11T00:11:52Z","source":{"name":"paNOW","url":"https://panow.com"}},{"title":"Scorching heat grips twin cities with mercury rising to 45°C","description":"RAWALPINDI: Scorching heat and humidity gripped the twin cities of Rawalpindi and Islamabad on Tuesday, driving most...","content":"RAWALPINDI: Scorching heat and humidity gripped the twin cities of Rawalpindi and Islamabad on Tuesday, driving most residents indoors as temperature soared to 45°C.\n“No respite is likely from the hot and dry weather over the next two days,” said an ... [1449 chars]","url":"https://www.dawn.com/news/1916381/scorching-heat-grips-twin-cities-with-mercury-rising-to-450c","image":"https://i.dawn.com/large/2025/06/6848af9a71b03.jpg","publishedAt":"2025-06-11T00:01:44Z","source":{"name":"Dawn","url":"https://www.dawn.com"}},{"title":"Parking on Chundrigar Road banned to ensure smooth flow of traffic","description":"People will be allowed to park their cars, motorbikes at Railway Ground, CM Murad told","content":"KARACHI: The Sindh government on Tuesday decided to impose a strict ban on parking of vehicles on I.I. Chundrigarh Road to improve smooth flow of traffic and road safety.\nA decision to this effect was taken by Sindh Chief Minister Murad Ali Shah, who... [2331 chars]","url":"https://www.dawn.com/news/1916396/parking-on-chundrigar-road-banned-to-ensure-smooth-flow-of-traffic","image":"https://i.dawn.com/large/2025/06/6848b351a576c.jpg","publishedAt":"2025-06-11T00:01:29Z","source":{"name":"Dawn","url":"https://www.dawn.com"}}]}