{"totalArticles":7012604,"articles":[{"title":"Ancient Frog Fossil Changes Our Understanding of Australia's Evolution","description":"Discover how a 55-million-year-old frog fossil is reshaping our understanding of Australia's evolutionary history.","content":"A remarkable discovery has just redefined Australia’s frog evolution. A 55-million-year-old fossil, is rewriting our understanding of frog history, pushing back the timeline of Australian tree frogs by millions of years. This fossil, which is the old... [5263 chars]","url":"https://indiandefencereview.com/frog-fossil-changes-australias-evolution/","image":"https://indiandefencereview.com/wp-content/uploads/2025/06/australian-green-tree-frog.jpg","publishedAt":"2025-06-14T14:00:00Z","source":{"name":"Indian Defence Review","url":"https://indiandefencereview.com"}},{"title":"Rice University students develop vibration-vest to guide blind dogs navigate","description":"Rice University students have created a haptic vest for blind dogs, using cameras and vibrations to help pets navigate obstacles.","content":"A team of Rice University engineering students has developed a high-tech vest to help blind dogs navigate their environments more safely and independently.\nThe wearable, inspired by a Houston dog named Kunde, uses real-time spatial sensing and vibrat... [2760 chars]","url":"https://tribune.com.pk/story/2550826/rice-university-students-develop-vibration-vest-to-guide-blind-dogs-navigate","image":"https://i.tribune.com.pk/media/images/news-story-640-x-480-px-431749908565-0/news-story-640-x-480-px-431749908565-0.png","publishedAt":"2025-06-14T13:44:44Z","source":{"name":"The Express Tribune","url":"https://tribune.com.pk"}},{"title":"Researchers from Calicut varsity develop cost-effective nanoclusters","description":"Cutting-edge LED technology using gold-copper alloy nanoclusters developed by University of Calicut researchers for sustainable lighting applications.","content":"Researchers from the Department of Nanoscience and Technology at the University of Calicut have developed a novel device based on gold–copper alloy nanoclusters, a ground-breaking advancement in next-generation light-emitting diode (LED) technology.\n... [2078 chars]","url":"https://www.thehindu.com/news/national/kerala/researchers-from-calicut-varsity-develop-cost-effective-nanoclusters/article69694510.ece","image":"https://www.thehindu.com/theme/images/og-image.png","publishedAt":"2025-06-14T13:34:00Z","source":{"name":"The Hindu","url":"https://www.thehindu.com"}},{"title":"2 Minnesota lawmakers shot in apparent 'targeted' incidents, in grave condition; manhunt underway","description":"Two Minnesota state lawmakers were shot in apparent \"targeted\" incidents on Saturday that left them in grave condition, officials said.","content":"The shootings took place in Champlin and Brooklyn Park, Minnesota.\nMinnesota State Representative Melissa Hortman and Minnesota State Senator John Hoffman are shown in these undated file photos.\nMinnesota State Representative Melissa Hortman and Minn... [1432 chars]","url":"https://abcnews.go.com/US/2-minnesota-lawmakers-shot-targeted-incident-officials/story?id=122840751","image":"https://i.abcnewsfe.com/a/a5180185-58e8-4f96-a36c-5f9b4d64e5ac/minnesota-lawmakers-shot-ht-jt-250614_1749909308517_hpMain_16x9.jpg?w=1600","publishedAt":"2025-06-14T13:30:36Z","source":{"name":"ABC News","url":"https://abcnews.go.com"}},{"title":"Two years on, Singapore's shift to preventive healthcare is bearing fruits - but what's holding it back from greater buy-in?","description":"More than a million Singaporeans and permanent residents aged 40 and above have signed up for Healthier SG, but not all have followed through with their health plans.","content":"Several who spoke to CNA TODAY thought that the Healthier SG programme was akin to CHAS and Age Well SG, even though those are separate schemes with vastly different aims.\nCHAS, for example, is a subsidy scheme for all Singapore citizens to offset th... [6985 chars]","url":"https://www.channelnewsasia.com/today/big-read/healthier-sg-better-health-outcomes-5176061","image":"https://dam.mediacorp.sg/image/upload/s--EzgJvbLO--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2025/06/13/20250615-ns-llbr0615.jpg?itok=U74kT9dQ","publishedAt":"2025-06-14T13:30:00Z","source":{"name":"CNA","url":"https://www.channelnewsasia.com"}},{"title":"James Webb Space Telescope Captures Odd Silicate Clouds and a Rare Moon-Forming Disk","description":"Fresh James Webb Space Telescope images capture two young exoplanets in, providing new details about exoplanet atmospheres and formation.","content":"NASA’s James Webb Space Telescope has captured high-resolution information on two young exoplanets, providing astrophysicists with fresh details about exoplanet atmospheres and formation.\nThe new Webb findings reveal intriguing details about each pla... [4031 chars]","url":"https://thedebrief.org/james-webb-space-telescope-captures-odd-silicate-clouds-and-a-rare-moon-forming-disk/","image":"https://thedebrief.b-cdn.net/wp-content/uploads/2025/06/james-webb-space-telelscope-moon-disk.jpg","publishedAt":"2025-06-14T13:22:30Z","source":{"name":"The Debrief","url":"https://thedebrief.org"}},{"title":"Making Babies: Inducing labour","description":"Maternity units around the country are seeing increasing numbers of patients being induced – but how exactly does the process work?","content":"Maternity units around the country are seeing more patients being induced when compared to even just 10-years ago – but how exactly does the process work?\nOn this week’s Making Babies segment, Master of the National Maternity Hospital Professor Shane... [2620 chars]","url":"https://www.newstalk.com/news/making-babies-inducing-labour-2170449","image":"https://media.radiocms.net/uploads/2025/06/14135758/2CECCA4.jpg","publishedAt":"2025-06-14T13:12:10Z","source":{"name":"Newstalk","url":"https://www.newstalk.com"}},{"title":"Iran-Israel conflict: Israel says 'Tehran will burn' after Iran targets Tel Aviv with missiles","description":"Iran and Israel have targeted each other with missiles and air strikes with warning sirens ringing out across both countries, as DFAT warns Australians in Israel and Iran to shelter. Follow live.","content":"Melbourne man Bren Carlill has spoken from inside his hotel in Jerusalem, where he says the feeling is \"tense.\"\nOvernight, he and the other Australians he's travelling with, had to bunker inside the hotel's bomb shelter twice after red alert sirens w... [851 chars]","url":"https://www.abc.net.au/news/2025-06-14/israel-launches-fresh-strikes-iran-live-updates/105416104","image":"https://live-production.wcms.abc-cdn.net.au/e845030c3c7fcb367530bf1f74268133?impolicy=wcms_watermark_news&cropH=900&cropW=1600&xPos=0&yPos=113&width=862&height=485&imformat=generic","publishedAt":"2025-06-14T13:10:38Z","source":{"name":"Australian Broadcasting Corporation","url":"https://www.abc.net.au"}},{"title":"Is Anirudh Ravichander marrying Sunrisers Hyderabad co-owner Kavya Maran? He responds","description":"Music composer Anirudh Ravichander has responded to rumours that he will marry Sunrisers Hyderabad co-owner Kavya Maran soon after dating.","content":"Music composer Anirudh Ravichander has responded to rumours of him tying the knot with Sunrisers Hyderabad co-owner Kavya Maran soon. After a day of Reddit going into overdrive and believing the two are dating and will be married soon, spawning numer... [1991 chars]","url":"https://www.hindustantimes.com/entertainment/tamil-cinema/is-anirudh-ravichander-marrying-sunrisers-hyderabad-co-owner-kavya-maran-he-responds-101749905058895.html","image":"https://www.hindustantimes.com/ht-img/img/2025/06/14/1600x900/Anirudh_Ravichander_Kavya_Maran_1749906553882_1749906561147.jpg","publishedAt":"2025-06-14T13:09:33Z","source":{"name":"Hindustan Times","url":"https://www.hindustantimes.com"}},{"title":"Cannot afford Iran conflict to turn into Iraq 2.0 or WWIII: Bilawal","description":"Defence Minister Khawaja Asif says Pakistan will “safeguard Iran’s interests”.","content":"Former foreign minister Bilawal Bhutto-Zardari on Saturday said that Pakistan cannot afford conflict in Iran to turn into Iraq 2.0 or World War III, amid the ongoing tensions between Iran and Israel.\nThere were reports of new Israeli strikes in Iran ... [2649 chars]","url":"https://www.dawn.com/news/1917111/cannot-afford-iran-conflict-to-turn-into-iraq-20-or-wwiii-bilawal","image":"https://i.dawn.com/large/2025/06/141758259b13ba7.jpg?r=181131","publishedAt":"2025-06-14T13:06:40Z","source":{"name":"Dawn","url":"https://www.dawn.com"}}]}