{"totalArticles":6951780,"articles":[{"title":"Chinese astronomers recorded details of dying star’s explosion in 1408: study","description":"Modern researchers think they have identified the stellar remnant and are appealing to observatories to take a closer look","content":"Just after sunset on an October evening in 1408, six years into the reign of the Ming dynasty’s Emperor Yongle, Chinese court astronomers spotted a mysterious new star glowing high in the southern sky, near the heart of the Milky Way.\n“It was about t... [3655 chars]","url":"https://www.thestar.com.my/aseanplus/aseanplus-news/2025/06/14/chinese-astronomers-recorded-details-of-dying-stars-explosion-in-1408-study","image":"https://apicms.thestar.com.my/uploads/images/2025/06/14/3364603.jpg","publishedAt":"2025-06-14T08:51:00Z","source":{"name":"thestar.com.my","url":"https://www.thestar.com.my"}},{"title":"Tiny and toxic: Researchers track smaller air pollution particles across US skies","description":"Air pollution causes health problems and is attributable to some 50,000 annual deaths in the United States, but not all air pollutants pack the same punch.","content":"This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\nResearchers at WashU determined the concentration of submicron partic... [4623 chars]","url":"https://phys.org/news/2025-06-tiny-toxic-track-smaller-air.html","image":"https://scx2.b-cdn.net/gfx/news/2025/tiny-and-toxic-researc.jpg","publishedAt":"2025-06-14T08:03:41Z","source":{"name":"Phys.org","url":"https://phys.org"}},{"title":"Air India Ahmedabad plane crash: Death toll hits 270, families wait for bodies","description":"Air India plane crash in Ahmedabad leaves 270 dead, families frustrated with delays in body handovers.","content":"The death toll in the deadly Air India plane crash rose to 270 on Saturday (June 14, 2025), with families increasingly getting upset due to delays in handing over bodies which were badly charred in the tragedy in Ahmedabad.\nThe Boeing 787-8 Dreamline... [2259 chars]","url":"https://www.thehindu.com/news/national/gujarat/air-india-ahmedabad-plane-crash-death-toll-rises/article69693991.ece","image":"https://th-i.thgim.com/public/incoming/9b6fih/article69693999.ece/alternates/LANDSCAPE_1200/PTI06_14_2025_RPT027A.jpg","publishedAt":"2025-06-14T07:43:00Z","source":{"name":"The Hindu","url":"https://www.thehindu.com"}},{"title":"Bryan Mbeumo has already told Tottenham players what to expect from Thomas Frank","description":"Bryan Mbeumo has been tipped to reunite with Thomas Frank at Tottenham.","content":"Bryan Mbeumo spent six years playing under Thomas Frank at Brentford\nTottenham players will be greeted by a new face when they report back for pre-season. Just over three weeks on from their Europa League triumph, Ange Postecoglou has given way to Th... [2044 chars]","url":"https://www.express.co.uk/sport/football/2068564/bryan-mbeumo-tottenham-thomas-frank","image":"https://cdn.images.express.co.uk/img/dynamic/67/1200x630/6228807.jpg","publishedAt":"2025-06-14T07:27:00Z","source":{"name":"Daily Express","url":"https://www.express.co.uk"}},{"title":"Australian killed, another injured in Bali villa shooting incident","description":"According to Badung Police Chief Arif Batubara, two Australian nationals were involved in a shooting incide...","content":"An Australian man has died and another is injured after a reported shooting in Bali .\nAccording to Badung Police Chief Arif Batubara, two Australian nationals were involved in a shooting incident at a villa in Mengwi, Bali, earlier today.\nBatabura sa... [429 chars]","url":"https://www.9news.com.au/world/australian-killed-another-injured-in-bali-villa-shooting-incident/31959225-8263-4e12-82de-49fb7c7991b0","image":"https://imageresizer.static9.net.au/-pzezs_LhSElyxcw7CQieghKYmw=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F29c57e7d-0016-4e29-a0c7-aea200722c11","publishedAt":"2025-06-14T07:25:35Z","source":{"name":"9News.com.au","url":"https://www.9news.com.au"}},{"title":"SC upholds MORE Power's expansion in Iloilo with finality","description":"ILOILO CITY – The Supreme Court (SC) has ruled the expansion of MORE Electric and Power Corp. (MORE Power) of the Razon Goup into several areas of Iloilo...","content":"ILOILO CITY – The Supreme Court (SC) has ruled the expansion of MORE Electric and Power Corp. (MORE Power) of the Razon Goup into several areas of Iloilo province with finality.\nA LINEMAN of MORE Power in Iloilo City. MORE Power is set to expand in I... [1106 chars]","url":"https://mb.com.ph/2025/06/14/sc-upholds-more-powers-expansion-in-iloilo-with-finality","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/14/19413.webp","publishedAt":"2025-06-14T07:20:04Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Trump to preside over military parade as US cities prepare for 'No Kings' demonstrations","description":"Organisers said the rallies would be the largest since Trump returned to office in January.","content":"ARMED US MARINES have arrived on the streets of Los Angeles as part of a large deployment of troops ordered by Donald Trump as the US braces for widespread protests to coincide with a large-scale military parade in Washington.\nOn his 79th birthday, T... [5123 chars]","url":"https://www.thejournal.ie/marines-los-angeles-no-kings-protests-donald-trump-6733056-Jun2025/","image":"https://img2.thejournal.ie/article/6733056/river/?height=400&version=6733072","publishedAt":"2025-06-14T07:19:00Z","source":{"name":"The Journal","url":"https://www.thejournal.ie"}},{"title":"NEET UG Result 2025 today! Download scorecard from neet.nta.nic.in using THESE credentials; 5-steps to check here","description":"NEET UG Result 2025: NTA announced the National Eligibility-cum-Entrance Test Under-graduate result today. Candidates can download their scorecards from neet.nta.nic.in.","content":"NEET UG Result 2025: The results of National Eligibility-cum-Entrance Test Under-graduate (NEET UG) were announced today, as per the schedule mentioned in the NTA circular dated February 7. NTA has released the ‘Final Answer Keys for NEET(UG)-2025' a... [2269 chars]","url":"https://www.livemint.com/education/neet-ug-result-2025-today-download-scorecard-from-neet-nta-nic-in-using-these-credentials-5-steps-to-check-here-11749883462136.html","image":"https://www.livemint.com/lm-img/img/2025/06/14/1600x900/NEET_1749883747725_1749883747930.JPG","publishedAt":"2025-06-14T07:18:53Z","source":{"name":"Mint","url":"https://www.livemint.com"}},{"title":"India plane crash death toll rises to 279","description":"AHMEDABAD, India - Grieving families waited Saturday for news after one of the deadliest air disasters in decades, with the toll rising to 279 people killed in the Indian passenger jet crash.","content":"Policemen stand guard outside the post mortem room, where the bodies of the victims who died after the Air India Boeing 787-8 Dreamliner plane bound for London's Gatwick Airport crashed during takeoff from Ahmedabad have been kept, at a hospital, in ... [2413 chars]","url":"https://www.gmanetwork.com/news/topstories/world/949398/india-plane-crash-death-toll-rises-to-279/story/","image":"https://images.gmanews.tv/webpics/2025/06/Air_India_crash_post_mortem_2025_06_14_15_12_43.jpg","publishedAt":"2025-06-14T07:18:46Z","source":{"name":"GMA Network","url":"https://www.gmanetwork.com"}},{"title":"Aviation expert reveals Air India crash theory and pinpoints 'cockpit mistake'","description":"The Air India flight AI171 killed all but one of the 242 people onboard.","content":"Thursday's Air India plane crash in Ahmedabad, Western India\nAn aviation expert and YouTuber who analyses plane crashes thinks the co-pilot on the Air India flight AI171 made an exceptionally simple error in the cockpit when he was asked to retract t... [1989 chars]","url":"https://www.express.co.uk/news/world/2068560/aviation-expert-air-india-crash-theory","image":"https://cdn.images.express.co.uk/img/dynamic/78/1200x630/6228774.jpg","publishedAt":"2025-06-14T07:17:00Z","source":{"name":"Daily Express","url":"https://www.express.co.uk"}}]}