{"totalArticles":6929622,"articles":[{"title":"5 foods that can lower cancer risk","description":"Discover five scientifically supported foods that can help reduce your risk of cancer, including broccoli, berries, carrots, whole grains, and olive oil. Eating a balanced diet rich in these nutrient-dense foods can play a significant role in cancer prevention.","content":"According to the World Health Organization, cancer is a leading cause of death globally. However, incorporating nutrient-dense foods into your diet can significantly reduce cancer risk. Broccoli, berries, carrots, whole grains, and olive oil are high... [3313 chars]","url":"https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/5-foods-that-can-lower-cancer-risk/articleshow/121883705.cms","image":"https://static.toiimg.com/thumb/msid-121883705,width-1070,height-580,imgsize-59016,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2025-06-16T22:30:00Z","source":{"name":"Times of India","url":"https://timesofindia.indiatimes.com"}},{"title":"PM says blue economy is Pakistan's next frontier","description":"PM says blue economy is Pakistan's next frontier","content":"Prime Minister Shehbaz Sharif on Monday called for a unified national effort and stronger collaboration between the public and private sectors to transform the maritime sector into a catalyst for inclusive growth and unlock its vast potential.\nAddres... [2554 chars]","url":"https://tribune.com.pk/story/2551238/pm-says-blue-economy-is-pakistans-next-frontier","image":"https://i.tribune.com.pk/media/images/pm-shehbaz-pid1749141851-0/pm-shehbaz-pid1749141851-0.jpg","publishedAt":"2025-06-16T22:28:58Z","source":{"name":"The Express Tribune","url":"https://tribune.com.pk"}},{"title":"Trump does not intend to sign joint G7 statement on Iran","description":"President Donald Trump does not intend to sign a joint statement calling for de-escalation between Israel and Iran that had been drafted by G7 leaders in Canada, according to a person familiar with the matter, though officials preparing the document held out hope that he could eventually be convinced to add his name.","content":"Calgary, Alberta CNN —\nPresident Donald Trump does not intend to sign a joint statement calling for de-escalation between Israel and Iran that had been drafted by G7 leaders in Canada, according to a person familiar with the matter, though officials ... [6738 chars]","url":"https://www.cnn.com/2025/06/16/politics/trump-israel-iran-g7-statement","image":"https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2219726418.jpg?c=16x9&q=w_800,c_fill","publishedAt":"2025-06-16T22:23:00Z","source":{"name":"CNN","url":"https://www.cnn.com"}},{"title":"Monitoring industrial production: NA panel rejects FBR’s budget proposal","description":"ISLAMABAD: The National Assembly Standing Committee on Finance and Revenue on Monday rejected a budget proposal of...","content":"ISLAMABAD: The National Assembly Standing Committee on Finance and Revenue on Monday rejected a budget proposal of the Federal Board of Revenue (FBR) to deploy its employees to monitor the production of industries, observing that it will result into ... [3172 chars]","url":"https://www.brecorder.com/news/40368089/monitoring-industrial-production-na-panel-rejects-fbrs-budget-proposal","image":"https://i.brecorder.com/large/2025/06/685084196e837.jpg","publishedAt":"2025-06-16T22:11:27Z","source":{"name":"Business Recorder","url":"https://www.brecorder.com"}},{"title":"Govt could have done more in the budget","description":"EDITORIAL: The tailwind is with them — the economy is stabilising, elections are three years away, and the...","content":"EDITORIAL: The tailwind is with them — the economy is stabilising, elections are three years away, and the government is firmly in control. The timing could not be better to expand the tax base and start trimming the government’s fat. But, instead, i... [3004 chars]","url":"https://www.brecorder.com/news/40368069/govt-could-have-done-more-in-the-budget","image":"https://i.brecorder.com/large/2025/06/68507b357340d.jpg","publishedAt":"2025-06-16T22:11:24Z","source":{"name":"Business Recorder","url":"https://www.brecorder.com"}},{"title":"Break-in suspect facing murder charge after man's body found, police say","description":"A 30-year-old woman arrested and hospitalised following a break-in in Adelaide's east is expected to be charged with the murder of a 65-year-old man whose body was found at a nearby unit, police say.","content":"A woman arrested over a break-in in Adelaide's east is expected to be charged with the murder of a 65-year-old man whose body was found at a nearby unit, police say.\nPolice were called to the unit on Walkerville Terrace at Gilberton about 7pm on Mond... [729 chars]","url":"https://www.abc.net.au/news/2025-06-17/woman-arrested-following-death-man-at-walkerville/105425202","image":"https://live-production.wcms.abc-cdn.net.au/aa1688b2770c2213e623f74c7784d3ae?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic","publishedAt":"2025-06-16T22:04:00Z","source":{"name":"Australian Broadcasting Corporation","url":"https://www.abc.net.au"}},{"title":"Philippines climbs in global competitiveness, but still lags in Asia-Pacific","description":"The Philippines climbed one spot in this year’s edition of the World Competitiveness Ranking by the Switzerland-based International Institute for Management...","content":"Philippines climbs in global competitiveness, but still lags in Asia-Pacific\nThe Philippines climbs one spot in global competitiveness, but still ranks among the lowest in Asia-Pacific.\nThe Philippines climbed one spot in this year’s edition of the W... [3284 chars]","url":"https://mb.com.ph/2025/06/17/philippines-climbs-in-global-competitiveness-but-still-lags-in-asia-pacific","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/16/19810.webp","publishedAt":"2025-06-16T22:02:32Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Gorge Canada Day Picnic set to celebrate 25 years with expanded line-up","description":"The Gorge Canada Day Picnic returns with a full day of festivities along the Gorge Waterway to mark a quarter-century of community spirit.","content":"One of Greater Victoria’s most beloved Canada Day traditions is turning 25.\nThe Gorge Canada Day Picnic returns Tuesday, July 1, with a full day of free festivities along the Gorge Waterway to mark a quarter-century of community spirit.\nThe event wil... [1629 chars]","url":"https://cheknews.ca/gorge-canada-day-picnic-set-to-celebrate-25-years-with-expanded-line-up-1261356/","image":"https://cheknews.ca/wp-content/uploads/2025/06/7B687F16-3BC3-4118-96C6-2ACD42947569_1_105_c.jpeg","publishedAt":"2025-06-16T22:02:02Z","source":{"name":"CHEK News","url":"https://cheknews.ca"}},{"title":"Priority for PH schools: Stable power, internet","description":"President Marcos on Monday called for stronger government action to address long-standing problems in public schools.","content":"MANILA, Philippines — President Marcos on Monday called for stronger government action to address long-standing problems in public schools, including the unstable electricity supply and internet access, heavy teacher workload, and poor student well-b... [4985 chars]","url":"https://newsinfo.inquirer.net/2071196/priority-for-ph-schools-stable-power-internet","image":"https://newsinfo.inquirer.net/files/2025/06/President-Marcos-School-17June2025.jpg","publishedAt":"2025-06-16T21:55:00Z","source":{"name":"Inquirer.net","url":"https://newsinfo.inquirer.net"}},{"title":"Tip shop makes change after parents address sale of kids' disability equipment","description":"When Bridget Lockley and her partner saw their local tip shop selling a bike for children with special needs, what could have been an opportunity instead left them outraged.","content":"When Bridget Lockley and her partner saw their local tip shop selling an adaptive children's bike, what could have been an opportunity instead left them outraged.\nThe bike was priced at $500.\nThe same store was also selling a children's high-low chai... [6779 chars]","url":"https://www.abc.net.au/news/2025-06-17/tasmania-disability-equipment-second-hand-expensive/105359218","image":"https://live-production.wcms.abc-cdn.net.au/4fb3b2b728507ee3e4027c88e90ef1bb?impolicy=wcms_watermark_news&cropH=3078&cropW=5472&xPos=0&yPos=23&width=862&height=485&imformat=generic","publishedAt":"2025-06-16T21:50:55Z","source":{"name":"Australian Broadcasting Corporation","url":"https://www.abc.net.au"}}]}