{"totalArticles":7093452,"articles":[{"title":"Imran’s bail plea hearing cancelled, but Gohar expects his early release","description":"ISLAMABAD: While the hearing of bail pleas of former prime minister Imran Khan and his spouse Bushra Bibi in the...","content":"ISLAMABAD: While the hearing of bail pleas of former prime minister Imran Khan and his spouse Bushra Bibi in the £190 million case was cancelled after a judge went on leave, Pakistan Tehreek-i-Insaf (PTI) chairman Barrister Gohar Ali Khan expressed h... [1467 chars]","url":"https://www.dawn.com/news/1916659/imrans-bail-plea-hearing-cancelled-but-gohar-expects-his-early-release","image":"https://www.dawn.com/_img/social-default.jpg","publishedAt":"2025-06-12T02:41:49Z","source":{"name":"Dawn","url":"https://www.dawn.com"}},{"title":"'Ingat pa din': NCRPO steps up drive vs criminals posing as motorcycle taxi riders","description":"Police Maj. Gen. Anthony A. Aberin, director of the National Capital Region Police Office (NCRPO), has ordered regular patrol operations targeting robbers and...","content":"Police Maj. Gen. Anthony A. Aberin, director of the National Capital Region Police Office (NCRPO), has ordered regular patrol operations targeting robbers and other criminal elements posing as motorcycle taxi and delivery riders in Metro Manila.\nAber... [1528 chars]","url":"https://mb.com.ph/2025/06/12/ingat-pa-din-ncrpo-steps-up-drive-vs-criminals-posing-as-motorcycle-taxi-riders","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/12/18796.webp","publishedAt":"2025-06-12T02:37:13Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Chikungunya vaccine could stop millions of infections worldwide, study finds","description":"A landmark global modeling study reveals that more than 2.8 billion people in 104 countries are at risk of chikungunya, with up to 35 million infections annually. Strategic deployment of the IXCHIQ vaccine could prevent thousands of infections and deaths each year.","content":"A new analysis shows that targeting high-risk regions with the IXCHIQ vaccine could dramatically curb the global impact of chikungunya, offering hope against this rapidly spreading mosquito-borne virus.\nStudy: Global burden of chikungunya virus infec... [9487 chars]","url":"https://www.news-medical.net/news/20250611/Chikungunya-vaccine-could-stop-millions-of-infections-worldwide-study-finds.aspx","image":"https://www.news-medical.net/images/news/ImageForNews_812030_17496942337829759.jpg","publishedAt":"2025-06-12T02:12:00Z","source":{"name":"News-Medical","url":"https://www.news-medical.net"}},{"title":"Chinese astronomers recorded details of dying star’s explosion in 1408: study","description":"Modern researchers think they have identified the stellar remnant and are appealing to observatories to take a closer look.","content":"Just after sunset on an October evening in 1408, six years into the reign of the Ming dynasty’s Emperor Yongle, Chinese court astronomers spotted a mysterious new star glowing high in the southern sky, near the heart of the Milky Way.\nAdvertisement\n“... [1278 chars]","url":"https://www.scmp.com/news/china/science/article/3313977/chinese-astronomers-recorded-details-dying-stars-explosion-1408-study","image":"https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2025/06/11/f25f8d1e-8fd3-4180-922d-92a10fa29934_28fd099b.jpg?itok=Dz_j6qk7&v=1749627260","publishedAt":"2025-06-12T02:00:11Z","source":{"name":"South China Morning Post","url":"https://www.scmp.com"}},{"title":"Legendary K-Pop Boy Group Member To Remarry 13 Years After Divorce","description":"Legendary 1st generation K-Pop idol SECHSKIES' Eun Ji Won will finally be remarrying, 13 years after his divorce. Here's all we know.","content":"According to Sports Chosun‘s exclusive report, SECHSKIES‘ Eun Ji Won recently took wedding photos with his partner. The couple is planning to hold a private ceremony within the year, inviting only close family and friends. The wedding is set to take ... [1222 chars]","url":"https://www.koreaboo.com/news/eun-ji-won-remarry/","image":"https://image.koreaboo.com/2025/06/Untitled-design-8-1.jpg","publishedAt":"2025-06-12T01:53:12Z","source":{"name":"Koreaboo","url":"https://www.koreaboo.com"}},{"title":"JoyFront Launches Aero, Open-Ear Wireless Earbuds Designed","description":"Los Angeles, CA, June 11, 2025 (GLOBE NEWSWIRE) -- Audio technology brand JoyFront has announced the launch of Aero, a pair of open-ear true wireless...","content":"Los Angeles, CA, June 11, 2025 (GLOBE NEWSWIRE) -- Audio technology brand JoyFront has announced the launch of Aero, a pair of open-ear true wireless earbuds designed to enhance daily life through a balance of connection and clarity. With a sleek, mi... [5179 chars]","url":"https://www.globenewswire.com/news-release/2025/06/12/3098014/0/en/JoyFront-Launches-Aero-Open-Ear-Wireless-Earbuds-Designed-to-Help-Users-Tune-Out-the-Chaos-and-Tune-in-to-Joy.html","image":"https://www.globenewswire.com/Content/logo/favicon.ico","publishedAt":"2025-06-12T01:53:00Z","source":{"name":"GlobeNewswire","url":"https://www.globenewswire.com"}},{"title":"Romualdez on Independence Day: House to uphold PH democracy","description":"House Speaker Ferdinand Martin Romualdez said the chamber will continue to uphold democracy as the country marks the 127th anniversary of its independence.","content":"MANILA, Philippines — House Speaker Ferdinand Martin Romualdez assured Filipinos that the chamber will continue to uphold democracy and protect citizens’ rights through meaningful legislation, as the country marks the 127th anniversary of its indepen... [3328 chars]","url":"https://newsinfo.inquirer.net/2069984/romualdez-on-independence-day-house-to-uphold-ph-democracy","image":"https://newsinfo.inquirer.net/files/2025/05/romualdez.jpeg","publishedAt":"2025-06-12T01:52:00Z","source":{"name":"Inquirer.net","url":"https://newsinfo.inquirer.net"}},{"title":"Imran Khan: ATC rejects further time for polygraph, photogrammetric tests","description":"LAHORE: An Anti-Terrorism Court (ATC) on Wednesday rejected the police's request for further time to conduct...","content":"LAHORE: An Anti-Terrorism Court (ATC) on Wednesday rejected the police's request for further time to conduct polygraph and photogrammetric tests of PTI former Chairman Imran Khan in May 09 riots cases as he had already refused to undergo the tests tw... [686 chars]","url":"https://www.brecorder.com/news/40367300/imran-khan-atc-rejects-further-time-for-polygraph-photogrammetric-tests","image":"https://i.brecorder.com/large/2025/06/684a324d5cb1c.jpg","publishedAt":"2025-06-12T01:51:15Z","source":{"name":"Business Recorder","url":"https://www.brecorder.com"}},{"title":"Chocolate Visa Card nerf: What now?","description":"Reduced earn rates, a cap on bill payments and a new Miles Multiplier: \"Dark Chocolate\" is coming on 1 July 2025.","content":"Earlier this month, Chocolate announced several negative changes to the Chocolate Visa Card, including reduced earn rates, a cap on miles for bill payments, and a new Miles Multiplier feature which awards bonus miles based on your Chocolate account b... [1570 chars]","url":"https://milelion.com/2025/06/12/chocolate-visa-card-nerf-what-now/","image":"https://milelion.com/wp-content/uploads/2025/02/chocolate-card-hero.jpg","publishedAt":"2025-06-12T01:50:56Z","source":{"name":"The MileLion","url":"https://milelion.com"}},{"title":"First Tick: Here are the top global cues for today’s trade","description":"The dollar weakened against all group of 10 peers after President Donald Trump said he plan to send letters to the the trading partners in next one or two weeks setting unilateral tariff rates ahead of a July 9 deadline.","content":"Domestic benchmark indices failed to hold on to early gains and ended flat in a volatile session on June 10\nIndian benchmark indices Sensex and Nifty 50 are likely to see a muted start on June 12, tracking cues from GIFT Nifty trading around 25,187 a... [3081 chars]","url":"https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-112-13110183.html","image":"https://images.moneycontrol.com/static-mcnews/2025/06/20250611073910_sensex_nifty1.jpg","publishedAt":"2025-06-12T01:37:37Z","source":{"name":"Moneycontrol","url":"https://www.moneycontrol.com"}}]}