{"totalArticles":7071156,"articles":[{"title":"Broad-Spectrum Antiviral Drug Developed With AI Tools","description":"New broad-spectrum antiviral drug could stop future pandemics. Learn how AI, molecular modeling and novel chemistry are transforming antiviral treatments.","content":"Read time: 5 minutes\nAbout 30% of all respiratory tract infections are caused by coronaviruses, leading to widespread illnesses and, in some cases, to epidemic and even pandemic outbreaks, as we experienced with the COVID-19 pandemic. Despite the dev... [9856 chars]","url":"https://www.technologynetworks.com/tn/news/ai-model-helps-develop-a-broad-spectrum-coronavirus-drug-400992","image":"https://assets.technologynetworks.com/production/dynamic/images/content/400992/ai-model-helps-develop-a-broad-spectrum-coronavirus-drug-400992-640x360.jpg?cb=20250613","publishedAt":"2025-06-13T08:26:30Z","source":{"name":"Technology Networks","url":"https://www.technologynetworks.com"}},{"title":"Caraga Region sees steady drop in dengue cases","description":"BUTUAN CITY – The Department of Health (DOH) in the Caraga Region (DOH-13) has noted a steady decrease in the number of dengue cases within the area. Data obtained by the Philippine News Agency on Friday indicated that the decline was observed during the periods of April 27-May 10, May 11-May…","content":"(PNA file photo)\nBUTUAN CITY – The Department of Health (DOH) in the Caraga Region (DOH-13) has noted a steady decrease in the number of dengue cases within the area.\nData obtained by the Philippine News Agency on Friday indicated that the decline wa... [1703 chars]","url":"https://www.pna.gov.ph/articles/1252095","image":"https://files01.pna.gov.ph/ograph/2020/06/17/aedes-aegypti.jpg","publishedAt":"2025-06-13T08:23:32Z","source":{"name":"Philippine News Agency","url":"https://www.pna.gov.ph"}},{"title":"Dev Proxy v0.28 Introduces Telemetry for LLM Usage and Cost Analysis","description":"The .NET team has released Dev Proxy version 0.28, introducing new capabilities aimed at improving observability, plugin extensibility, and integration with AI models. A central feature of this releas","content":"The .NET team has released Dev Proxy version 0.28, introducing new capabilities to improve observability, plugin extensibility, and integration with AI models. A central feature of this release is the OpenAITelemetryPlugin, which, as reported, allows... [3618 chars]","url":"https://www.infoq.com/news/2025/06/microsoft-dev-proxy-v28/","image":"https://res.infoq.com/news/2025/06/microsoft-dev-proxy-v28/en/headerimage/twitter_card+%2852%29-1749752211988.jpg","publishedAt":"2025-06-13T08:16:33Z","source":{"name":"infoq.com","url":"https://www.infoq.com"}},{"title":"DOTr, DICT secretaries to speak at EJAP Infrastructure Forum","description":"The Economic Journalists Association of the Philippines (EJAP), the country’s premier organization of business journalists, announced it will hold its annual...","content":"The Economic Journalists Association of the Philippines (EJAP), the country’s premier organization of business journalists, announced it will hold its annual Infrastructure Forum on Monday, June 16, at the Fairmont Hotel in Makati City.\nThe forum, th... [1858 chars]","url":"https://mb.com.ph/2025/06/13/dotr-dict-secretaries-to-speak-at-ejap-infrastructure-forum","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/13/19151.webp","publishedAt":"2025-06-13T08:15:26Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Sunjay Kapur cause of death: Did swallowing a bee lead to Karisma Kapoor's ex-husband's demise? Here's what we know","description":"Sunjay Kapur died after a heart attack on Thursday in London. The industrialist was married to actor Karisma Kapoor from 2003-16. | Bollywood","content":"Industrialist Sunjay Kapur, the ex-husband of actor Karisma Kapoor and Indian automotive industry leader, died in London on Thursday. He was 53. Initial reports claimed that Sunjay succumbed to a heart attack that he suffered while taking part in a p... [1878 chars]","url":"https://www.hindustantimes.com/entertainment/bollywood/sunjay-kapur-cause-of-death-did-swallowing-a-bee-lead-to-karisma-kapoors-ex-husbands-demise-heres-what-we-know-101749800842923.html","image":"https://www.hindustantimes.com/ht-img/img/2025/06/13/1600x900/Sunjay_Kapur_1749801039481_1749801043741.webp","publishedAt":"2025-06-13T08:04:20Z","source":{"name":"Hindustan Times","url":"https://www.hindustantimes.com"}},{"title":"Get all MLC scores, points table, standings and net run rate","description":"Know all Major League Cricket 2025 match results, scores and standings of each team in the MLC points table, including net run rate (NRR).","content":"The Major League Cricket 2025 is currently underway with six teams scheduled to play 34 matches to decide the latest champions in the United States of America’s top-tier domestic T20 competition.\nWashington Freedom are the defending champions going i... [272 chars]","url":"https://www.olympics.com/en/news/major-league-cricket-mlc-2025-results-scores-standing-points-table-net-run-rate","image":"https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/frj6ok3gmklq8rc2a5ql","publishedAt":"2025-06-13T07:57:00Z","source":{"name":"Olympics.com","url":"https://www.olympics.com"}},{"title":"Worm slime could inspire recyclable polymer design","description":"Previously unknown protein-based feature in slime allows it to transform from liquid to fibre and back again","content":"Slime time: A velvet worm producing slime. (Courtesy: Poulhazan A et al. 2023, Journal of the American Chemical Society, https://doi.org/10.1021/jacs.3c06798\nThe animal world – including some of its ickiest parts – never ceases to amaze. According to... [3933 chars]","url":"https://physicsworld.com/a/worm-slime-could-inspire-recyclable-polymer-design/","image":"https://physicsworld.com/wp-content/uploads/2025/06/barbadensis.jpg","publishedAt":"2025-06-13T07:56:09Z","source":{"name":"Physics World","url":"https://physicsworld.com"}},{"title":"Iran launches 100 drones at Israel in response to missile attack","description":"Israel's overnight missile strike was the largest attack on the Islamic Republic since the Iran-Iraq war of the 1980s.","content":"Traffic flows on a highway in the Iranian capital Tehran on June 13, 2025 following reported Israeli strikes targeting Iran early in the morning.\nDUBAI, United Arab Emirates — Iran launched more than 100 drones toward Israeli territory Friday morning... [2085 chars]","url":"https://www.cnbc.com/2025/06/13/iran-launches-100-drones-at-israel-in-response-to-missile-attack.html","image":"https://image.cnbcfm.com/api/v1/image/108158842-1749780505292-gettyimages-2219193014-AFP_62788T2.jpeg?v=1749797953&w=1920&h=1080","publishedAt":"2025-06-13T07:38:41Z","source":{"name":"CNBC","url":"https://www.cnbc.com"}},{"title":"Senate denies 'killing' wage hike bill, laments House delay","description":"MANILA – Senate President Francis “Chiz” Escudero and key senators on Friday pushed back against criticism that the upper chamber \"killed\" the wage hike bill, saying that the House of Representatives had over a year to act on it but waited until the final days of the session. “This is a…","content":"The Philippine Senate building (PNA file photo by Avito Dalan)\nMANILA – Senate President Francis “Chiz” Escudero and key senators on Friday pushed back against criticism that the upper chamber \"killed\" the wage hike bill, saying that the House of Rep... [2963 chars]","url":"https://www.pna.gov.ph/articles/1252093","image":"https://files01.pna.gov.ph/ograph/2023/04/21/senate-5.jpg","publishedAt":"2025-06-13T07:38:13Z","source":{"name":"Philippine News Agency","url":"https://www.pna.gov.ph"}},{"title":"Father’s Day 2025: Is your daddy the strongest? Men's health tips for them to stay strong, sharp, energised","description":"Father’s Day is the perfect time to reflect on your dad’s health. From boosting energy to improving brain focus and muscle strength, what he eats matters. With expert tips from dietician, here’s how men can eat smart and feel stronger every day.","content":"A strong, healthy dad is the best gift. This Father’s Day, let food and habits shape a sharper mind and stronger body, for him and those who look up to him (Image: Canva)\nMany dads quietly carry the weight of work, responsibilities, and expectations,... [2645 chars]","url":"https://www.moneycontrol.com/health-and-fitness/father-s-day-2025-is-your-daddy-the-strongest-men-s-health-tips-for-them-to-stay-strong-sharp-energised-article-13117047.html","image":"https://images.moneycontrol.com/static-mcnews/2024/09/20240923070027_1.jpg","publishedAt":"2025-06-13T07:33:12Z","source":{"name":"Moneycontrol","url":"https://www.moneycontrol.com"}}]}