{"totalArticles":6672908,"articles":[{"title":"На смартгодинниках Garmin зʼявився додаток Google Maps","description":"Новий офіційний додаток передає покрокові інструкції по маршруту, прокладеному через смартфон на Android і підтримує понад 90 моделей годинників Garmin.","content":"Автор новин Mezha.Media та гік. Пишу про технології, кіно та ігри. Можливо, про ігри з трохи більшою пристрастю.\nGarmin оголосила про появу офіційного додатка Google Maps для своєї лінійки розумних годинників. Додаток зможе відображати інструкції з н... [856 chars]","url":"https://mezha.media/news/garmin-google-maps-303230/","image":"https://img.mezha.media/mezhaprod/images/doc/b/0/270559/b0a661eab1cf0a0d89fbe5db2731d902.jpeg","publishedAt":"2025-07-09T08:34:00Z","source":{"name":"Mezha.Media","url":"https://mezha.media"}},{"title":"Google дозволив Gemini отримувати доступ до WhatsApp, SMS і дзвінків на Android: користувачам варто перевірити налаштування","description":"Власники Android-смартфонів, які встановили додаток Gemini, можуть не знати, що їхній помічник відтепер має доступ до особистих повідомлень, дзвінків і службових даних. Щоб цього уникнути, потрібно вручну змінити налаштування або повністю видалити застосунок.","content":"Власники Android-смартфонів, які встановили додаток Gemini, можуть не знати, що їхній помічник відтепер має доступ до особистих повідомлень, дзвінків і службових даних. Щоб цього уникнути, потрібно вручну змінити налаштування або повністю видалити за... [2443 chars]","url":"https://dev.ua/news/google-dozvolyv-gemini-otrymuvaty-dostup-do-whatsapp-sms-i-dzvinkiv-na-android-korystuvacham-varto-pereviryty-nalashtuvannia-1752049526","image":"https://dev.ua/storage/images/16/90/37/10/derived/2b6896359d6b0f3170bd40ca58249693.jpg","publishedAt":"2025-07-09T08:32:00Z","source":{"name":"dev.ua","url":"https://dev.ua"}},{"title":"У The Last of Us 2 з'явився новий режим гри з проходженням у хронологічному порядку","description":"Через п'ять років після релізу The Last of Us Part II отримала оновлення, що дає змогу пройти сюжет гри в хронологічному порядку. Апдейт доступний безкоштовно.","content":"Такий спосіб проходження має показати історію Еллі та Еббі з іншого боку.\nЧерез п'ять років після релізу The Last of Us Part II отримала оновлення, що дає змогу пройти сюжет гри в хронологічному порядку. Апдейт доступний безкоштовно для всіх власникі... [1296 chars]","url":"https://www.unian.ua/games/u-the-last-of-us-2-z-yavitsya-noviy-rezhim-gri-z-prohodzhennyam-u-hronologichnomu-poryadku-13061976.html","image":"https://images.unian.net/photos/2025_07/thumb_files/1000_545_1752048127-8516.jpg?1","publishedAt":"2025-07-09T08:15:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Зйомки фільму Крашанка - коли прем'єра - що відомо про продовження - Кіно","description":"В Україні стартували зйомки другої частини фільму Крашанка, який полюбився українцям. Дізнайтесь, що відомо про сюжет та коли прем'єра стрічка, на Кіно 24.","content":"Як Мишко будував \"торгівельні\" стосунки з усіма членами родини? І як ми сміялися й ковтали сльози в залі, бо впізнавали себе в цих діалогах, вчинках, сварках, обіймах? А що з ними тепер? Відповідь – у \"Крашанці 2.0\". У матеріалі Кіно 24 розповідаємо ... [2972 chars]","url":"https://kino.24tv.ua/zyomki-filmu-krashanka-koli-premyera-shho-vidomo-pro-prodovzhennya_n2866128","image":"https://kino.24tv.ua/resources/photos/news/202507/2866128.jpg?v=1752043253000&w=1200&h=675","publishedAt":"2025-07-09T07:36:41Z","source":{"name":"24 Канал","url":"https://kino.24tv.ua"}},{"title":"CNN: Трамп розповів, що погрожував Путіну \"розбомбити Москву\" в разі вторгнення в Україну","description":"Журналісти CNN отримали аудіозапис однієї з приватних зустрічей Дональда Трампа з донорами його кампанії, що відбулася торік. На записі Трамп стверджує, що під час своєї першої каденції пригрозив лідерам Росії та Китаю наслідками у разі можливих атак на Україну й Тайвань.","content":"Журналісти CNN отримали аудіозапис однієї з приватних зустрічей Дональда Трампа з донорами його кампанії, що відбулася торік. На записі Трамп стверджує, що під час своєї першої каденції пригрозив лідерам Росії та Китаю наслідками у разі можливих атак... [1149 chars]","url":"https://www.pravda.com.ua/news/2025/07/9/7520875/","image":"https://img.pravda.com/images/doc/7/5/7520875_fb_image_ukr_2025_07_09_11_27_44.jpg","publishedAt":"2025-07-09T07:27:05Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Помер український композитор Ігор Поклад","description":"Ігор Поклад помер на 84-му році життя у своєму будинку у Ворзелі, що на Київщині","content":"На 84-тому році життя помер український композитор Ігор Поклад. Про це у Facebook написала його дружина Світлана:\n\"От і все…… Любила, люблю і любитиму завжди…. Помоліться за Ігоря Дмитровича, будь ласка…За його безсмертну душу…\".\nІгор Поклад – україн... [1069 chars]","url":"https://life.pravda.com.ua/culture/pomer-ukrajinskiy-kompozitor-igor-poklad-309104/","image":"https://imglife.pravda.com.ua/life/images/doc/4/e/100914/4e3ad5b7bf9cf7b56a5f708c4172b3d0.jpeg?w=1920&q=90","publishedAt":"2025-07-09T07:16:00Z","source":{"name":"УП. Життя","url":"https://life.pravda.com.ua"}},{"title":"Київщина зазнала однієї з наймасованіших атак - в ОВА розповіли про наслідки","description":"Як повідомили в обласній військовій адміністрації, тривога у регіоні тривала понад сім...","content":"Київщина зазнала однієї з наймасованіших атак — в ОВА розповіли про наслідки\nУ ніч на середу, 9 липня, Київщина зазнала однієї з наймасованіших повітряних атак російських військ.\nЯк повідомили в обласній військовій адміністрації, тривога у регіоні тр... [755 chars]","url":"https://armyinform.com.ua/2025/07/09/kyyivshhyna-zaznala-odniyeyi-z-najmasovanishyh-atak-v-ova-rozpovily-pro-naslidky/","image":"https://armyinform.com.ua/wp-content/uploads/2025/07/photo_2025-07-09_09-24-00-2-e1752043478930-960x540.jpg","publishedAt":"2025-07-09T06:45:00Z","source":{"name":"АрміяInform – Інформаційне агентство АрміяInform","url":"https://armyinform.com.ua"}},{"title":"На Київщині після нічної атаки масштабно горить промислове підприємство","description":"Внаслідок російської атаки у Київській області спалахнула масштабна пожежа на території промислового підприємства – вогонь охопив 8000 кв. м.","content":"Внаслідок російської атаки у Київській області спалахнула масштабна пожежа на території промислового підприємства – вогонь охопив 8000 кв. м.\nДжерело: ДСНС України в Facebook, речник ГУ ДСНС у Київській області Вікторія Рубан у коментарі \"Українській... [525 chars]","url":"https://www.pravda.com.ua/news/2025/07/9/7520867/","image":"https://img.pravda.com/images/doc/7/5/7520867_fb_image_ukr_2025_07_09_10_26_45.jpg","publishedAt":"2025-07-09T06:44:58Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Лідер Динамо підтвердив роман з відомою блогеркою і привітав її зі святом","description":"Володимир Бражко розсекретив особисте життя, опублікувавши спільне фото з Дар єю Квітковою.","content":"9 липня 2025, 09:42\nВолодимир Бражко розсекретив особисте життя, опублікувавши спільне фото з Дар'єю Квітковою.\nКапітан Динамо Володимир Бражко підтвердив чутки про свій особистий статус.\nВ інтернеті вже давно поширювалися непідтверджені чутки, що пі... [737 chars]","url":"https://ua.korrespondent.net/sport/football/4797183-lider-dynamo-pidtverdyv-roman-z-vidomoui-bloherkoui-i-pryvitav-yii-zi-sviatom","image":"https://kor.ill.in.ua/m/1260x900/4334785.jpg","publishedAt":"2025-07-09T06:42:00Z","source":{"name":"Korrespondent.net","url":"https://ua.korrespondent.net"}},{"title":"Microsoft розробляє відразу кілька ігор за Fallout","description":"Microsoft готує відразу кілька проєктів за Fallout. Про це розповів журналіст VGC Джордан Міддлер. За його словами, на один із проєктів фанати дуже чекають.","content":"У мережі припускають, що це або ремастер Fallout 3, або щось пов'язане з New Vegas.\nMicrosoft готує одразу кілька проєктів за Fallout. Про це розповів журналіст VGC Джордан Міддлер у подкасті Friends Per Second.\nЗа його словами, у розробці перебувают... [1013 chars]","url":"https://www.unian.ua/games/microsoft-rozroblyaye-vidrazu-kilka-igor-za-fallout-13061844.html","image":"https://images.unian.net/photos/2025_07/thumb_files/1000_545_1752041813-2504.jpg?1","publishedAt":"2025-07-09T06:24:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}}]}