{"totalArticles":7041980,"articles":[{"title":"Liver health: Why that glass of fruit juice might be your worst enemy","description":"While fruit juices are often seen as healthy due to their vitamins and antioxidants, excessive consumption can harm the liver. High fructose levels in","content":"The liver's role and the impact of excessive sugar\nWhat does research say?\nFruit Juices: a concentrated source of sugar\nThe link between fruit juice and liver disease\nThe role of artificial sweeteners\nIs that no fruit juice, safe enough for the liver... [4451 chars]","url":"https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/liver-health-why-that-glass-of-fruit-juice-might-be-your-worst-enemy/articleshow/121859482.cms","image":"https://static.toiimg.com/thumb/msid-121859472,width-1070,height-580,imgsize-31696,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2025-06-15T05:53:00Z","source":{"name":"Times of India","url":"https://timesofindia.indiatimes.com"}},{"title":"Bacolod police chief seeks stronger surveillance vs crime","description":"Bacolod City police chief Police Col. Joeresty Coronica has urged the city council to amend ordinances on closed-circuit television camera use, emphasizing the...","content":"Bacolod City police chief Police Col. Joeresty Coronica has urged the city council to amend ordinances on closed-circuit television camera use, emphasizing the need for stronger surveillance systems to deter crime and support law enforcement efforts.... [3418 chars]","url":"https://mb.com.ph/2025/06/15/bacolod-police-chief-seeks-stronger-surveillance-vs-crime","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/15/19517.webp","publishedAt":"2025-06-15T05:35:31Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Eight killed in Iranian strikes on Israel as Trump threatens Tehran with ‘full strength’ of military if it attacks US - live updates","description":"At least 35 missing after strike hits town south of Tel Aviv; US president also claims ‘we can easily get a deal done’ to end conflict","content":"23.59 EDT Opening summary\nHello and welcome to the Guardian’s live coverage of the Middle East.\nIsrael and Iran exchanged another round of strikes late on Saturday and into Sunday, with at least eight people killed in Israel when Iranian missiles pen... [1349 chars]","url":"https://www.theguardian.com/world/live/2025/jun/15/at-least-eight-killed-in-iranian-strikes-on-israel-while-israeli-attacks-set-tehran-oil-depot-on-fire-live-updates","image":"https://i.guim.co.uk/img/media/35d93d5f51725ff0432f83d38a375493aac78350/0_0_4680_3744/master/4680.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=1d7022f2649efac757df730818cc166d","publishedAt":"2025-06-15T05:23:00Z","source":{"name":"The Guardian","url":"https://www.theguardian.com"}},{"title":"Pakistan says FATF ignored India’s attempts to place Islamabad on ‘grey list’","description":"ISLAMABAD: The Financial Action Task Force (FATF) has ignored India’s attempts to have Islamabad placed on the anti-money laundering watchdog’s “grey list,” Pakistani state media reported this week as tensions simmer between the nuclear-armed neighbors. Various media outlets had reported that India was likely to push the FATF, a global financial crime watchdog, to add Pakistan","content":"In ancient Taxila, artisan preserves dying craft: molding beauty from plaster of Paris\nTAXILA, Pakistan: The scent of turpentine and chalky plaster filled the modest workshop in Dheri Shah, a neighborhood tucked away in the ancient city of Taxila, wh... [5909 chars]","url":"https://www.arabnews.com/node/2604530/pakistan","image":"https://www.arabnews.com/sites/default/files/styles/660x371_watermarksaudi/public/main-image/2025/06/15/4611839-1946771095.jpg?itok=FGUKbH4d","publishedAt":"2025-06-15T05:09:29Z","source":{"name":"Arab News","url":"https://www.arabnews.com"}},{"title":"Yemen’s Houthis target Israel with ballistic missiles in coordination with Iran","description":"CAIRO: Yemen’s Iran-aligned Houthis said on Sunday that they targeted central Israel’s Jaffa with several ballistic missiles in the last 24 hours in coordination with Iran, as Israel and Iran continued to exchange missile attacks. The group has been launching attacks against Israel, most of which have been intercepted, in what they say is support for Palestinians in Gaza","content":"Latest: Israel and Iran strike at each other in new wave of attacks\nTEL AVIV/DUBAI: Israel and Iran launched fresh attacks on each other overnight into Sunday, stoking fears of a wider conflict after Israel expanded its surprise campaign against its ... [14770 chars]","url":"https://www.arabnews.com/node/2604528/middle-east","image":"https://www.arabnews.com/sites/default/files/styles/660x371_watermarksaudi/public/main-image/2025/06/15/4611837-902844552.jpg?itok=i1tXsO7M","publishedAt":"2025-06-15T05:04:50Z","source":{"name":"Arab News","url":"https://www.arabnews.com"}},{"title":"Illegal use of blinker leads to arrest of 2 men in extortion racket using First Lady's name","description":"More than a year after his arrest for name-dropping First Lady Liza Louise Araneta-Marcos in his group’s extortion racket, operatives of the Highway Patrol...","content":"Illegal use of blinker leads to arrest of 2 men in extortion racket using First Lady's name\nPNP-HPG director Brig. Gen. Eleazar Matta discusses the details on how the two suspects were arrested during a press briefing at Camp Crame in Quezon City on ... [3202 chars]","url":"https://mb.com.ph/2025/06/15/illegal-use-of-blinker-leads-to-arrest-of-2-men-in-extortion-racket-using-first-ladys-name","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/15/19514.webp","publishedAt":"2025-06-15T05:04:22Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Galway researchers capture a far-off giant planet being formed","description":"Galway researchers capture a far-off giant planet being formed","content":"An international team of astronomers led by University of Galway, has discovered the likely site of a new planet in formation, most likely a gas giant planet a few times the mass of Jupiter.\nUsing the European Southern Observatory’s Very Large Telesc... [2568 chars]","url":"https://connachttribune.ie/galway-researchers-capture-a-far-off-giant-planet-being-formed/","image":"https://connachttribune.ie/wp-content/uploads/2025/06/New-planet-cropped.jpg","publishedAt":"2025-06-15T05:00:48Z","source":{"name":"Connacht Tribune","url":"https://connachttribune.ie"}},{"title":"Seven-year-old Laois girl Ellie Culleton growing her hair and raising much-needed funds for three wonderful charities","description":"Seven-year-old Ellie Culleton from Mountmellick has been growing her hair for three charities and will have it cut next weekend.","content":"A young Laois girl has been growing her hair for three charities as she prepare to have it cut next weekend.\nSeven-year-old Ellie Culleton from Mountmellick is a Senior Infants student at Derrylamogue National School.\nAll funds raised will be shared ... [1158 chars]","url":"https://www.laoistoday.ie/2025/06/15/seven-year-old-laois-girl-ellie-culleton-growing-her-hair-and-raising-much-needed-funds-for-three-wonderful-charities/","image":"https://www.laoistoday.ie/wp-content/uploads/2025/06/Ellie-Culleton.jpg","publishedAt":"2025-06-15T05:00:45Z","source":{"name":"Laois Today","url":"https://www.laoistoday.ie"}},{"title":"Why giant planets might form faster than we thought","description":"Astronomers using ALMA have uncovered how gas and dust in planet-forming disks evolve separately an insight that reshapes our understanding of how different types of planets form. While dust lingers, gas dissipates quickly, narrowing the window for the formation of gas giants like Jupiter.","content":"An international team of astronomers including researchers at the University of Arizona Lunar and Planetary Laboratory has unveiled groundbreaking findings about the disks of gas and dust surrounding nearby young stars, using the powerful Atacama Lar... [5328 chars]","url":"http://www.sciencedaily.com/releases/2025/06/250614034242.htm","image":"https://www.sciencedaily.com/images/1920/ALMA-AGE-PRO-Survey-Planet-Forming-Disk.webp","publishedAt":"2025-06-15T04:55:05Z","source":{"name":"ScienceDaily","url":"http://www.sciencedaily.com"}},{"title":"Northern Health warns of measles spread","description":"Cases have been confirmed in Wonowon and Fort St. John","content":"Northern Health has confirmed several lab-verified cases of measles in Northeast B.C., including in the community of Wonowon, located approximately 89 kilometres northwest of Fort St. John.\nHealth officials say the initial case appears to have been a... [1829 chars]","url":"https://www.princegeorgecitizen.com/latest/northern-health-warns-of-measles-spread-10812416","image":"https://www.vmcdn.ca/f/files/princegeorgematters/pgc-images/health/measles.jpg;w=640;h=480;mode=crop","publishedAt":"2025-06-15T04:47:34Z","source":{"name":"Prince George Citizen","url":"https://www.princegeorgecitizen.com"}}]}