{"totalArticles":6739210,"articles":[{"title":"Інсайдер розкрив європейські ціни на смартфони лінійки Google Pixel 10","description":"В мережу потрапила інформація про ймовірну вартість смартфонів серії Pixel 10 у єврозоні. Ціна найдешевшої моделі €899, а найдорожчої – €2 289. Окрім цього, стала відома ціна нових навушників Pixel Buds 2a – €149.","content":"Цікавлюся різного роду електронікою і технологіями з 2004 року. Люблю грати в комп'ютерні ігри, а також розуміюся на роботі різних гаджетів. Регулярно стежу за новинами світу технологій і сам пишу матеріали про це.\nGoogle планує представити серію сма... [1438 chars]","url":"https://mezha.media/news/rozkriti-yevropeyski-cini-na-seriyu-pixel-10-303314/","image":"https://img.mezha.media/mezhaprod/images/doc/9/7/270811/973fbce5a4bc2be4c6b21b39156b21ed.jpeg","publishedAt":"2025-07-12T07:00:00Z","source":{"name":"Mezha.Media","url":"https://mezha.media"}},{"title":"Атака на Луцьк і Львів: рятувальники показали фото наслідків","description":"Удар по Львову і Луцьку: фото наслідків атаки, читайте ᐅ TSN.ua (новини 1+1)","content":"Удар по Львову / © ДСНС\nРеклама\nЦієї ночі російські окупанти завдали чергового масованого удару по Україні. Зокрема, атаку пережили Львів і Луцьк.\nУ ДСНС опублікували фото наслідків атаки.\nЛьвів\n© ДСНС © ДСНС © ДСНС © ДСНС © ДСНС © ДСНС © ДСНС\nУ Льво... [398 chars]","url":"https://tsn.ua/ukrayina/ataka-na-lutsk-i-lviv-riatuvalnyky-pokazaly-foto-naslidkiv-2868410.html","image":"https://img.tsn.ua/cached/546/tsn-0b4bc102/thumbs/1200x630/d5/af/f55a47a9b6f3779e358cd9c5d383afd5.jpg","publishedAt":"2025-07-12T05:58:40Z","source":{"name":"tsn.ua","url":"https://tsn.ua"}},{"title":"Duster на максималках: новий кросовер Renault показали в подробицях","description":"Новий кросовер Renault Boreal являє собою максимальну варіацію бюджетника Renault Duster в усіх відношеннях: новинка більша, практичніша і просто крутіша. Автомобіль показали в подробицях на офіційних фото. Renault OBOZ.","content":"Новий кросовер Renault Boreal являє собою максимальну варіацію бюджетника Renault Duster в усіх відношеннях: новинка більша, практичніша і просто крутіша. Автомобіль показали в подробицях на офіційних фото.\nВідео дня\nOBOZ.UA нагадує, що великий бюдже... [916 chars]","url":"https://www.obozrevatel.com/ukr/avto-oboz/duster-na-maksimalkah-novij-krosover-renault-pokazali-v-podrobitsyah.htm","image":"https://i.obozrevatel.com/news/2025/7/12/renault-boreal.jpg?size=1200x630","publishedAt":"2025-07-12T05:42:00Z","source":{"name":"Obozrevatel","url":"https://www.obozrevatel.com"}},{"title":"Курс біткоїна зростає - чи інвестують в крипту великі банки","description":"Інвестиційні банки та фінансові компанії із високою репутацією не інвестують у криптовалюти як довгостроковий актив, а лише з метою спекулятивної торг...","content":"Інвестиційні банки та фінансові компанії із високою репутацією не інвестують у криптовалюти як довгостроковий актив, а лише з метою спекулятивної торгівлі.\nЧому Bitcoin не підходить на роль довгострокового інвестиційного активу – у матеріалі РБК-Укра... [2663 chars]","url":"https://www.rbc.ua/rus/news/bitkoyin-b-e-rekordi-chi-gotovi-veliki-banki-1752265274.html","image":"https://www.rbc.ua/static/img/i/m/imgonline_com_ua_resize_v48wd2bdsuw3cz_da2edb7b5de48c1ebf85b13827755f35_1300x820.jpg","publishedAt":"2025-07-12T05:30:00Z","source":{"name":"РБК-Україна","url":"https://www.rbc.ua"}},{"title":"Удар по Чернівцях: пошкоджені будинки та авто, є загиблі та понад 10 поранених","description":"Війська РФ сьогодні вночі, 12 липня, атакували Чернівці та область крилатими ракетами та дронами-камікадзе. Пошкоджені будинки та авто, повідомляється...","content":"Війська РФ сьогодні вночі, 12 липня, атакували Чернівці та область крилатими ракетами та дронами-камікадзе. Пошкоджені будинки та авто, повідомляється про загиблих та поранених.\nПро це повідомляє РБК-Україна з посиланням на Telegram голови Чернівецьк... [814 chars]","url":"https://www.rbc.ua/rus/news/udar-chernivtsyah-poshkodzheni-budinki-ta-1752297843.html","image":"https://www.rbc.ua/static/img/_/p/_pozhezha_vogon___facebook_com_dsnskyiv__b7b133f6e0b5817b71614eb72f4d662a_1300x820.jpg","publishedAt":"2025-07-12T05:24:03Z","source":{"name":"РБК-Україна","url":"https://www.rbc.ua"}},{"title":"Гороскоп на сьогодні за картами Таро для знаків Зодіаку","description":"Езотерики склали свої передбачення на 12 липня 2025 року за картами Таро. Зокрема, вони прогнозують Левам - позитивні емоції, а Рибам - завершення справ","content":"Цей день буде активним для деяких знаків.\nУ суботу карти радять контролювати власні емоції та не приймати швидко рішення. Також варто відпочити та прислухатися до свої бажань.\nдовідка Що варто пам'ятати про цей матеріал Астрологія, тарологія, нумерол... [3044 chars]","url":"https://www.unian.ua/lite/astrology/goroskop-na-zavtra-za-kartami-taro-dlya-vsih-znakiv-13064151.html","image":"https://images.unian.net/photos/2025_06/thumb_files/620_324_1751293254-7686.jpg?1","publishedAt":"2025-07-12T05:20:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Вибух у Сонячній системі, який буває лише раз на кілька тисячоліть, зафіксувала волонтерка NASA (Фото)","description":"Волонтерка NASA зафіксувала зіткнення космічного тіла із Сатурном. Унікальний випадок, що буває раз на тисячоліття. Дізнайтеся більше про подію","content":"У Сонячній системі зафіксовано епічний вибух. Невідомий космічний об’єкт зіткнувся із Сатурном. Він міг мати як природне, так і штучне походження. Момент зіткнення майже випадково зафіксувала на камеру одна з волонтерок NASA.\nПро це йдеться у повідом... [2411 chars]","url":"https://today.ua/480336-gigantskij-asteroyid-chi-mizhzoryanij-korabel-pribulciv-astronomi-zafiksuvali-epichnij-vibuh-u-sonyachnij-sistemi-foto/","image":"https://today.ua/storage/images/media/jul2025/5063-saturn-crop-1200-650.webp","publishedAt":"2025-07-12T05:16:00Z","source":{"name":"Today.ua","url":"https://today.ua"}},{"title":"Обстріли Запоріжжя - за добу РФ завдала понад пів тисячі ударів","description":"Росіяни за добу, 11 липня, вдарили по Запорізькій області понад пів тисячі разів: є загиблі та зруйновані будинки.","content":"Зруйнований будинок. Фото: Telegram/Іван Федоров\nРосіяни продовжують обстрілювати Запорізьку область. Лише за минулу добу по 16 населених пунктах регіону завдали 566 ударів.\nПро це повідомив начальник Запорізької ОВА Іван Федоров у суботу, 12 липня.\n... [1016 chars]","url":"https://armiya.novyny.live/rf-zavdala-ponad-500-udariv-po-zaporizhzhiu-za-dobu-ie-zagibli-266907.html","image":"https://novyny.live/cdn-cgi/imagedelivery/4_JwVYxosZqzJ7gIDJgTLA/980b177c-6d14-4007-2994-f9fc6b621200/16x9","publishedAt":"2025-07-12T04:34:00Z","source":{"name":"Новини Live","url":"https://armiya.novyny.live"}},{"title":"Трамп готує зброю для України й \"важливу заяву\" для РФ: подробиці","description":"Росія і США обмінюються «маленькими і великими сюрпризами». Чого очікувати Україні?","content":"Упродовж тижня Дональд Трамп висловлював публічне невдоволення очільником Росії Володимиром Путіним через відсутність прогресу в наближенні до заверешення війни Росії проти України.\nНатомість розмова лідера США з українським президентом здалася Волод... [7248 chars]","url":"https://www.radiosvoboda.org/a/tramp-putin-viyna-zbroya-syurpryz/33471716.html","image":"https://gdb.rferl.org/e120f929-aca1-47b2-8bd3-6cfa4a37732e_w1200_h630.jpg","publishedAt":"2025-07-12T04:00:00Z","source":{"name":"Радіо Свобода","url":"https://www.radiosvoboda.org"}},{"title":"Групу колаборантів, які працювали на росіян під час окупації Херсона, викрили українські правоохоронці","description":"Служба безпеки та Національна поліція затримали у Херсоні ще сімох колаборантів. Під час окупації міста вони допомагали агресору поширювати кремлівський режим","content":"Служба безпеки та Національна поліція затримали у Херсоні ще сімох колаборантів. Під час окупації міста вони допомагали агресору поширювати кремлівський режим на території регіону.\nПро це повідомляє пресслужба СБУ.\nСеред затриманих – батько та син, я... [1966 chars]","url":"https://donpatriot.news/grupu-kolaborantiv-yaki-praczyuvaly-na-rosiyan-pid-chas-okupacziyi-hersona-vykryly-ukrayinski-pravoohoronczi","image":"https://donpatriot.news/wp-content/uploads/2023/11/56182.jpg","publishedAt":"2025-07-12T04:00:00Z","source":{"name":"Патріот Донбасу","url":"https://donpatriot.news"}}]}