{"totalArticles":6898510,"articles":[{"title":"Вєрку Сердючку розкритикували через пісні російською","description":"Вєрка Сердючка 13 червня виступила в Києві, де заспівала російською мовою свої відомі треки. Про те, як артистка прокоментувала цей скандал - дивіться на Show24","content":"Артистка публічно прокоментувала хейт. Повідомляє Show 24 із посиланням на телеграм-канал Новини.LIVE Одеса.\nЦікаво Як виглядала Лорен Санчес – мати трьох дітей, і як жила до знайомства з Безосом: архівні фото\nТак, під час виступу Андрій Данилко емоц... [386 chars]","url":"https://24tv.ua/show24/vyerku-serdyuchku-rozkritikuvali-cherez-pisni-rosiyskoyu-yak_n2858241","image":"https://24tv.ua/resources/photos/news/202506/2858241.jpg?v=1751198016000&w=1200&h=675","publishedAt":"2025-06-29T12:10:16Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"В Угорщині заявили про зняття санкцій США, які заважали росіянам розширити АЕС \"Пакш\"","description":"Міністр закордонних справ Угорщини Петер Сійярто у неділю подякував США за скасування санкцій, що стримували розширення атомної електростанції Пакш, проєкт якої реалізує Росатом.","content":"Міністр закордонних справ Росії Сергій Лавров (ліворуч) слухає міністра закордонних справ Угорщини Петера Сійярто (праворуч) після переговорів у державній резиденції Ново-Огарьово 17 лютого 2016 року в Москві, Росія/Getty Images\nМіністр закордонних с... [1407 chars]","url":"https://www.pravda.com.ua/news/2025/06/29/7519314/","image":"https://img.pravda.com/images/doc/7/5/7519314_fb_image_ukr_2025_06_29_15_23_24.jpg","publishedAt":"2025-06-29T11:49:00Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Ольга Сумська розповіла про нову роботу доньки, яка відмовилася від акторства","description":"Акторка Ольга Сумська розповіла, чим зараз займається її молодша донька Ганна, яка не захотіла стати акторкою - ким вона працює ᐅTSN.ua(новини 1+1)","content":"Ольга Сумська з молодшою донькою\nРеклама\nУкраїнська акторка Ольга Сумська розсекретила, чим займається її молодша донька від Віталія Борисюка після відмови від акторства.\nРаніше 23-річна Ганна Борисюк зізнавалась, що не хоче йти стопами зіркових бать... [1344 chars]","url":"https://tsn.ua/glamur/olha-sumska-rozkryla-chym-zaymayetsia-yiyi-23-richna-donka-pislia-vidmovy-vid-aktorskoyi-karyery-2859509.html","image":"https://img.tsn.ua/cached/602/tsn-7d69491ed57b2e0aebe0922b41d97a86/thumbs/1200x630/ae/03/84c55790802acb8cc9d0fb273f7103ae.jpeg","publishedAt":"2025-06-29T11:00:19Z","source":{"name":"tsn.ua","url":"https://tsn.ua"}},{"title":"Зеленський підписав указ про вихід з конвенції про заборону протипіхотних мін - нардеп","description":"Президент Володимир Зеленський підписав указ, яким увів у дію рішення Ради національної безпеки і оборони України про вихід нашої держави з Оттавської конвенції — міжнародного договору, що забороняє застосування, накопичення та виробництво протипіхотних мін.","content":"Президент Володимир Зеленський підписав указ, яким увів у дію рішення Ради національної безпеки і оборони України про вихід нашої держави з Оттавської конвенції — міжнародного договору, що забороняє застосування, накопичення та виробництво протипіхот... [902 chars]","url":"https://www.pravda.com.ua/news/2025/06/29/7519309/","image":"https://img.pravda.com/images/doc/7/5/7519309_fb_image_ukr_2025_06_29_14_10_02.jpg","publishedAt":"2025-06-29T10:38:05Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Орбан вперше прокоментував рекордний за масштабами ЛГБТ-прайд у Будапешті","description":"Прем’єр-міністр Угорщини у своїх перших коментарях про наймасштабніший в історії Будапешта ЛГБТ-прайд назвав його","content":"Прем’єр-міністр Угорщини у своїх перших коментарях про наймасштабніший в історії Будапешта ЛГБТ-прайд назвав його \"черговим доказом\" того, чому країні потрібен консервативний уряд.\nЯк повідомляє \"Європейська правда\", його слова наводить 444.hu.\nОрбан... [999 chars]","url":"https://www.eurointegration.com.ua/news/2025/06/29/7214831/","image":"https://img.eurointegration.com.ua/images/doc/f/1/f182c1b---------------2025-06-29-132648.jpg","publishedAt":"2025-06-29T10:25:01Z","source":{"name":"Європейська правда","url":"https://www.eurointegration.com.ua"}},{"title":"Обстріл Дрогобича: мешканців закликали зачинити вікна і не виходити з дому","description":"Через масований ракетно-дроновий обстріл у Дрогобичі постраждав промисловий об'єкт. Влада закликає мешканців щільно зачинити вікна й залишатися вдома ᐅ TSN. ua (новини 1+1).","content":"Мешканців просять зачинити вікна / © Pixabay\nРеклама\nПісля нічної атаки дронами та ракетами по Дрогобичу, яка спричинила пожежу на промисловому об’єкті та знеструмлення кількох районів, влада закликає мешканців залишатися вдома, зачинити вікна та две... [1887 chars]","url":"https://tsn.ua/ukrayina/meshkantsiv-drohobycha-zaklykaiut-shchilno-zachynyty-vikna-dveri-y-ne-vykhodyty-na-vulytsiu-shcho-vidomo-2859479.html","image":"https://img.tsn.ua/cached/109/tsn-0b4bc102/thumbs/1200x630/ae/22/f5126cbc13e722d784ae64cc6dfd22ae.jpg","publishedAt":"2025-06-29T10:15:30Z","source":{"name":"tsn.ua","url":"https://tsn.ua"}},{"title":"З чого складаються кільця Сатурна","description":"У Сонячній системі є кілька планет з кільцями, що оперізують, але Сатурн серед них унікальний. Читайте на УНІАН, чому кільця Сатурна не розвалюються.","content":"Розповідаємо, з чого складаються унікальні кільця планети Сатурн.\nПланета Сатурн друга за розміром серед своїх компаньйонів у Сонячній системі, а також може похизуватися ефектними та видатними кільцями.\nКільця Сатурна - з чого складаються і що про ни... [2223 chars]","url":"https://www.unian.ua/science/z-chogo-skladayutsya-kilcya-saturna-cikave-vidkrittya-13051770.html","image":"https://images.unian.net/photos/2025_03/thumb_files/1000_545_1742046804-8424.jpg?1","publishedAt":"2025-06-29T10:15:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Вєрка Сердючка заспівала російською","description":"Співак дав новий концерт в Одесі і вперше прокоментував скандал навколо себе. Зокрема, він прямо зі сцени жартома присвятив свій виступ омбудсмену та переклав деякі пісні","content":"Артист пожартував на цю тему прямо зі сцени.\nАндрій Данилко, який виступає в образі Вєрки Сердючки, вперше відреагував на рішення омбудсмена після скандального виступу в столиці.\nНе секрет, що днями Тарас Кремінь зазначив, що артист не буде покараний... [1003 chars]","url":"https://www.unian.ua/lite/stars/vyerka-serdyuchka-zaspivala-rosiyskoyu-artist-vpershe-vidreaguvav-na-rishennya-ombudsmena-13052286.html","image":"https://images.unian.net/photos/2025_06/thumb_files/620_324_1751189724-6560.jpg?1","publishedAt":"2025-06-29T10:00:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Майстер Шеф - хто переміг у 15 сезоні шоу - що відомо про Ненсі Топко - УНІАН","description":"Стало відомо ім'я переможця 15-го сезону популярного кулінарного шоу Мастер Шеф. Після тривалої дискусії судді визначилися й оголосили...","content":"Головний приз шоу - можливість навчатися в престижній кулінарній школі Le Cordon Bleu в Парижі.\nСтало відомо ім'я переможця 15-го сезону популярного кулінарного шоу \"МастерШеф\".\n\"Настав найважливіший момент сезону! Судді отримали фірмовий конверт, у ... [1566 chars]","url":"https://www.unian.ua/lite/show/mayster-shef-hto-peremig-u-15-sezoni-shou-shcho-vidomo-pro-nensi-topko-13052277.html","image":"https://images.unian.net/photos/2025_06/thumb_files/1000_545_1751189413-9761.jpg?1","publishedAt":"2025-06-29T09:50:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Ремейка першого Resident Evil не буде, але планується ремейк Resident Evil Zero","description":"Capcom не збирається робити ремейк першої частини Resident Evil, як це було з другою і четвертою частиною. Але студія планує оновити Code Veronica і Zero.","content":"У Capcom все ще працюють розробники RE: Zero, які хотіли б повернутися до цієї гри.\nCapcom не збирається робити ремейк першої частини Resident Evil, як це було з другою та четвертою частиною. Але натомість студія планує оновити Code Veronica та Zero.... [1308 chars]","url":"https://www.unian.ua/games/remeyka-pershogo-resident-evil-ne-bude-ale-planuyetsya-remeyk-resident-evil-zero-13052271.html","image":"https://images.unian.net/photos/2025_06/thumb_files/1000_545_1751189182-6192.jpg?1","publishedAt":"2025-06-29T09:48:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}}]}