{"totalArticles":7093320,"articles":[{"title":"iPhone 17 Pro фото","description":"У 2025 році iPhone Pro вперше за 6 років здивують новим дизайном. Apple готує радикальне оновлення дизайну блоку камер - це підтверджують свіжі макети.","content":"Apple вперше за шість років змінить дизайн блоку камер, зробивши його горизонтальним.\nОчікується, що у 2025 році iPhone Pro вперше за шість років здивують новим дизайном. Apple готує радикальне оновлення дизайну блоку камер – це підтверджують свіжі м... [995 chars]","url":"https://www.unian.ua/techno/gadgets/iphone-17-pro-foto-insayderi-pokazali-finalniy-dizayn-proshki-13049520.html","image":"https://images.unian.net/photos/2025_06/thumb_files/1000_545_1750926831-4511.jpg?1","publishedAt":"2025-06-26T09:18:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Кідман привітала чоловіка з 19-ю річницею шлюбу милим фото","description":"Актриса Ніколь Кідман привітала свого чоловіка, співака Кіта Урбана з річницею весілля. Пара одружилася 19 років тому. У святковий день зірка опублікувала милий знімок з обранцем","content":"Австралійська актриса Ніколь Кідман та її чоловік, кантрі-співак і гітарист Кіт Урбан 26 червня святкують 19-ту річницю весілля.\nУ святковий день акторка показала романтичне фото з коханим, на якому вони обіймаються, ймовірно, знаходячись у гримерці ... [453 chars]","url":"https://tabloid.pravda.com.ua/lounge/kidman-privitala-cholovika-z-19-yu-richniceyu-shlyubu-milim-foto-2010648/","image":"https://imgnewtabl.pravda.com.ua/tabloid/images/doc/2/1/212930/2182cb1834f22e4367ed6a725b6838b2.jpeg","publishedAt":"2025-06-26T09:15:00Z","source":{"name":"ТаблоID","url":"https://tabloid.pravda.com.ua"}},{"title":"Джордж та Амаль Клуні відвідали Букінгемський палац - фото, відео","description":"Зіркове подружжя Клуні поспілкувалося з королем Чарльзом ІІІ. Яку сукню для візиту до Букінгемського палацу обрала Амаль","content":"Фото Getty Images\nДо короля Великої Британії Чарльза ІІІ, котрий нещодавно приймав у себе акторок Кейт Вінслет та Меріл Стріп, завітали чергові зіркові гості.\nБукінгемський палац, де 25-го червня відбулося вшанування лауреатів премії The King's Trust... [650 chars]","url":"https://tabloid.pravda.com.ua/lounge/dzhordzh-ta-amal-kluni-vidvidali-bukingemskiy-palac-foto-video-2010647/","image":"https://imgnewtabl.pravda.com.ua/tabloid/images/doc/9/9/212925/99195ff207250e8fe3b86d41a9d02918.jpeg","publishedAt":"2025-06-26T08:45:00Z","source":{"name":"ТаблоID","url":"https://tabloid.pravda.com.ua"}},{"title":"У Орбана оголосили результати пропагандистського \"референдуму\" щодо України в ЄС","description":"В Угорщини оголосили остаточні результати урядового референдуму щодо підтримки вступу України до Євросоюзу та заявили, що проти висловилися 95% тих, хто голосував.","content":"В Угорщини оголосили остаточні результати урядового \"референдуму\" щодо підтримки вступу України до Євросоюзу та заявили, що \"проти\" висловилися 95% тих, хто голосував.\nДжерело: \"Європейська правда\" з посиланням на Telex\nДеталі: В Орбана оголосили, що... [1131 chars]","url":"https://www.pravda.com.ua/news/2025/06/26/7518820/","image":"https://img.pravda.com/images/doc/7/5/7518820_fb_image_ukr_2025_06_26_12_34_22.jpg","publishedAt":"2025-06-26T08:43:06Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Ситуація в Сумській області","description":"Головнокомандувач ЗСУ Сирський повідомив, що просування російських військ у прикордонні Сумщини станом на 26 червня 2025 зупинено, читайте подробиці - 24 Канал","content":"Про це пише 24 Канал з посиланням на Головнокомандувача ЗСУ Олександра Сирського.\nДивіться також Понад пів сотні відбитих штурмів на Покровському напрямку: карта бойових дій на 26 червня\nСитуація на Сумщині\nГоловнокомандувач ЗСУ наголосив, що оборона... [675 chars]","url":"https://24tv.ua/prosuvannya-rosiyskih-viysk-prikordonni-sumshhini-stanom-zaraz_n2855980","image":"https://24tv.ua/resources/photos/news/202506/2855980.jpg?v=1750925895000&w=1200&h=675","publishedAt":"2025-06-26T08:23:30Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Сара Кіперман у пісочному трикотажі попозувала на сходах у пісочному","description":"Молодша донька Брежнєвої у пісочному трикотажі наробила жіночних фото на сходах","content":"Молодша донька співачки Віри Брежнєвої, 15-річна Сара Кіперман наробила теплих сонячних фото.\nУ своєму Instagram дівчина запостила знімки, де попозувала у пісочному костюмі на сходах.\nДо речі, цікаві факти про Сару: вона любить люксові бренди та гово... [461 chars]","url":"https://tabloid.pravda.com.ua/lounge/sara-kiperman-u-pisochnomu-trikotazhi-popozuvala-na-shodah-u-pisochnomu-2010646/","image":"https://imgnewtabl.pravda.com.ua/tabloid/images/doc/2/4/212897/24c63cdeac29a5f39069033fb05f0a3d.jpeg","publishedAt":"2025-06-26T08:20:00Z","source":{"name":"ТаблоID","url":"https://tabloid.pravda.com.ua"}},{"title":"Орбан розповів, чому блокує переговори з Україною про її вступ до ЄС","description":"Віктор Орбан пояснив, чому Угорщина блокує переговори щодо вступу України до ЄС: інтеграція країни у стані війни, на його думку, означає інтеграцію самої війни в ЄС","content":"Прем’єр-міністр Угорщини Віктор Орбан розповів, чому блокує переговори з Україною про її вступ до Європейського Союзу, пояснивши це війною.\n«Проблема – у війні. Якщо ми інтегруємо Україну в Європейський Союз, ми інтегруємо війну. А ми не хочемо бути ... [1988 chars]","url":"https://www.radiosvoboda.org/a/news-orban-ukraina-es/33455363.html","image":"https://gdb.rferl.org/e22449b3-60f3-4ce4-b80f-08dd4a80fec4_cx0_cy10_cw0_w1200_h630.jpg","publishedAt":"2025-06-26T07:59:23Z","source":{"name":"Радіо Свобода","url":"https://www.radiosvoboda.org"}},{"title":"Антисмартфон метафон створили в США","description":"Дизайнери зі США створили антисмартфон. Його основна задача — допомогти боротися із залежністю від екранів.","content":"Американські дизайнери створили акрилову пластину, яка допомагає менше користуватись телефоном, і назвали її на честь метадону.\nПара американських розробників – дизайнер Ерік Антонов та інженер-художник Ґреґ Хохмут створили метафон. Це прозорий скуль... [2692 chars]","url":"https://zn.ua/ukr/TECHNOLOGIES/prozorij-telefon-antismartfon-shcho-likuje-tsifrovu-zalezhnist.html","image":"https://zn.ua/img/article/6447/66_main-v1750918272.webp","publishedAt":"2025-06-26T07:39:00Z","source":{"name":"Дзеркало тижня","url":"https://zn.ua"}},{"title":"Акції Tesla впали після провального запуску роботаксі в Остіні","description":"Після невдалого запуску роботаксі Tesla в Остіні вартість акцій компанії значно знизилася. Відео з проблемними поїздками присутність людських моніторів викликають сумніви.","content":"Реакція ринку\nУ вівторок невдалий старт Robotaxi спровокував падіння акцій Tesla більш ніж на чотири відсотки, що становить майже 15 доларів за один день. Це зниження відбулося після появи в мережі відеороликів, які показують, як безпілотні таксі, що... [3319 chars]","url":"https://24tv.ua/tech/aktsiyi-tesla-vpali-pislya-provalnogo-zapusku-robotaksi-ostini_n2855893","image":"https://24tv.ua/resources/photos/news/202506/2855893.jpg?v=1750921737000&w=1200&h=675","publishedAt":"2025-06-26T07:32:30Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Осадча у стильному костюмі похвалилася тонкою талією - фото","description":"Телеведуча Катерина Осадча знялась у стильному фотосеті, для якого вдягнула діловий костюм, що виділяв струнку талію та довгі ноги. Також зірка підняла тему боротьби з комплексами","content":"Телеведуча Катерина Осадча потішила шанувальників новим стильним контентом і роздумами про навіювання комплексів та про впевненість у собі.\nВ Instagram 41-річна зірка опублікувала добірку фото, на яких позувала у чорному костюмі українського бренду з... [1875 chars]","url":"https://tabloid.pravda.com.ua/lounge/osadcha-u-stilnomu-kostyumi-pohvalilasya-tonkoyu-taliyeyu-foto-2010644/","image":"https://imgnewtabl.pravda.com.ua/tabloid/images/doc/7/a/212907/7a6d3a989c78adaf0a709e5596620cef.jpeg","publishedAt":"2025-06-26T07:20:00Z","source":{"name":"ТаблоID","url":"https://tabloid.pravda.com.ua"}}]}