{"totalArticles":125656,"articles":[{"title":"У РФ підтвердили загибель генерал-майора Гудкова на Курщині","description":"Раніше українські та російські джерела повідомляли, що генерал-майор Михайло Гудков був убитий 2 липня внаслідок українського удару з РСЗВ Himars по командному пункту армії РФ у селищі міського типу Коренєво в Курській області","content":"Губернатор Приморського краю Росії Олег Кожемяко 3 липня підтвердив загибель у прифронтовій Курській області генерал-майора Михайла Гудкова.\n«Висловлюю глибокі співчуття рідним, близьким та товаришам по службі Михайла Гудкова, Нарімана Шихалієва та в... [596 chars]","url":"https://www.radiosvoboda.org/a/news-zahynuv-rosijskyj-general-gudkov/33462858.html","image":"https://gdb.rferl.org/01000000-0aff-0242-f7c7-08db6729a391_w1200_h630.jpg","publishedAt":"2025-07-03T10:20:44Z","source":{"name":"Радіо Свобода","url":"https://www.radiosvoboda.org"}},{"title":"Біля близького червоного карлика знайдена суперземля","description":"Астрономи повідомили про виявлення нової кам'янистої екзопланети. Вона обертається навколо відносно близької до Сонця зорі.","content":"Астрономи повідомили про виявлення нової кам’янистої екзопланети. Вона обертається навколо відносно близької до Сонця зорі.\nСуперземля, що обертається навколо червоного карлика, в уявленні художника. Джерело: Gabriel Pérez Díaz, SMM (IAC)\nВідкриття б... [2072 chars]","url":"https://universemagazine.com/udvichi-bilsha-za-zemlyu-bilya-blyzkogo-chervonogo-karlyka-znajdena-ekzoplaneta/","image":"https://universemagazine.com/wp-content/uploads/2022/06/y7y8ureptf3zfudj9xgaug.jpg","publishedAt":"2025-07-03T10:09:58Z","source":{"name":"Universe Space Tech","url":"https://universemagazine.com"}},{"title":"Випущено найтонший і потужний \"смартфон-планшет\" у світі – і це не Samsung","description":"Китайський виробник Honor представив нову \"розкладачку\" Magic V5. На тлі конкурентів вона виділяється рекордно тонким і легким корпусом.","content":"У складеному стані товщина девайса становить 8,8 мм – на 2 мм менше, ніж у найтоншого Galaxy Fold.\nКитайський виробник Honor представив нову \"розкладачку\" Magic V5. На тлі конкурентів вона виділяється рекордно тонким і легким корпусом, пише The Verge... [1393 chars]","url":"https://www.unian.ua/techno/gadgets/skladni-smartfoni-2025-u-honor-viyshov-nedorogiy-vbivcya-galaxy-z-fold-7-13056465.html","image":"https://images.unian.net/photos/2025_07/thumb_files/1000_545_1751533775-3068.jpg?1","publishedAt":"2025-07-03T09:49:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Ф'юрі викликав Усика на трилогію, назвавши дату та місце бою","description":"Колишній чемпіон світу в надважкій вазі Тайсон Ф'юрі запропонував володарю титулів WBA, WBO, WBC та IBO Олександру Усику провести третій очний поєдинок, назвавши дату та місце бою ᐅTSN.ua (новини 1+1)","content":"Усик – Ф'юрі / © Associated Press\nРеклама\nКолишній чемпіон світу в надважкій вазі Тайсон Ф'юрі, який на початку 2025 року оголосив про завершення кар'єри, викликав володаря титулів WBA, WBO, WBC та IBO Олександра Усика на третій очний поєдинок.\nБрита... [1175 chars]","url":"https://tsn.ua/prosport/fiuri-vyklykav-usyka-na-trylohiiu-nazvavshy-datu-ta-mistse-boiu-2862539.html","image":"https://img.tsn.ua/cached/324/tsn-7d69491ed57b2e0aebe0922b41d97a86/thumbs/1200x630/ce/06/a4f0f050e109891fa39b710ec78906ce.jpeg","publishedAt":"2025-07-03T09:35:46Z","source":{"name":"tsn.ua","url":"https://tsn.ua"}},{"title":"У Києві попрощалися з пілотом F-16 Максимом Устименком","description":"Він міг катапультуватися, але відвів літак від осель мирних громадян… Взірець справжнього лицаря, справжнього звитяжного воїна, сказав на прощанні священник.","content":"Захисник героїчно загинув, відвівши літак від населеного пункту.\nУ Києві попрощалися з пілотом F-16 Максимом Устименком, який загинув в ніч проти 29 червня під час відбиття ворожої атаки.\nЦеремонія прощання відбулася у Михайлівському соборі. Як повід... [1551 chars]","url":"https://www.unian.ua/society/maksim-ustimenko-u-kiyevi-poproshchalisya-z-pilotom-f-16-novini-kiyeva-13056429.html","image":"https://images.unian.net/photos/2025_07/thumb_files/620_324_1751534674-7162.jpg?1","publishedAt":"2025-07-03T09:32:05Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Шмигаль на запит адвоката пояснив, чому не можна відсторонити Чернишова","description":"Прем’єр-міністр Денис Шмигаль написав листа на ім’я адвоката віцепремєр-міністра – міністра національної єдності Олексія Чернишова, в якому пояснив, чому Чернишова не варто відсторонювати з посади. Цей лист захист міністра використав у суді, як аргумент проти відсторонення.","content":"Прем’єр-міністр Денис Шмигаль написав листа на ім’я адвоката віцепрем'єр-міністра – міністра національної єдності Олексія Чернишова, в якому пояснив, чому Чернишова не варто відсторонювати з посади. Цей лист захист міністра використав у суді, як аргу... [1865 chars]","url":"https://www.pravda.com.ua/news/2025/07/3/7520000/","image":"https://img.pravda.com/images/doc/7/5/7520000_fb_image_ukr_2025_07_03_12_28_22.jpg","publishedAt":"2025-07-03T09:14:00Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Супутник MethaneSAT вийшов з ладу через рік після запуску","description":"Один із найсучасніших апаратів для спостереження за парниковими газами в космосі MethaneSAT припинив роботу через рік після запуску.","content":"Один із найсучасніших апаратів для спостереження за парниковими газами в космосі припинив свою роботу менш ніж через рік після запуску. Йдеться про супутник MethaneSAT, який був створений і керувався некомерційною організацією Environmental Defense F... [2336 chars]","url":"https://root-nation.com/ua/news-ua/it-news-ua/ua-methanesat-fails-in-space-after-1-year/","image":"https://root-nation.com/wp-content/uploads/2025/07/methanesat-1.jpg","publishedAt":"2025-07-03T08:50:32Z","source":{"name":"Root-Nation.com","url":"https://root-nation.com"}},{"title":"Гравець Ліверпуля і збірної Португалії загинув у ДТП","description":"Аварія сталася на 65-му кілометрі траси A-52, поблизу муніципалітету Паласіос-де-Санабрія в Іспанії.","content":"Діогу Жота зіграв за Ліврепуль 111 матчів і забив 46 голів\nАварія сталася на 65-му кілометрі траси A-52, поблизу муніципалітету Паласіос-де-Санабрія в Іспанії.\nФутболіст збірної Португалії та Ліверпуля Діогу Жота загинув у ДТП на заході Іспанії. Про ... [899 chars]","url":"https://ua.korrespondent.net/sport/football/4795532-hravets-liverpulia-i-zbirnoi-portuhalii-zahynuv-u-dtp","image":"https://kor.ill.in.ua/m/1260x900/4333276.jpg","publishedAt":"2025-07-03T08:42:00Z","source":{"name":"Korrespondent.net","url":"https://ua.korrespondent.net"}},{"title":"У Сонячній системі зафіксували третій міжзоряний об’єкт","description":"У Сонячній системі зафіксували вже третій міжзоряний об’єкт — комету 3I/ATLAS, яка є найшвидшим таким об'єктом із виявлених. Що її дослідження розповість про інші планетарні системи?","content":"Астрономи виявили третій міжзоряний об’єкт у Сонячній системі — комету 3I/ATLAS, яка рухається на швидкості 60 кілометрів на секунду. На відміну від комет у Сонячній системі, ця не обертається навколо Сонця, а пролетить повз нього. Науковці підтверди... [2409 chars]","url":"https://nauka.ua/news/tretij-mizhzoryanij-obyekt-zaletiv-u-sonyachnu-sistemu-na-shvidkosti-60-kilometriv-na-sekundu","image":"https://nauka.ua/storage/uploads/public/686/640/e56/686640e562113821605057.jpg","publishedAt":"2025-07-03T08:36:54Z","source":{"name":"nauka.ua","url":"https://nauka.ua"}},{"title":"\"Ядерний\" гриб біля Харцизька: ворожий арсенал було знищено дронами СБУ","description":"Про це у четвер, 3 липня, розповіли у Службі безпеки України. Як повідомляється,...","content":"«Ядерний» гриб біля Харцизька: ворожий арсенал було знищено дронами СБУ\nДетонація на складі боєприпасів російських військ в районі окупованого Харцизька, відео якої раніше розлетілося соцмережами, стала наслідком атаки ударних безпілотників.\nПро це у... [738 chars]","url":"https://armyinform.com.ua/2025/07/03/yadernyj-gryb-bilya-harczyzka-vorozhyj-arsenal-bulo-znyshheno-dronamy-sbu/","image":"https://armyinform.com.ua/wp-content/uploads/2025/07/photo_2025-07-03_10-02-39-1.jpg","publishedAt":"2025-07-03T08:29:00Z","source":{"name":"ArmyInform","url":"https://armyinform.com.ua"}}]}