{"totalArticles":6694876,"articles":[{"title":"Breakthrough DNA Repair System May Revolutionize Cancer","description":"When DNA breaks inside the cell, it can spell disaster, especially if the damage occurs in areas of the genome that are difficult to repair. Now","content":"When DNA breaks inside the cell, it can spell disaster, especially if the damage occurs in areas of the genome that are difficult to repair. Now, scientists Irene Chiolo and Chiara Merigliano at the USC Dornsife College of Letters, Arts and Sciences ... [3378 chars]","url":"https://www.miragenews.com/breakthrough-dna-repair-system-may-1474174/","image":"https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1581595220921-eec2071e5159%3Fixlib%3Drb-4.0.3%26amp%3Bixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1170%26amp%3Bq%3D80","publishedAt":"2025-06-08T04:12:00Z","source":{"name":"Mirage News","url":"https://www.miragenews.com"}},{"title":"Blue Jays offence comes up clutch in another rally vs. Twins","description":"With a 5-4 comeback fuelled by George Springer’s eighth-inning homer, the influence of new hitting coach David Popkins is on full display as the Blue Jays’ offence continues to perform.","content":"MINNEAPOLIS — During three years together with the Minnesota Twins, Carlos Correa and David Popkins bonded over baseball and life. The superstar shortstop credits his former hitting coach, whom he calls “a lifetime friend,” with helping him in a numb... [5464 chars]","url":"https://www.sportsnet.ca/mlb/article/blue-jays-offence-comes-up-clutch-in-another-rally-vs-twins/","image":"https://www.sportsnet.ca/wp-content/uploads/2025/06/jays1.jpg","publishedAt":"2025-06-08T03:39:00Z","source":{"name":"Sportsnet.ca","url":"https://www.sportsnet.ca"}},{"title":"Doctors warn of brain tumor surge among children: Dont miss the signs","description":"According to the National Brain Tumor Society, approximately 5.7% of all primary brain tumors occur in children and adolescents aged 0-19 years.","content":"A growing number of children and young adults are being diagnosed with brain tumors, a condition once thought to largely affect the elderly.\nIn recent years, doctors across India are witnessing a disturbing trend: more cases of brain tumors being det... [5245 chars]","url":"https://www.indiatoday.in/health/story/world-brain-tumor-day-children-young-adults-india-rising-early-diagnosis-2737419-2025-06-08","image":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202506/a-stylized-luminescent-human-brain-in-a-digital-grid-evoking-the-concepts-of-neuroscience--artificia-07224852-16x9_0.jpg?VersionId=cYQq4wTJJB5yCPRIlVgk8QYhbL3gOl2B","publishedAt":"2025-06-08T03:30:00Z","source":{"name":"India Today","url":"https://www.indiatoday.in"}},{"title":"Marcos urged to retain PCO chief Jay Ruiz","description":"Three media organizations urged President Marcos to retain Jay Ruiz as the secretary of the Presidential Communications Office (PCO) amid the ongoing Cabinet...","content":"Three media organizations urged President Marcos to retain Jay Ruiz as the secretary of the Presidential Communications Office (PCO) amid the ongoing Cabinet revamp.\nPCO Secretary Jay Ruiz (Photo courtesy of PCO)\nThe Justice Reporters’ Organization (... [2779 chars]","url":"https://mb.com.ph/2025/06/08/marcos-urged-to-retain-pco-chief-jay-ruiz","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/08/17794.webp","publishedAt":"2025-06-08T03:22:35Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Engineer going home for Eid, 3 brothers visiting Vaishno Devi - Katra-Srinagar Vande Bharat takes off with 530 on board","description":"Nearly 97 km of this 111 km is through 27 tunnels, while another 7 km passes over 49 bridges, including the iconic Rail Arch Bridge over Chenab and the cable-stayed bridge over Anji Khad.","content":"ON SATURDAY morning, when the first Vande Bharat train with 530 passengers on board sounded the whistle at Shri Mata Vaishno Devi railway station here, it marked the beginning of a journey to Kashmir through various engineering marvels and three majo... [3915 chars]","url":"https://indianexpress.com/article/india/engineer-going-home-for-eid-3-brothers-visiting-vaishno-devi-katra-srinagar-vande-bharat-takes-off-with-530-on-board-10054182/","image":"https://images.indianexpress.com/2025/06/vaishno-Train-3col.jpg","publishedAt":"2025-06-08T03:20:00Z","source":{"name":"The Indian Express","url":"https://indianexpress.com"}},{"title":"Ex-SC justice Azcuna: Senate needs to start process for VP Sara impeachment","description":"Senate President Chiz Escudero needs to get the Articles of Impeachment read to prompt the Senate’s jurisdiction over VP Sara Duterte’s case, former SC Associate Justice Adolf Azcuna said.","content":"Senate President Francis “Chiz” Escudero needs to get the Articles of Impeachment read to prompt the Senate’s jurisdiction over Vice President Sara Duterte’s case, and the 20th Congress can continue the trial, according to former Supreme Court Associ... [4118 chars]","url":"https://www.gmanetwork.com/news/topstories/nation/948707/ex-sc-justice-azcuna-senate-needs-to-start-process-for-vp-sara-impeachment/story/","image":"https://images.gmanews.tv/webpics/2025/06/Chiz_Sara_2025_06_04_08_40_47.jpg","publishedAt":"2025-06-08T03:19:11Z","source":{"name":"GMA Network","url":"https://www.gmanetwork.com"}},{"title":"GFG puts Whyalla port company into administration after government intervention","description":"GFG Alliance has placed its subsidiary company which formerly operated the Whyalla port into administration, saying it was left with no other option after the state government intervened in an ownership dispute over the facility.","content":"GFG Alliance has placed its subsidiary company which formerly operated the Whyalla port into administration, after the state government intervened in an ownership dispute over the facility.\nThe company, Whyalla Ports Pty Ltd, was embroiled in a Feder... [3130 chars]","url":"https://www.abc.net.au/news/2025-06-08/whyalla-port-update/105391284","image":"https://live-production.wcms.abc-cdn.net.au/7f0a9566ad7190a1126a737b8beca2a7?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=0&width=862&height=485&imformat=generic","publishedAt":"2025-06-08T03:15:32Z","source":{"name":"Australian Broadcasting Corporation","url":"https://www.abc.net.au"}},{"title":"R-Truth Returns At WWE MITB, Helps Cody Rhodes & Jey Uso Beat John Cena & Logan Paul","description":"There's not a lot of Truth to the contract rumors: Ron \"R-Truth\" Killings has made an appearance at Money in the Bank to assist Cody Rhodes and Jey Uso.","content":"The John Cena retirement tour has stopped at Money in the Bank, as the \"Never Seen Seventeen\" teamed up with Logan Paul to take on WWE World Heavyweight Champion Jey Uso and Cody Rhodes in Saturday's main event. With world champions on both teams, it... [1567 chars]","url":"https://www.wrestlinginc.com/1880549/r-truth-returns-wwe-mitb-helps-cody-rhodes-jey-uso-beat-john-cena-logan-paul/","image":"https://www.wrestlinginc.com/img/gallery/r-truth-returns-at-wwe-mitb-helps-cody-rhodes-jey-uso-beat-john-cena-logan-paul/l-intro-1749351058.jpg","publishedAt":"2025-06-08T03:01:07Z","source":{"name":"Wrestling Inc.","url":"https://www.wrestlinginc.com"}},{"title":"DICT eyes 8 million digital jobs by 2028 under new leadership","description":"The Department of Information and Communications Technology (DICT) has launched its flagship “Trabahong Digital” program with the bold goal of creating...","content":"(DICT PHOTO)\nThe Department of Information and Communications Technology (DICT) has launched its flagship “Trabahong Digital” program with the bold goal of creating eight million digital jobs by 2028.\n“The roll out of this flagship program marks a bo... [1952 chars]","url":"https://mb.com.ph/2025/06/08/dict-eyes-8-million-digital-jobs-by-2028-under-new-leadership","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/08/17792.webp","publishedAt":"2025-06-08T02:59:23Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Colombia presidential candidate shot in head","description":"The opposition senator was hit three times during rally in Bogota and is in a critical condition in hospital.","content":"Colombia presidential hopeful shot in head at rally\nA Colombian presidential candidate has been shot three times - reportedly twice in the head - at a campaign event in the capital, Bogota.\nMiguel Uribe Turbay, 39, was attacked while addressing a sma... [458 chars]","url":"https://www.bbc.com/news/articles/c9dq8yxxy8zo","image":"https://ichef.bbci.co.uk/news/1024/branded_news/4b9d/live/aa4305d0-4410-11f0-97fc-8175165e17d2.jpg","publishedAt":"2025-06-08T02:45:33Z","source":{"name":"BBC","url":"https://www.bbc.com"}}]}