{"totalArticles":6883490,"articles":[{"title":"'PTI’s protest movement is ineffective' says Rana Sanaullah","description":"PM’s adviser said “Bunyan-un-Marsoos”, being carried out in the name of justice, has achieved historic success","content":"Listen to article\nSpecial Assistant to the Prime Minister on Public and Political Affairs Rana Sanaullah has said that Pakistan Tehreek-e-Insaf's protest call won't bear fruit as the party is not in a position to lead any such movement at the moment.... [3819 chars]","url":"https://tribune.com.pk/story/2549934/sanaullah-dubs-ptis-protest-call-futile","image":"https://i.tribune.com.pk/media/images/rana1700582056-0/rana1700582056-0.jpg","publishedAt":"2025-06-07T13:30:00Z","source":{"name":"The Express Tribune","url":"https://tribune.com.pk"}},{"title":"Measles cited as possible factor in Southwestern Ontario infant's death","description":"A seven-month outbreak of measles has claimed its first life in the London-area","content":"This advertisement has not loaded yet, but your article continues below.\nMeasles cited as possible factor in Southwestern Ontario infant's death An infant born prematurely after contracting measles in the womb has died in Southwestern Ontario, the pr... [6227 chars]","url":"https://windsorstar.com/news/local-news/measles-cited-as-possible-factor-in-southwestern-ontario-infants-death","image":"https://smartcdn.gprod.postmedia.digital/windsorstar/wp-content/uploads/2025/06/LDN20250321DR004.LF_.jpg","publishedAt":"2025-06-07T13:20:26Z","source":{"name":"Windsor Star","url":"https://windsorstar.com"}},{"title":"Four RORO vessels deployed to ease transport burden amid San Juanico Bridge rehab","description":"At least four roll-on, roll off (RORO) passenger ferries capable of carrying cargo trucks were deployed in Eastern Visayas to ease the burden of the load...","content":"At least four roll-on, roll off (RORO) passenger ferries capable of carrying cargo trucks were deployed in Eastern Visayas to ease the burden of the load capacity limitations imposed on the San Juanico Bridge amid the plan to rehabilitate the iconic ... [2431 chars]","url":"https://mb.com.ph/2025/06/07/four-roro-vessels-deployed-to-ease-transport-burden-amid-san-juanico-bridge-rehab","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/07/17736.webp","publishedAt":"2025-06-07T12:54:19Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Another car accident at NAIA but NNIC says no reported casualties, property damage","description":"Another road crash involving a van occurred at the arrival area of the Ninoy Aquino International Airport (NAIA) Terminal 2 on Friday night, June 6, but the New...","content":"Another car accident at NAIA but NNIC says no reported casualties, property damage\nAnother road crash involving a van occurred at the arrival area of the Ninoy Aquino International Airport (NAIA) Terminal 2 on Friday night, June 6, but the New NAIA I... [1430 chars]","url":"https://mb.com.ph/2025/06/07/another-car-accident-at-naia-but-nnic-says-no-reported-casualties-property-damage","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/07/17735.webp","publishedAt":"2025-06-07T12:45:59Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Pakistan PM exchanges Eid greetings with leaders of Azerbaijan, Qatar, Tajikistan","description":"ISLAMABAD: Prime Minister Shehbaz Sharif exchanged Eid Al-Adha greetings with the leaders of Azerbaijan, Qatar, Malaysia, Tajikistan and Malaysia on Saturday, his office said, vowing to strengthen bilateral ties and cooperation with them. Pakistan is celebrating Eid Al-Adha, one of the two most important festivals of the Islamic calendar, today, Saturday. Muslims mark the Eid","content":"From Pakistan to Spain via Canaries, smugglers using more dangerous migration routes\nDERA BAJWA, Pakistan: It was supposed to be the final leg of Amir Ali’s monthslong journey to Europe. But he was nowhere near his destination, with only death in sig... [8807 chars]","url":"https://www.arabnews.com/node/2603730/pakistan","image":"https://www.arabnews.com/sites/default/files/styles/660x371_watermarksaudi/public/main-image/2025/06/07/4609626-1913270829.jpg?itok=5NEenElC","publishedAt":"2025-06-07T12:28:26Z","source":{"name":"Arab News","url":"https://www.arabnews.com"}},{"title":"Terrifying 97% surge in ultra infectious UK Covid variant","description":"The rampant new strain comes as latest UK Health Security Agency data shows nearly a 6% increase in weekly deaths from Covid.","content":"The new strain has been dubbed Nimbus\nA new strain of Covid has been discovered in the UK as rates of positive tests have soared 97% since the begining of March. NB.1.8.1 COVID-19 variant, sometimes referred to as the Nimbus variant, has been detecte... [2075 chars]","url":"https://www.express.co.uk/news/uk/2065663/uk-covid-nimbus-variant-spread","image":"https://cdn.images.express.co.uk/img/dynamic/1/1200x630/6214130.jpg","publishedAt":"2025-06-07T12:21:00Z","source":{"name":"Daily Express","url":"https://www.express.co.uk"}},{"title":"Erode Corporation extends service of domestic breeding checkers for two more months","description":"Erode Corporation extends DBC service for monsoon, allocating ₹1.01 crore for wages and benefits, focusing on anti-dengue operations.","content":"With the southwest monsoon setting in, Erode Corporation has extended the service of domestic breeding checkers (DBCs) by two more months and has allocated ₹1.01 crore towards their wages and other statutory benefits.\nAccording to the 2011 census, th... [1486 chars]","url":"https://www.thehindu.com/news/cities/Coimbatore/erode-corporation-extends-service-of-domestic-breeding-checkers-for-two-more-months/article69668187.ece","image":"https://th-i.thgim.com/public/incoming/kef5m9/article69668546.ece/alternates/LANDSCAPE_1200/Thermocol.jpg","publishedAt":"2025-06-07T12:16:00Z","source":{"name":"The Hindu","url":"https://www.thehindu.com"}},{"title":"Power, and Ken, keep season alive with win over Giants","description":"A cold night in Canberra saw a hot finish as Port Adelaide holds on for a crucial win","content":"A cold night in Canberra saw a hot finish as Port Adelaide holds on for a crucial win\nHugh Jackson celebrates during the round 13 match between Greater Western Sydney and Port Adelaide at Manuka Oval, June 7, 2025. Picture: Getty Images\nZAK BUTTERS a... [7220 chars]","url":"https://www.afl.com.au/news/1336984/power-and-ken-keep-season-alive-with-win-over-giants","image":"https://resources.afl.com.au/afl/photo/2025/06/07/392fcfc8-278e-45a0-b71d-a12a124a44b8/13GWSPA25DT059880452.jpg","publishedAt":"2025-06-07T12:15:00Z","source":{"name":"afl.com.au","url":"https://www.afl.com.au"}},{"title":"Beyond the Pale festival cancelled just days before kickoff at Glendalough Estate","description":"Festival infrastructure was already in place as suppliers began dismantling site after organisers announced sudden cancellation","content":"One of Ireland’s most popular music festivals, Beyond the Pale, has been cancelled just days before it was due to begin next weekend.\nCrews had been working on-site for weeks, setting up stages and preparing the grounds at Glendalough Estate, Co Wick... [1835 chars]","url":"https://www.irishexaminer.com/news/arid-41647093.html","image":"https://www.irishexaminer.com/cms_media/module_img/9306/4653433_3_seoimageog_Dublin_20Simon_Beyond_20the_20Pale_3.jpg","publishedAt":"2025-06-07T12:15:00Z","source":{"name":"Irish Examiner","url":"https://www.irishexaminer.com"}},{"title":"Aryna Sabalenka v Coco Gauff: French Open 2025 women’s singles final - live","description":"A new Roland-Garros champion will be crowned when the top two seeds meet on Court Philippe-Chatrier. Join John Brewin for the latest","content":"How was Coco Gauff feeling on the eve of the final? Memories of 2022.\nMy first final here I was super nervous, and I kind of wrote myself off before the match even happened. Obviously here I have a lot more confidence just from playing a grand slam f... [924 chars]","url":"https://www.theguardian.com/sport/live/2025/jun/07/aryna-sabalenka-v-coco-gauff-french-open-2025-womens-singles-final-live","image":"https://i.guim.co.uk/img/media/278d0c50b86aaedd6579e1af7c12a6c70640cc09/232_0_4709_3768/master/4709.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=89636c8b7efd117c0c2f1b117d0d8aca","publishedAt":"2025-06-07T12:08:25Z","source":{"name":"The Guardian","url":"https://www.theguardian.com"}}]}