{"totalArticles":7322560,"articles":[{"title":"В Угорщині заявили про зняття санкцій США, які заважали росіянам розширити АЕС \"Пакш\"","description":"Міністр закордонних справ Угорщини Петер Сійярто у неділю подякував США за скасування санкцій, що стримували розширення атомної електростанції Пакш, проєкт якої реалізує Росатом.","content":"Міністр закордонних справ Росії Сергій Лавров (ліворуч) слухає міністра закордонних справ Угорщини Петера Сійярто (праворуч) після переговорів у державній резиденції Ново-Огарьово 17 лютого 2016 року в Москві, Росія/Getty Images\nМіністр закордонних с... [1407 chars]","url":"https://www.pravda.com.ua/news/2025/06/29/7519314/","image":"https://img.pravda.com/images/doc/7/5/7519314_fb_image_ukr_2025_06_29_15_23_24.jpg","publishedAt":"2025-06-29T11:49:00Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Зеленський підписав указ про вихід з конвенції про заборону протипіхотних мін - нардеп","description":"Президент Володимир Зеленський підписав указ, яким увів у дію рішення Ради національної безпеки і оборони України про вихід нашої держави з Оттавської конвенції — міжнародного договору, що забороняє застосування, накопичення та виробництво протипіхотних мін.","content":"Президент Володимир Зеленський підписав указ, яким увів у дію рішення Ради національної безпеки і оборони України про вихід нашої держави з Оттавської конвенції — міжнародного договору, що забороняє застосування, накопичення та виробництво протипіхот... [902 chars]","url":"https://www.pravda.com.ua/news/2025/06/29/7519309/","image":"https://img.pravda.com/images/doc/7/5/7519309_fb_image_ukr_2025_06_29_14_10_02.jpg","publishedAt":"2025-06-29T10:38:05Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Орбан вперше прокоментував рекордний за масштабами ЛГБТ-прайд у Будапешті","description":"Прем’єр-міністр Угорщини у своїх перших коментарях про наймасштабніший в історії Будапешта ЛГБТ-прайд назвав його","content":"Прем’єр-міністр Угорщини у своїх перших коментарях про наймасштабніший в історії Будапешта ЛГБТ-прайд назвав його \"черговим доказом\" того, чому країні потрібен консервативний уряд.\nЯк повідомляє \"Європейська правда\", його слова наводить 444.hu.\nОрбан... [999 chars]","url":"https://www.eurointegration.com.ua/news/2025/06/29/7214831/","image":"https://img.eurointegration.com.ua/images/doc/f/1/f182c1b---------------2025-06-29-132648.jpg","publishedAt":"2025-06-29T10:25:01Z","source":{"name":"Європейська правда","url":"https://www.eurointegration.com.ua"}},{"title":"Обстріл Дрогобича: мешканців закликали зачинити вікна і не виходити з дому","description":"Через масований ракетно-дроновий обстріл у Дрогобичі постраждав промисловий об'єкт. Влада закликає мешканців щільно зачинити вікна й залишатися вдома ᐅ TSN. ua (новини 1+1).","content":"Мешканців просять зачинити вікна / © Pixabay\nРеклама\nПісля нічної атаки дронами та ракетами по Дрогобичу, яка спричинила пожежу на промисловому об’єкті та знеструмлення кількох районів, влада закликає мешканців залишатися вдома, зачинити вікна та две... [1887 chars]","url":"https://tsn.ua/ukrayina/meshkantsiv-drohobycha-zaklykaiut-shchilno-zachynyty-vikna-dveri-y-ne-vykhodyty-na-vulytsiu-shcho-vidomo-2859479.html","image":"https://img.tsn.ua/cached/109/tsn-0b4bc102/thumbs/1200x630/ae/22/f5126cbc13e722d784ae64cc6dfd22ae.jpg","publishedAt":"2025-06-29T10:15:30Z","source":{"name":"tsn.ua","url":"https://tsn.ua"}},{"title":"З чого складаються кільця Сатурна","description":"У Сонячній системі є кілька планет з кільцями, що оперізують, але Сатурн серед них унікальний. Читайте на УНІАН, чому кільця Сатурна не розвалюються.","content":"Розповідаємо, з чого складаються унікальні кільця планети Сатурн.\nПланета Сатурн друга за розміром серед своїх компаньйонів у Сонячній системі, а також може похизуватися ефектними та видатними кільцями.\nКільця Сатурна - з чого складаються і що про ни... [2223 chars]","url":"https://www.unian.ua/science/z-chogo-skladayutsya-kilcya-saturna-cikave-vidkrittya-13051770.html","image":"https://images.unian.net/photos/2025_03/thumb_files/1000_545_1742046804-8424.jpg?1","publishedAt":"2025-06-29T10:15:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Вєрка Сердючка заспівала російською","description":"Співак дав новий концерт в Одесі і вперше прокоментував скандал навколо себе. Зокрема, він прямо зі сцени жартома присвятив свій виступ омбудсмену та переклав деякі пісні","content":"Артист пожартував на цю тему прямо зі сцени.\nАндрій Данилко, який виступає в образі Вєрки Сердючки, вперше відреагував на рішення омбудсмена після скандального виступу в столиці.\nНе секрет, що днями Тарас Кремінь зазначив, що артист не буде покараний... [1003 chars]","url":"https://www.unian.ua/lite/stars/vyerka-serdyuchka-zaspivala-rosiyskoyu-artist-vpershe-vidreaguvav-na-rishennya-ombudsmena-13052286.html","image":"https://images.unian.net/photos/2025_06/thumb_files/620_324_1751189724-6560.jpg?1","publishedAt":"2025-06-29T10:00:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Ремейка першого Resident Evil не буде, але планується ремейк Resident Evil Zero","description":"Capcom не збирається робити ремейк першої частини Resident Evil, як це було з другою і четвертою частиною. Але студія планує оновити Code Veronica і Zero.","content":"У Capcom все ще працюють розробники RE: Zero, які хотіли б повернутися до цієї гри.\nCapcom не збирається робити ремейк першої частини Resident Evil, як це було з другою та четвертою частиною. Але натомість студія планує оновити Code Veronica та Zero.... [1308 chars]","url":"https://www.unian.ua/games/remeyka-pershogo-resident-evil-ne-bude-ale-planuyetsya-remeyk-resident-evil-zero-13052271.html","image":"https://images.unian.net/photos/2025_06/thumb_files/1000_545_1751189182-6192.jpg?1","publishedAt":"2025-06-29T09:48:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Зеленський відреагував на загибель пілота F-16","description":"Під час масованої атаки на Україну загинув пілот F-16 Максим Устименко, знищивши сім повітряних цілей.","content":"Під час масованої атаки на Україну загинув пілот F-16 Максим Устименко, знищивши сім повітряних цілей.\nПрезидент Володимир Зеленський прокоментував нічну атаку Росії на Україну в ніч проти 29 червня. Через обстріл є поранені, серед постраждалих дитин... [1713 chars]","url":"https://ua.korrespondent.net/ukraine/4794419-zelenskyi-vidreahuvav-na-zahybel-pilota-F-16","image":"https://kor.ill.in.ua/m/1260x900/4332215.jpg","publishedAt":"2025-06-29T08:40:00Z","source":{"name":"Korrespondent.net","url":"https://ua.korrespondent.net"}},{"title":"Співачка SLAVIA показала фігуру на 20 день після пологів","description":"Артистка, яка нещодавно народила первістка, показала своє тіло після пологів. SLAVIA похизувалася підтягнутим тілом та розповіла, як їй це вдалося","content":"Артистка відверто розповіла про зміни фігури після народження сина.\nУкраїнська співачка та ексдружина Дзідзьо - SLAVIA - яка нещодавно вперше стала мамою, показала свою фігуру після пологів.\nАртистка опублікувала нове відео своєму Instagram. У ролику... [1171 chars]","url":"https://www.unian.ua/lite/stars/spivachka-slavia-pokazala-figuru-na-20-den-pislya-pologiv-13052214.html","image":"https://images.unian.net/photos/2025_06/thumb_files/620_324_1751184250-6854.jpg?1","publishedAt":"2025-06-29T08:35:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"У ЗСУ пояснили, чому росіяни жадають захопити Кам’янське на Запоріжжі","description":"Про це в ефірі телемарафону в неділю, 29 червня, розповів речник Сил оборони Півдня...","content":"У ЗСУ пояснили, чому росіяни жадають захопити Кам’янське на Запоріжжі\nУ Силах оборони півдня України пояснили, чому росіяни зацікавлені в окупації Кам’янського у Запорізькій області.\nПро це в ефірі телемарафону в неділю, 29 червня, розповів речник Си... [1528 chars]","url":"https://armyinform.com.ua/2025/06/29/u-zsu-poyasnyly-chomu-rosiyany-zhadayut-zahopyty-kamyanske-na-zaporizhzhi/","image":"https://armyinform.com.ua/wp-content/uploads/2025/06/photo_2025-06-29_08-17-37-1-960x514.jpg","publishedAt":"2025-06-29T08:33:00Z","source":{"name":"ArmyInform","url":"https://armyinform.com.ua"}}]}