{"totalArticles":6967416,"articles":[{"title":"Laborer killed by falling pipe in construction site","description":"CEBU CITY–A laborer died when a metal pipe fell on him at a construction site in Barangay Zapatera here on Tuesday morning, June 10.Police identified the...","content":"THE damaged hard hat that a laborer wore when a metal pipe fell on him in a construction site in Barangay Zapatera, Cebu City. (Contributed photo)\nCEBU CITY–A laborer died when a metal pipe fell on him at a construction site in Barangay Zapatera here... [1775 chars]","url":"https://mb.com.ph/2025/06/12/laborer-killed-by-falling-pipe-in-construction-site","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/12/18840.webp","publishedAt":"2025-06-12T04:51:50Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"This new museum in Quezon City offers glimpse of post-war Philippines","description":"Bahay Modernismo is a heritage museum nestled within the Quezon City Memorial Circle. Built using original architectural fragments from the former Aquino family home on Times Street, this modern bungalow-style house offers an immersive glimpse into the design, lifestyle, and cultural spirit of post-war Philippines.","content":"Ever wondered what the Philippines looked like in the post-war era? No need to imagine — the newest museum in Quezon City brings the shining, shimmering 1950s to life.\nWelcome to Bahay Modernismo, a heritage museum nestled within the Quezon City Memo... [1263 chars]","url":"https://www.gmanetwork.com/news/lifestyle/artandculture/949181/this-new-museum-in-quezon-city-offers-glimpse-of-post-war-philippines/story/","image":"https://images.gmanews.tv/webpics/2025/06/qc-entertainment_2025_06_12_12_31_20.jpg","publishedAt":"2025-06-12T04:32:58Z","source":{"name":"GMA Network","url":"https://www.gmanetwork.com"}},{"title":"UN Ocean Conference: significant increase in marine protected areas","description":"Marine protected areas will grow by around a third following government pledges at the UN Ocean Conference in Nice, France’s ecological transition minister said Wednesday.","content":"Marine protected areas (MPAs) will increase by about a third following announcements made by governments at the UN Ocean Conference in Nice, the French ecological transition minister Agnès Pannier-Runacher said at a press conference on Wednesday.\n“We... [3022 chars]","url":"https://www.euractiv.com/section/eet/news/un-ocean-conference-significant-increase-in-marine-protected-areas/","image":"https://www.euractiv.com/wp-content/uploads/sites/2/2025/06/GettyImages-2219401712.jpg","publishedAt":"2025-06-12T04:31:19Z","source":{"name":"Euractiv","url":"https://www.euractiv.com"}},{"title":"Jetstar Asia closure: Some customers confused, frustrated by poor communication; Taiwan earthquake: 5.9-magnitude offshore quake rattles Taiwan: Singapore live news","description":"Welcome to Yahoo Singapore's live updates, your guide to some of the most compelling stories unfolding across the digital universe and beyond.","content":"Latest news and updates throughout the day, curated by Yahoo Singapore\nJetstar Asia's sudden announcement about its closure on Wednesday morning has left some customers confused and frustrated. (PHOTO: Fabrizio Gandolfo/SOPA Images/LightRocket via Ge... [1007 chars]","url":"https://sg.news.yahoo.com/live/singapore-live-news-jetstar-asia-closure-some-customers-confused-frustrated-by-poor-communication-taiwan-earthquake-59-magnitude-offshore-quake-rattles-taiwan-014018171.html","image":"https://s.yimg.com/ny/api/res/1.2/f6I4fScxXC7ybv3IoMfGQA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2025-06/ead64b90-4661-11f0-acbf-7cfdd8ccdfbc","publishedAt":"2025-06-12T04:15:00Z","source":{"name":"Yahoo News Singapore","url":"https://sg.news.yahoo.com"}},{"title":"Death of great-grandmother could have been prevented following gall bladder surgery at Clare Hospital, inquest finds","description":"A great-grandmother who died after gall bladder surgery at a regional South Australian hospital could still be alive if a surgeon had abandoned the procedure earlier or had access to a CT scan, a coroner finds.","content":"A great-grandmother who died after gall bladder surgery at a regional South Australian hospital could still be alive if a surgeon had abandoned the procedure earlier or had access to a CT scan, a coroner has found.\nDeputy State Coroner Naomi Kereru f... [2972 chars]","url":"https://www.abc.net.au/news/2025-06-12/coronial-findings-woman-dies-after-gall-bladder-surgery/105408850","image":"https://live-production.wcms.abc-cdn.net.au/128fe01421751bfa675deb0afd683e31?impolicy=wcms_watermark_news&cropH=2375&cropW=4223&xPos=0&yPos=214&width=862&height=485&imformat=generic","publishedAt":"2025-06-12T04:14:17Z","source":{"name":"Australian Broadcasting Corporation","url":"https://www.abc.net.au"}},{"title":"Are teens taught enough life skills to know how to 'adult'?","description":"Some universities in Canada are offering Adulting 101 classes to teach students basic life skills like doing your taxes or changing a tyre. Should Australian schools be doing more?","content":"Mai is a first-year medical student. She also doesn't know how to change a light bulb.\nAfter her 18th birthday she moved out of her home in Shepparton, Victoria, to go to university in Armidale, New South Wales.\n\"The whole move out was a bit stressfu... [8539 chars]","url":"https://www.abc.net.au/news/2025-06-12/are-teens-taught-enough-life-skills-to-know-how-to-adult/105402486","image":"https://live-production.wcms.abc-cdn.net.au/8a78178c84338d4fa466a95ab6e9e606?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic","publishedAt":"2025-06-12T04:09:00Z","source":{"name":"Australian Broadcasting Corporation","url":"https://www.abc.net.au"}},{"title":"DOH: Young adults account for most HIV cases in Caraga","description":"BUTUAN CITY – The Department of Health in the Caraga Region (DOH-13) bared that 1,967 HIV cases have been recorded in the area from 1995 to February of this year. “The DOH-13 continues its campaign to encourage individuals to undergo HIV testing,” said Arlene Serrano, the TB/HIV Program…","content":"HIV CASES. Arlene Serrano, DOH-13 TB/HIV Program Coordinator, reports in a press conference Wednesday (June 11, 2025) that Caraga has logged 1,967 HIV cases from 1995 to February 2025. The highest numbers are among age groups 25-34 (967 cases) and 15... [1628 chars]","url":"https://www.pna.gov.ph/articles/1252015","image":"https://files01.pna.gov.ph/ograph/2025/06/12/hiv-report-doh-caraga.jpg","publishedAt":"2025-06-12T04:08:48Z","source":{"name":"Philippine News Agency","url":"https://www.pna.gov.ph"}},{"title":"Being Rajah Sulayman: AFP names new Navy vessel after pre-colonial warrior amid West PH Sea 'bullying'","description":"In the 16th century, Rajah Sulayman led a group of warriors to fight the colonization of the Spaniards in Luzon.  Fast forward to June 2025, his name still...","content":"In the 16th century, Rajah Sulayman led a group of warriors to fight the colonization of the Spaniards in Luzon.\nFast forward to June 2025, his name still stands as a symbol of the commitment to maritime security and the defense of the country’s sove... [2109 chars]","url":"https://mb.com.ph/2025/06/12/being-rajah-sulayman-afp-names-new-navy-vessel-after-pre-colonial-warrior-amid-west-ph-sea-bullying","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/12/18820.webp","publishedAt":"2025-06-12T04:06:45Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Residents of Ukraine's second-largest city terrorised in nine-minute drone strike","description":"A concentrated, nine-minute-long Russian drone attack has terrorised residents of Ukraine's second-largest city, killing at least six people and injuring more than 60.","content":"The distinct lawnmower-like sound of Russia's attack drones woke residents across Ukraine's second-largest city at 12:30am.\nOver the next nine minutes, there would be no pause.\nThe intense overnight assault killed at least six people and wounded 60 o... [4778 chars]","url":"https://www.abc.net.au/news/2025-06-12/kharkiv-nine-minute-drone-strike-ukraine-war-russia/105406878","image":"https://live-production.wcms.abc-cdn.net.au/ffa94cdfefe603d149355bb75afc18e0?impolicy=wcms_watermark_news&cropH=1544&cropW=2744&xPos=0&yPos=143&width=862&height=485&imformat=generic","publishedAt":"2025-06-12T04:03:15Z","source":{"name":"Australian Broadcasting Corporation","url":"https://www.abc.net.au"}},{"title":"Australia news LIVE: Paul Keating blasts ‘American apologists’ over AUKUS review; Monash IVF CEO resigns after second embryo bungle","description":"Keep up to date with today’s news.","content":"Opposition Leader Sussan Ley has claimed the Albanese government was unprepared for the Trump administration’s review of AUKUS.\nLey struck a relatively moderate tone in an interview on Sky News, saying she hoped the government succeeded on AUKUS but ... [753 chars]","url":"https://www.theage.com.au/national/australia-news-live-aukus-deal-in-doubt-arrests-in-la-liberals-to-launch-radical-review-20250612-p5m6se.html","image":"https://static.ffx.io/images/$zoom_0.2328%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_theage_live_no_age_social_wm/6f5f0ada87f979c217b76e3be0d3943f46b86bf8","publishedAt":"2025-06-12T04:02:41Z","source":{"name":"The Age","url":"https://www.theage.com.au"}}]}