{"totalArticles":7150150,"articles":[{"title":"Що станеться, якщо ви спробуєте \"приземлитися\" на газового гіганта?","description":"Космічний корабель, який намагатиметься «приземлитися» на «поверхню» Юпітера, повинен буде подолати значні перешкоди.","content":"Наша Сонячна система містить три типи планет. Між чотирма планетами земної групи – Меркурієм, Венерою, Землею і Марсом – і далекими крижаними гігантами Нептуном і Ураном розташовані два газових гіганта: Сатурн і Юпітер.\nЦі планети в основному складаю... [4341 chars]","url":"https://3oko.com.ua/shcho-stanetsia-iakshcho-vy-sprobuiete-pryzemlytysia-na-hazovoho-hihanta/","image":"https://3oko.com.ua/wp-content/uploads/2025/06/can_we_land_on_jupiter.webp","publishedAt":"2025-06-22T18:13:53Z","source":{"name":"3oko.com.ua","url":"https://3oko.com.ua"}},{"title":"Який MacBook варто купити у 2025 році?","description":"MacBook – чудові комп’ютери, але існує кілька різних різновидів, які варто розглянути. Між апаратним забезпеченням минулого покоління та всіма сучасними","content":"MacBook – чудові комп’ютери, але існує кілька різних різновидів, які варто розглянути. Між апаратним забезпеченням минулого покоління та всіма сучасними моделями, доступними зараз, може здатися, що існує безліч варіантів. Сьогодні ми розглянемо, який... [3051 chars]","url":"https://www.berdichev.biz/yakyj-macbook-varto-kupyty-u-2025-rotsi/","image":"https://www.berdichev.biz/wp-content/uploads/2025/06/macbook.webp","publishedAt":"2025-06-22T17:31:23Z","source":{"name":"Бердичів.biz","url":"https://www.berdichev.biz"}},{"title":"ГУР знищило цистерни з пальним росіян у Запорізькій області","description":"ГУР знищило залізничні цистерни з пальним росіян в окупованій Запорізькій області. Які наслідки для ворога від успішної роботи української розвідки, дивіться відео - 24 Канал.","content":"Про це повідомляє 24 Канал із посиланням на Головне управління розвідки Міноборони України.\nДо теми Зрадника та воєнного злочинця Михайла Грицая ліквідували в окупованому Бердянську, – ГУР\nЯк ГУР відпрацювало по цистернах із пальним ворога\nУкраїнські... [1071 chars]","url":"https://24tv.ua/chorna-kiptyava-do-nebes-gur-znishhilo-zaliznichni-tsisterni_n2852655","image":"https://24tv.ua/resources/photos/news/202506/2852655.jpg?v=1750588589000&w=1200&h=675","publishedAt":"2025-06-22T16:50:31Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Удар США по Ірану","description":"У Вашингтоні заявили, що готові до переговорів з Іраном, але готові і реагувати на агресивні кроки Тегерану - читайте докладно в матеріалі УНІАН","content":"Рубіо застеріг Тегеран від \"найгіршої помилки\".\nСША готові хоч завтра повернутися до переговорів з Іраном, але, якщо він спробує відповісти на американські удари, це буде \"найгіршою помилкою, яку вони коли-небудь робили\". Про це заявив державний секр... [1203 chars]","url":"https://www.unian.ua/world/udar-ssha-po-iranu-marko-rubio-zasterig-vid-perekrittya-ormuzkoji-protoki-13045941.html","image":"https://images.unian.net/photos/2025_06/thumb_files/620_324_1750610378-3404.jpg?1","publishedAt":"2025-06-22T16:48:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"CNN розповів, про що непокоївся Трамп перед ударами по Ірану","description":"За даними американського телеканалу CNN, президент країни Дональд Трамп мав два головні занепокоєння щодо ударів по об’єктах іранської ядерної програми: щоб атака США була вирішальною для знищення добре укріплених обєктів і щоб потенційні дії не втягнули США в тривалу смертоносну війну.","content":"За даними американського телеканалу CNN, президент країни Дональд Трамп мав два головні занепокоєння щодо ударів по об’єктах іранської ядерної програми: щоб атака США була вирішальною для знищення добре укріплених об'єктів і щоб потенційні дії не втя... [2960 chars]","url":"https://www.pravda.com.ua/news/2025/06/22/7518245/","image":"https://img.pravda.com/images/doc/7/5/7518245_fb_image_ukr_2025_06_22_19_46_22.jpg","publishedAt":"2025-06-22T16:44:00Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Удар по полігону ЗСУ","description":"За попередньою інформацією, росіяни завдали удару по тренувальному полігону механізованої бригади Сухопутних військ ЗСУ ракетою \"Іскандер-М\".","content":"Ще за кілька хвилин до удару майже весь особовий склад був розосереджений і перебував в укриттях.\nЗа попередньою інформацією, російські окупанти завдали удару по тренувальному полігону механізованої бригади Сухопутних військ Збройних сил України раке... [1500 chars]","url":"https://www.unian.ua/war/udar-po-poligonu-zsu-u-suhoputnih-viyskah-rozkrili-detali-incidentu-13045926.html","image":"https://images.unian.net/photos/2025_06/thumb_files/1000_545_1750609329-7196.jpg?1","publishedAt":"2025-06-22T16:30:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"США закликали Китай відмовити Іран від закриття Ормузької протоки","description":"Державний секретар США Марко Рубіо в неділю закликав Китай переконати Іран не закривати Ормузьку протоку після того, як Вашингтон завдав ударів по іранських ядерних об'єктах.","content":"Державний секретар США Марко Рубіо в неділю закликав Китай переконати Іран не закривати Ормузьку протоку після того, як Вашингтон завдав ударів по іранських ядерних об'єктах.\nЗаяву Рубіо в ефірі Fox News наводить агентство Reuters, повідомляє \"Європе... [1245 chars]","url":"https://www.eurointegration.com.ua/news/2025/06/22/7214320/","image":"https://img.eurointegration.com.ua/images/doc/0/3/0351f0e-00--.jpg","publishedAt":"2025-06-22T15:41:56Z","source":{"name":"Європейська правда","url":"https://www.eurointegration.com.ua"}},{"title":"Міністр нац єдності Чернишов повернувся в Україну","description":"Олексій Чернишов повернувся з відрядження й пообіцяв розібрати по фактах кампанію дискредитації .","content":"Олексій Чернишов повернувся з відрядження й пообіцяв \"розібрати по фактах кампанію дискредитації\".\nВіцепрем’єр - міністр національної єдності Олексій Чернишов 22 червня заявив, що повернувся в Україну з відрядження. Про це він повідомив у Фейсбук.\nМі... [1297 chars]","url":"https://ua.korrespondent.net/ukraine/4792710-ministr-natsiednosti-chernyshov-povernuvsia-v-ukrainu","image":"https://kor.ill.in.ua/m/1260x900/4330711.jpg","publishedAt":"2025-06-22T15:18:00Z","source":{"name":"Korrespondent.net","url":"https://ua.korrespondent.net"}},{"title":"Скандал з Чернишовим - міністр повернувся в Україну - УНІАН","description":"Віцепрем'єр-міністр національної єдності Олексій Чернишов заявив, що повернувся в Україну. За його словами, поїздка за кордон була робочим відрядженням.","content":"Чернишов заявив, що це було робоче відрядження.\nВіцепрем'єр-міністр національної єдності Олексій Чернишов заявив, що повернувся в Україну. За його словами, поїздка за кордон була робочим відрядженням. Про це він повідомив на своїй сторінці у Facebook... [1503 chars]","url":"https://www.unian.ua/politics/skandal-z-chernishovim-ministr-povernuvsya-v-ukrajinu-13045884.html","image":"https://images.unian.net/photos/2025_06/thumb_files/1000_545_1750604820-7552.jpg?1","publishedAt":"2025-06-22T15:10:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Рубіо: США зробили світу велику послугу, бомбардуючи Іран","description":"Державний секретар США Марко Рубіо заявив, що Сполучені Штати зробили світу","content":"Державний секретар США Марко Рубіо заявив, що Сполучені Штати зробили світу \"велику послугу\", бомбардувавши іранські об’єкти ядерної програми.\nЯк пише \"Європейська правда\", про це він сказав в ефірі Fox News в неділю, його цитує Washington Post.\nРубі... [917 chars]","url":"https://www.eurointegration.com.ua/news/2025/06/22/7214319/","image":"https://img.eurointegration.com.ua/images/doc/6/3/6392e40-630-360-1741717898-2649.jpeg","publishedAt":"2025-06-22T15:08:53Z","source":{"name":"Європейська правда","url":"https://www.eurointegration.com.ua"}}]}