{"totalArticles":7128286,"articles":[{"title":"Антисмартфон метафон створили в США","description":"Дизайнери зі США створили антисмартфон. Його основна задача — допомогти боротися із залежністю від екранів.","content":"Американські дизайнери створили акрилову пластину, яка допомагає менше користуватись телефоном, і назвали її на честь метадону.\nПара американських розробників – дизайнер Ерік Антонов та інженер-художник Ґреґ Хохмут створили метафон. Це прозорий скуль... [2692 chars]","url":"https://zn.ua/ukr/TECHNOLOGIES/prozorij-telefon-antismartfon-shcho-likuje-tsifrovu-zalezhnist.html","image":"https://zn.ua/img/article/6447/66_main-v1750918272.webp","publishedAt":"2025-06-26T07:39:00Z","source":{"name":"Дзеркало тижня","url":"https://zn.ua"}},{"title":"Samsung випустив Smart Monitor M9 із QD-OLED дисплеєм на базі штучного інтелекту","description":"Флагманська модель M9 представляє технологію QD-OLED для розумних моніторів, оновлені моделі M8 і M7 пропонують інструменти пошуку на базі штучного інтелекту","content":"Продукти Samsung > ТВ та Аудіо\nФлагманська модель M9 представляє технологію QD-OLED для розумних моніторів, оновлені моделі M8 і M7 пропонують інструменти пошуку на базі штучного інтелекту\nКомпанія Samsung Electronics Co., Ltd сьогодні оголосила про ... [4300 chars]","url":"https://news.samsung.com/ua/samsung-releases-smart-monitor-m9-with-ai-powered-qd-oled-display","image":"https://img.global.news.samsung.com/ua/wp-content/uploads/2025/06/smart-monitors_main.png","publishedAt":"2025-06-26T07:16:07Z","source":{"name":"Samsung Newsroom","url":"https://news.samsung.com"}},{"title":"У Польщі проголосували за вихід з конвенції, яка забороняє протипіхотні міни","description":"Сейм Польщі ухвалив проголосував за законопроєкт про вихід із Оттавської конвенції, яка забороняє використання, виготовлення, накопичення й передачу протипіхотних мін.","content":"Сейм Польщі ухвалив проголосував за законопроєкт про вихід із Оттавської конвенції, яка забороняє використання, виготовлення, накопичення й передачу протипіхотних мін.\nДжерело: польський суспільний мовник RMF24, \"Європейська правда\"\nДеталі: За вихід ... [1199 chars]","url":"https://www.pravda.com.ua/news/2025/06/26/7518792/","image":"https://img.pravda.com/images/doc/7/5/7518792_fb_image_ukr_2025_06_26_10_16_01.jpg","publishedAt":"2025-06-26T06:36:42Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Трамп змінив ставлення до Зеленського та путіна \" Слово і Діло","description":"Президент США Дональд Трамп змінив риторику щодо Володимира Зеленського, назвавши його дуже приємною людиною після зустрічі на саміті НАТО, водночас висловивши розчарування російським лідером володимиром путіним.","content":"Президент США Дональд Трамп змінив риторику щодо президента України Володимира Зеленського, заявивши, що той є «дуже приємною людиною» після їхньої зустрічі на полях саміту НАТО. При цьому Трамп зайняв жорсткішу позицію щодо російського диктатора вол... [2232 chars]","url":"https://www.slovoidilo.ua/2025/06/26/novyna/polityka/tramp-zminyv-stavlennya-zelenskoho-ta-putina-pislya-samitu-nato-ft","image":"https://media.slovoidilo.ua/media/scimage/222/221586-uk.png","publishedAt":"2025-06-26T06:30:37Z","source":{"name":"Слово і Діло","url":"https://www.slovoidilo.ua"}},{"title":"Катерина Осадча кардинально змінила зачіску: її порівняли з Сінді Кроуфорд","description":"Катерина Осадча вкотре довела: стиль – це не лише про одяг, а й про впевненість у собі. Телеведуча опублікувала нову фотосесію, де постала у незвичному для себе образі.","content":"Катерина Осадча вкотре довела: стиль – це не лише про одяг, а й про впевненість у собі. Телеведуча опублікувала нову фотосесію, де постала у незвичному для себе образі. Розкішне об’ємне волосся, чоловічий костюм класичного крою та пронизливий погляд ... [1980 chars]","url":"https://www.obozrevatel.com/ukr/shou-oboz/ukrainska-sindi-krouford-katerina-osadcha-kardinalno-zminila-zachisku-i-vrazila-merezhu.htm","image":"https://i.obozrevatel.com/news/2025/6/26/503023651185094983830558037466912124610334097n.jpg?size=1200x630","publishedAt":"2025-06-26T06:30:00Z","source":{"name":"Obozrevatel","url":"https://www.obozrevatel.com"}},{"title":"Зеленський нагадав про Нюрнберзький трибунал та чекає на процес проти Путіна","description":"Президент України Володимир Зеленський закликав європейських політиків розбудувати","content":"Президент України Володимир Зеленський закликав європейських політиків розбудувати \"трибунал проти Путіна\", щоб його рішення стали історичним аналогом Нюрнберзького процесу.\nПро це він заявив у ніч проти четверга у Страсбурзі, після підписання угоди ... [2071 chars]","url":"https://www.eurointegration.com.ua/news/2025/06/26/7214618/","image":"https://img.eurointegration.com.ua/images/doc/9/e/9eb7744-3.jpg","publishedAt":"2025-06-26T06:10:27Z","source":{"name":"Європейська правда","url":"https://www.eurointegration.com.ua"}},{"title":"Аналіз ISW 26 червня","description":"Інститут вивчення війни показав нові карти зі змінами на фронті 26 червня 2025. Дізнайтеся про останні події війни в України з нового звіту ISW, зокрема на Донеччині й Харківщині. 24 Канал.","content":"Мовиться головно про Донецьку та Харківську області. ISW показав також карти усіх ділянок фронту, їх та основні висновки аналітиків зі США публікує 24 Канал.\nУ попередньому звіті Сили оборони провели вдалий рейд під Херсоном, окупанти просунулися на ... [2437 chars]","url":"https://24tv.ua/analiz-isw-26-chervnya-novi-karti-frontu-shho-zminilosya-za-dobu_n2855776","image":"https://24tv.ua/resources/photos/news/202506/2855776.jpg?v=1750903201000&w=1200&h=675","publishedAt":"2025-06-26T06:00:56Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Чому саміт НАТО перевершив усі очікування і дав надію Україні на членство","description":"Як ми вже повідомляли, головним результатом саміту НАТО у Гаазі став стислий (лише на п'ять пунктів) документ.","content":"Як ми вже повідомляли, головним результатом саміту НАТО у Гаазі став стислий (лише на п'ять пунктів) документ, сформований навколо рішення про різке зростання оборонних витрат з боку європейських держав та Канади. Все це відповідало очікуванням, які ... [3169 chars]","url":"https://www.eurointegration.com.ua/news/2025/06/26/7214617/","image":"https://img.eurointegration.com.ua/images/doc/d/e/de1f4ca-summit-1.jpg","publishedAt":"2025-06-26T06:00:48Z","source":{"name":"Європейська правда","url":"https://www.eurointegration.com.ua"}},{"title":"Insta360 випустила компактний бездротовий мікрофон, схожий за розміром на Apple AirTag","description":"Insta360 Mic Air кріпиться до одягу затискачем або магнітом, або ж вішається на шнурок. Він має кнопки для керування шумозаглушенням, записом і вимкненням мікрофона.","content":"Geek, програміст за спеціальністю, але журналіст за професією. Вершник, тенісист та фанат Формули-1. Пишу про технології, смартфони та електромобілі.\nКомпанія Insta360, яка відома завдяки своїм екшн-камерам серії Ace Pro, представила новий бездротови... [1135 chars]","url":"https://mezha.media/news/insta360-vipustila-kompaktniy-bezdrotoviy-mikrofon-302943/","image":"https://img.mezha.media/mezhaprod/images/doc/8/6/268940/86605b5e51b767533470f677fa5a9be0.jpeg","publishedAt":"2025-06-26T06:00:00Z","source":{"name":"Mezha.Media","url":"https://mezha.media"}},{"title":"Peugeot 5008 дебютував в Україні: характеристики, вартість, комплектації","description":"Новий трирядний Peugeot 5008 вже доступний в Україні: ціна, характеристики, потужність, дизайн - Авто24","content":"Трирядний Peugeot 5008 має практичний дизайн, що ідентичний його меншому брату Peugeot 3008. Попри це новинка має подовжений кузов та майже вертикальну кришку багажника. Передня частина має традиційні “кігті лева” – характерні ДХВ у вигляді смужок, щ... [2510 chars]","url":"https://auto.24tv.ua/rynok_tryriadnykh_krosoveriv_v_ukraini_popovnyvsia_novym_peugeot_5008_n64017","image":"https://auto.24tv.ua/resources/photos/news/202506/64017574e2f59-823c-419e-8e7e-e2c191f2c60d.jpg","publishedAt":"2025-06-26T05:40:00Z","source":{"name":"24 Канал","url":"https://auto.24tv.ua"}}]}