{"totalArticles":7000916,"articles":[{"title":"Trump admin fully backs US-Japan-PH trilateral arrangements -officials","description":"PEARL HARBOR, Hawaii — In Hawaii’s Pearl Harbor, remnants of destroyed U.S. warships, aircraft, a submarine and proud tributes to the more than 2,400 Americans, who perished in the devastating blitzkrieg attack by Japan’s imperial forces in World War II are memorialized to underscore the need for international vigilance for peace.","content":"\"We will never forget:\" A marker in the Pearl Harbor Memorial in Oahu Island, Hawaii showing the recovered steel anchor of USS Arizona pays tribute to the thousands of Americans who were killed in the Dec. 7, 1941 blitzkrieg attack by Japanese imperi... [6621 chars]","url":"https://www.gmanetwork.com/news/topstories/nation/949533/trump-admin-fully-backs-us-japan-ph-trilateral-arrangements-officials/story/","image":"https://images.gmanews.tv/webpics/2025/06/fbb8cde3-427a-4463-9910-3b73bf0090e7_2025_06_16_13_13_17.jpg","publishedAt":"2025-06-16T05:35:46Z","source":{"name":"GMA Network","url":"https://www.gmanetwork.com"}},{"title":"The Australian government has launched a new strategy to boost vaccination rates. Will it work?","description":"Amid declining vaccination rates in Australia, a new strategy seeks to reduce vaccine hesitancy and improve access to immunisations.","content":"Last week, the Australian government announced a new National Immunisation Strategy for 2025–30. This strategy sets out the government’s priorities for improving vaccine uptake for children, adolescents and adults over the next five years.\nIt comes a... [5507 chars]","url":"https://theconversation.com/the-australian-government-has-launched-a-new-strategy-to-boost-vaccination-rates-will-it-work-258808","image":"https://images.theconversation.com/files/674395/original/file-20250616-56-yyssdi.jpg?ixlib=rb-4.1.0&rect=0%2C549%2C7529%2C3764&q=45&auto=format&w=1356&h=668&fit=crop","publishedAt":"2025-06-16T05:32:26Z","source":{"name":"The Conversation","url":"https://theconversation.com"}},{"title":"Keeping the craft alive: Meet the man making bespoke leather goods in his spare time","description":"At his Midleton workshop, Radu Sighencea is reviving the tradition of leather artisanship. He tells CHRIS DUNNE how working with leather is like ...","content":"Once upon a time, saddlers, cobblers, tanners, and leather artisans were a fixture of daily life across every town and village in Ireland.\nNow, a few people are keeping the flame of those crafts alive in Cork, and one of them is Radu Sighencea.\nAlso ... [7110 chars]","url":"https://www.echolive.ie/corklives/arid-41651210.html","image":"https://www.echolive.ie/cms_media/module_img/9325/4662914_3_seoimageog_Copy_20of_20Radu_20Main_20Image_20-_20Cover_20image_1_.jpg","publishedAt":"2025-06-16T05:30:00Z","source":{"name":"echo live","url":"https://www.echolive.ie"}},{"title":"Enzyme Catalysis Revealed: Carbonic Anhydrase II Filmed","description":"Abstract Water plays an essential role in enzyme structure, stability, and the substantial rate enhancement of enzyme catalysis. However, direct","content":"A team of researchers, led by Professor Chae Un Kim from the Department of Physics at UNIST, has successfully tracked the catalytic pathway of Carbonic Anhydrase II (CAII), an enzyme that converts carbon dioxide (CO2) into bicarbonate. This achieveme... [2793 chars]","url":"https://www.miragenews.com/enzyme-catalysis-revealed-carbonic-anhydrase-ii-1478444/","image":"https://cdn1.miragenews.com/wp-content/uploads/2017/11/news-developments.jpg","publishedAt":"2025-06-16T05:30:00Z","source":{"name":"Mirage News","url":"https://www.miragenews.com"}},{"title":"Post deleted! Kuldeep Yadav shares photos with fiancée Vanshika, later removes it","description":"Cricket News: Kuldeep Yadav briefly posted a photo with fiancée Vanshika after their June 4 engagement in Lucknow, only to delete it soon after. While fans speculat","content":"Kuldeep Yadav shared a couple of photos with his fiancée Vanshika on Instagram but deleted it immediately.\nKuldeep Yadav hints at spin-friendly wicket ahead of England Test series\nIndian cricketer Kuldeep Yadav , who recently got engaged to his child... [1194 chars]","url":"https://timesofindia.indiatimes.com/sports/cricket/news/post-deleted-kuldeep-yadav-shares-photos-with-fiance-vanshika-later-removes-it/articleshow/121875251.cms","image":"https://static.toiimg.com/thumb/msid-121875369,width-1070,height-580,imgsize-82966,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2025-06-16T05:18:00Z","source":{"name":"Times of India","url":"https://timesofindia.indiatimes.com"}},{"title":"Examining how Bitcoin’s investors are holding up despite global FUD and panic","description":"Sentiment across the market is one of uncertainty, which tends to flip crypto bearish. However, Bitcoin has remained standing above $102k...","content":"Bitcoin fell below $106k, making its short-term bias bearish\nOn-chain metrics highlighted a lack of massive sell-offs, which meant investors were comfortable holding on\nBitcoin [BTC] fell below the fair value gap at $106.5k – A sign that its short-te... [2337 chars]","url":"https://ambcrypto.com/examining-how-bitcoins-investors-are-holding-up-despite-global-fud-and-panic/","image":"https://ambcrypto.com/wp-content/uploads/2025/06/Bitcoin-Featured-4-1000x600.webp","publishedAt":"2025-06-16T05:03:45Z","source":{"name":"AMBCrypto","url":"https://ambcrypto.com"}},{"title":"The Sky Today on Monday, June 16: Mars and Regulus shine together","description":"The Red Planet stands less than a degree from Leo the Lion’s brightest star in the evening sky tonight, visible in the west.","content":"The Red Planet stands less than a degree from Leo the Lion’s brightest star in the evening sky tonight.\nMars and Regulus stand within a degree of each other in Leo the Lion on the evening of June 16. Credit: Stellarium\nMars will pass 0.8° north of Re... [1184 chars]","url":"https://www.astronomy.com/observing/the-sky-today-monday-june-16-2025/","image":"https://www.astronomy.com/uploads/2025/06/June162025.png","publishedAt":"2025-06-16T05:03:45Z","source":{"name":"Astronomy Magazine","url":"https://www.astronomy.com"}},{"title":"Assistance hotline opened for Iloilo OFWs amid Israel-Iran conflict","description":"ILOILO CITY – The provincial government of Iloilo has opened \"Operation Bulig,\" a 24/7 hotline for Ilonggo overseas Filipino workers (OFW) and their families who are in need of assistance in light of the ongoing Israel-Iran conflict. \"Since the start of the crisis, we are coordinating with our…","content":"HOTLINE. The \"Operation Bulig Ilonggo\" of the provincial government in Iloilo is open 24 hours to receive any call for assistance from Ilonggo overseas Filipino workers (OFW) and their families in light of the ongoing Israel-Iran conflict. During the... [1704 chars]","url":"https://www.pna.gov.ph/articles/1252220","image":"https://files01.pna.gov.ph/ograph/2025/06/16/hotline.png","publishedAt":"2025-06-16T05:00:10Z","source":{"name":"Philippine News Agency","url":"https://www.pna.gov.ph"}},{"title":"HONOR 400 5G turns timeless moments into living love stories","description":"Honor takes a romantic walk down memory lane as it gives us a sneak peek at the HONOR 400 5G.Held at the heritage-inspired Las Casas Filipinas de Azucar in...","content":"Honor takes a romantic walk down memory lane as it gives us a sneak peek at the HONOR 400 5G.\nHeld at the heritage-inspired Las Casas Filipinas de Azucar in Quezon City, HONOR Philippines seamlessly blended AI-powered photography with a deep sense of... [1575 chars]","url":"https://mb.com.ph/2025/06/16/honor-400-5g-turns-timeless-moments-into-living-love-stories","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/16/19702.webp","publishedAt":"2025-06-16T04:56:36Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"iOS 26 Release Date, Full List Of Supported Devices, Requirements, New Features, How To Download And Install In Your iPhone","description":"For those eager to try it early, Apple is offering access to iOS 26 through its Beta Software Program, available via the official Apple website. Just be sure to back up your device before installing any beta version to avoid data loss., Technology & Science News - Times Now","content":"iOS 26 is expected to be officially released in mid-September 2025.\nApple recently announced the newest version of iOS -- iOS 26 -- for iPhones at the Worldwide Developers Conference 2025 (WWDC) on June 9 with the first new major design change since ... [3219 chars]","url":"https://www.timesnownews.com/technology-science/ios-26-release-date-full-list-of-supported-devices-requirements-new-features-how-to-download-and-install-in-your-iphone-article-151996596","image":"https://images.timesnownews.com/thumb/msid-151996601,thumbsize-963808,width-1280,height-720,resizemode-75/151996601.jpg","publishedAt":"2025-06-16T04:45:00Z","source":{"name":"Times Now","url":"https://www.timesnownews.com"}}]}