{"information":{"realTimeArticles":{"message":"Real-time news data is only available on paid plans. Free plan has a 12-hour delay. Upgrade your plan here to remove the delay: https://gnews.io/change-plan"}},"totalArticles":199038,"articles":[{"id":"a7bb942c358569e6f6d97ac6013c73b4","title":"\"єЯсла\" в Україні: хто з батьків може отримувати 8 тисяч щомісяця і на що витрачати","description":"Від початку 2026 року в Україні стартувала державна програма підтримки батьків, які працюють, під назвою \"єЯсла\". Йдеться про щомісячну цільову грошов...","content":"Що змінилось в Україні з 1 січня\nУ МОН нагадали, що з 1 січня 2026 року в Україні набрав чинності закон, спрямований на:\nпосилення підтримки сімей з дітьми;\nстворення умов для поєднання батьківства з професійною діяльністю.\nУ межах реалізації цього з... [2943 chars]","url":"https://www.rbc.ua/rus/news/eyasla-ukrayini-hto-batkiv-mozhe-otrimuvati-1768412648.html","image":"https://www.rbc.ua/static/img/_/m/_mama_z_dvoma_ditkami_na_kilimku_proholodno_kubiki_bashnya_profil_gra_gettyimages_1366789204_2f7ed8da069c029b01829286a4eac60f_1300x820.jpg","publishedAt":"2026-01-15T05:30:00Z","lang":"uk","source":{"id":"6f1ead09126f1f4738a48957e22f789c","name":"РБК-Україна","url":"https://www.rbc.ua"}},{"id":"72fb168586ca8a544cc5b6d3fae8be98","title":"ЗМІ: Каллас сказала євродепутатам, що зараз \"хороший момент\", щоб почати пити","description":"Глава дипломатії ЄС Кая Каллас у розмові з лідерами політичних груп у Європейському парламенті сказала, що, враховуючи поточну ситуацію у світі, зараз може бути","content":"Глава дипломатії ЄС Кая Каллас у розмові з лідерами політичних груп у Європейському парламенті сказала, що, враховуючи поточну ситуацію у світі, зараз може бути \"хороший момент\" для того, щоб почати пити.\nПро це Politico розповіли особи, які були при... [833 chars]","url":"https://www.eurointegration.com.ua/news/2026/01/15/7229095/","image":"https://img.eurointegration.com.ua/images/doc/7/1/715535b-g-qcjhkx0aaj93n.jpg","publishedAt":"2026-01-15T05:25:36Z","lang":"uk","source":{"id":"92907bbd0364e9333834133beac47de2","name":"Європейська правда","url":"https://www.eurointegration.com.ua"}},{"id":"71688f467790c29207db4b5481446e6d","title":"Не Duster і не Logan: новий бюджетник Dacia показали вперше. Фото","description":"Dacia працює над черговим бюджетним автомобілем. Це не кросовер Duster або седан Logan, про чергову модернізацію яких можна подумати. Виробник готує принципово новий для себе автомобіль. Dacia Його показали вперше до прем'єри.","content":"Dacia працює над черговим бюджетним автомобілем. Це не кросовер Duster або седан Logan, про чергову модернізацію яких можна подумати. Виробник готує принципово новий для себе автомобіль.\nВідео дня\nЙого показали вперше до прем'єри. Як стало відомо Car... [788 chars]","url":"https://www.obozrevatel.com/ukr/avto-oboz/ne-duster-i-ne-logan-novij-byudzhetnik-dacia-pokazali-vpershe-foto.htm","image":"https://i.obozrevatel.com/news/2026/1/15/2027-dacia.jpg?size=1200x630","publishedAt":"2026-01-15T05:15:00Z","lang":"uk","source":{"id":"ca149ffefb31c86f82d7f299d744af59","name":"Obozrevatel","url":"https://www.obozrevatel.com"}},{"id":"d50f1d5d5ab13b78237922c6c69c139b","title":"Огляд ігрової гарнітури Razer BlackShark V3: геймерська класика без зайвого пафосу","description":"Razer BlackShark V3 — бездротова ігрова гарнітура, яка займає проміжне місце між базовими","content":"Razer BlackShark V3 — бездротова ігрова гарнітура, яка займає проміжне місце між базовими моделями серії та дорожчими Pro-версіями. Тут немає студійних амбіцій чи кіберспортивного максималізму, зате є підтримка 2,4 ГГц і Bluetooth, знімний мікрофон H... [14176 chars]","url":"https://itc.ua/ua/articles/oglyad-igrovoyi-garnitury-razer-blackshark-v3-gejmerska-klasyka-bez-zajvogo-pafosu/","image":"https://itc.ua/wp-content/uploads/2026/01/IMG_9228-835x470.jpg","publishedAt":"2026-01-15T05:00:10Z","lang":"uk","source":{"id":"391d17d071b755a4bda37c1b43f47c2c","name":"ITC.ua","url":"https://itc.ua"}},{"id":"884ac473c241f91a28678a86ebd2c033","title":"Коли в Україні послабнуть морози? Гідрометцентр пояснив, де стоїть \"блок\"","description":"Сильні морози в Україні понад 20 градусів зберігатимуться щонайменше до початку третьої декади січня. Причина в блокуючому антициклоні з півночі. Тепло буде лише на Закарпатті та на півдні, розповіла синоптикиня Наталія Птуха.","content":"У ситуації масованих обстрілів країни-агресора Росії по енергетичній інфраструктурі нашої країни, які збіглися із суттєвим похолоданням, прогноз погоди в Україні набуває особливого значення. Які атмосферні фронти \"воюють\" над країною? Чи можна очікув... [4949 chars]","url":"https://www.obozrevatel.com/ukr/novosti-obschestvo/koli-v-ukraini-poslabnut-morozi-gidromettsentr-poyasniv-de-stoit-blok.htm","image":"https://i.obozrevatel.com/news/2026/1/14/gettyimages-2255517274.jpg?size=1200x630","publishedAt":"2026-01-15T05:00:00Z","lang":"uk","source":{"id":"ca149ffefb31c86f82d7f299d744af59","name":"Obozrevatel","url":"https://www.obozrevatel.com"}},{"id":"02d7781cbca7aea71a2605fa717a69b5","title":"Морози затягуються. Якою буде погода в Україні сьогодні","description":"В Україні зберігається зимова погода з сильними морозами. Найближчими днями холодна повітряна маса утримуватиме низькі температури майже по всій терит...","content":"Температура повітря\nУ ніч на 15 січня температура в Україні опуститься до -18 градусів, а в північних областях місцями очікується до -20 градусів.\nУдень у більшості регіонів прогнозують від -4 до -9 градусів, на півночі - від -9 до -14 градусів.\nУ за... [589 chars]","url":"https://www.rbc.ua/rus/news/morozi-zatyaguyutsya-koyu-bude-pogoda-ukrayini-1768398875.html","image":"https://www.rbc.ua/static/img/_/z/_zima_snig_ditina_zhinka_sobaka_pes_vigul_sobak__gettyimages_2251897040_89927a9e1ad165bb83e116da5b173773_1300x820.jpg","publishedAt":"2026-01-15T05:00:00Z","lang":"uk","source":{"id":"6f1ead09126f1f4738a48957e22f789c","name":"РБК-Україна","url":"https://www.rbc.ua"}},{"id":"02a7f2e11b629741f01c80db6f803877","title":"Світ напередодні шторму","description":"Отже, після першого успіху у Венесуелі Дональд Трамп планує залучити 100 млрд доларів інвестицій у цю країну, щоб відновити експорт важкої нафти для заводів США в Мексиканській затоці. Історично ці заводи залежали від нафти з Венесуели, утім, як і індійські, і зараз там голод через сировину. Саме тому, до речі, і виник конфлікт з Канадою: Трамп намагався продавити дешеву важку нафту, але там специфічне очищення: такі сорти потрібно постійно тримати підігрітими — ця технологія доступна не скрізь на планеті. Венесуела від співпраці зі США відмовилася і через санкції намагалася співпрацювати з РФ і Китаєм, але тепер, коли Мадуро вивели з гри, вибір зроблено і США беруть нафтовий ресурс країни під контроль як стратегічний резерв у разі великої війни.","content":"Швидше за все, США усвідомлюють, що майбутній конфлікт з Китаєм неминучий. Три з п'яти договорів про спільну оборону США — це Азіатсько-Тихоокеанський регіон. Незалежно від того, буде це атака на Тайвань чи конфлікт за ресурси для Китаю, зіткнення не... [5013 chars]","url":"https://lb.ua/world/2026/01/15/716743_svit_naperedodni_shtormu.html","image":"https://i.lb.ua/062/43/69678ab9c927f.jpeg","publishedAt":"2026-01-15T05:00:00Z","lang":"uk","source":{"id":"a5f7d2df13d19258a781aca9a6fdd5f0","name":"LB.ua","url":"https://lb.ua"}},{"id":"269d5ef943b5858d9ea513e6a4f0bb66","title":"Заяви Зеленського \"нівелюють працю тисяч людей\" - Кличко","description":"Мер Києва Віталій Кличко різко відповів на критику президента Зеленського щодо дій столичної влади під час енергетичної кризи після масованих російських ударів, наголосивши на самовідданій роботі тисяч фахівців та найскладнішій ситуації за роки війни","content":"Міський голова Києва Віталій Кличко різко відреагував на звинувачення президента України Володимира Зеленського в недостатності зусиль столичної влади на тлі енергетичного колапсу – після серії комбінованих російських ударів, які завдали критичних уш... [2386 chars]","url":"https://www.radiosvoboda.org/a/news-klychko-zajavy-zelenskoho-energetychnyj-kolaps/33648572.html","image":"https://gdb.rferl.org/01000000-0aff-0242-f9e6-08db0e66a521_w1200_h630.jpg","publishedAt":"2026-01-15T04:57:00Z","lang":"uk","source":{"id":"5c9ced304d672fe93c822292939bf821","name":"Радіо Свобода","url":"https://www.radiosvoboda.org"}},{"id":"c38405182e608b4f6dc1a0e278074642","title":"Втрати РФ в Україні - скільки окупантів і техніки знищено - дані Генштабу ЗСУ","description":"Протягом доби 14 січня українські захисники ліквідували та поранили ще 1150 російських окупантів. Крім того, на полі бою було знищено десятки одиниць різної ворожої техніки.","content":"Протягом доби 14 січня українські захисники ліквідували та поранили ще 1150 російських окупантів. Крім того, на полі бою було знищено десятки одиниць різної ворожої техніки.\nВід початку повномасштабної війни загальні втрати ворога склали вже 1 223 09... [953 chars]","url":"https://war.obozrevatel.com/ukr/zsu-vidminusuvali-sche-okupantiv-u-genshtabi-ozvuchili-novi-dani-pro-vtrati-voroga42.htm","image":"https://i.obozrevatel.com/news/2024/7/9/snimok-ekrana-2024-07-09-122935.png?size=1200x630","publishedAt":"2026-01-15T04:45:00Z","lang":"uk","source":{"id":"aef3ac5a8f974c851211d386dd6a52b0","name":"Obozrevatel","url":"https://war.obozrevatel.com"}},{"id":"93eef2a542ee635a861f8f4ab02f9e14","title":"Борис Барський з Маски-шоу","description":"Борис Барський - комік, найбільше відомий з Маски-шоу. Що про нього відомо, біографія та успіх, особисте життя і втрата сина, позиція щодо Росії і мови - Show24","content":"Борис Барський народився і навчався в Одесі. Він здобув вищу освіту в Одеському політехнічному інституті за спеціальністю фізика-ядерника. Але паралельно відвідував студію пантоміми й зрозумів, що комфортніше почувається на сцені. Як розвивалась кар'... [3702 chars]","url":"https://24tv.ua/show24/boris-barskiy-maski-shou-de-zaraz-gumorist-biografiya-osobiste_n2989277","image":"https://24tv.ua/resources/photos/news/202601/2989277.jpg?v=1768434665000&w=1200&h=675","publishedAt":"2026-01-15T04:30:00Z","lang":"uk","source":{"id":"e737a8e76b161ef4526698e2ec5f60c9","name":"24 Канал","url":"https://24tv.ua"}}]}