{"totalArticles":6914918,"articles":[{"title":"Історична подія: телескоп Джеймса Вебба вперше зняв \"Сатурн\" за межами Сонячної системи - фото","description":"Космічний телескоп Джеймса Вебба, здійснив прорив в астрономії, зробивши перші прямі зображення екзопланети з масою, близькою до Сатурна. Розповідаємо деталі.","content":"The Guardian пише, що космічний телескоп Джеймса Вебба здійснив прорив в астрономії, зробивши перші прямі зображення екзопланети з масою, близькою до Сатурна. Розповідаємо деталі.\nЩо сталося\nКосмічний телескоп Джеймса Вебба, що працює на орбіті з 202... [678 chars]","url":"https://vctr.media/ua/istorychne-sposterezhennya-teleskop-dzhejmsa-vebba-napryamu-znyav-saturn-za-mezhamy-sonyachnoyi-systemy-279194/","image":"https://vctr.media/wp-content/uploads/2025/06/vctr.media-1751027449.png","publishedAt":"2025-06-27T13:24:00Z","source":{"name":"vctr.media","url":"https://vctr.media"}},{"title":"Орбан напосівся на керівництво ЄС, заявивши що Україну \"дурять, обіцяючи неможливе\"","description":"Угорський прем’єр Віктор Орбан звинуватив керівництво Європейського союзу у неможливих обіцянках Україні у зв’язку з її прагненням вступити до ЄС.","content":"Угорський прем’єр Віктор Орбан звинуватив керівництво Європейського союзу у \"неможливих обіцянках\" Україні у зв’язку з її прагненням вступити до ЄС.\nДжерело: \"Європейська правда\" з посиланням на 444.hu\nДеталі: Орбан вкотре повторив свої аргументи про... [1041 chars]","url":"https://www.pravda.com.ua/news/2025/06/27/7519078/","image":"https://img.pravda.com/images/doc/7/5/7519078_fb_image_ukr_2025_06_27_16_20_08.jpg","publishedAt":"2025-06-27T12:42:18Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"НАБУ та САП просять відсторонити віцепрем'єра Чернишова з посади","description":"НАБУ і САП звернулися до ВАКС з клопотанням про відсторонення чинного віце-прем’єр-міністра України від посади, деталі читайте на 24 Каналі.","content":"НАБУ та САП також просять ВАКС відсторонити Чернишова від посади. Про це пише 24 Канал з посиланням на САП і НАБУ.\nДивіться також ВАКС обиратиме запобіжний захід Чернишову: чи йдеться про тримання під вартою\nНАБУ та САП просять відсторонити Чернишова... [1376 chars]","url":"https://24tv.ua/nabu-sap-prosyat-vidstoroniti-vitsepremyera-chernishova-posadi_n2856796","image":"https://24tv.ua/resources/photos/news/202506/2856796.jpg?v=1751002916000&w=1200&h=675","publishedAt":"2025-06-27T12:10:29Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Відсутність світла - Росія нанесла удар по важливому енергооб'єкту - УНІАН","description":"Російські окупанти вдарили по важливому енергооб'єкту на Херсонщині. Це сталося напередодні Дня Конституції. Відсутність світла може бути тривалою.","content":"Через атаку є проблеми з електропостачанням у низці населених пунктів.\nМешканці Херсонщини мають підготуватися до тривалої відсутності світла, заявив очільник обласної військової адміністрації Олександр Прокудін.\n\"Напередодні Дня Конституції росіяни ... [1084 chars]","url":"https://www.unian.ua/economics/energetics/vidsutnist-svitla-rosiya-nanesla-udar-po-vazhlivomu-energoob-yektu-13050774.html","image":"https://images.unian.net/photos/2025_06/thumb_files/620_324_1751025898-8026.jpg?1","publishedAt":"2025-06-27T12:09:45Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Windows відмовляється від культового \"синього екрана смерті\" на користь чорного","description":"Один із найвідоміших символів Windows, «синій екран смерті» (BSOD), невдовзі зникне. Microsoft оновлює механізм повідомлення про збої в Windows 11: замість синього фону з сумним смайликом користувачі бачитимуть чорний екран із мінімалістичним текстом. Рішення має спростити діагностику проблем і","content":"Один із найвідоміших символів Windows, «синій екран смерті» (BSOD), невдовзі зникне. Microsoft оновлює механізм повідомлення про збої в Windows 11: замість синього фону з сумним смайликом користувачі бачитимуть чорний екран із мінімалістичним текстом... [2177 chars]","url":"https://dev.ua/news/windows-vidmovliaietsia-vid-kultovoho-synoho-ekranu-smerti-na-koryst-chornoho-1751025883","image":"https://dev.ua/storage/images/24/37/17/35/derived/1c35a971f451741a5a97ba1ecd07e980.jpg","publishedAt":"2025-06-27T12:09:00Z","source":{"name":"dev.ua","url":"https://dev.ua"}},{"title":"Росія вдарила по енергетичному об'єкту на Херсонщині","description":"27 червня росіяни атакували енергетичний об'єкт на Херсонщині. У частині області зафіксовані перебої з електропостачанням. Що відомо - 24 Канал","content":"Вдень 27 червня голова Херсонської обласної державної адміністрації Олександр Прокудін повідомив, що противник вирішив занурити Херсонщину у темряву, атакувавши важливий енергетичний об'єкт, передає 24 Канал.\nДивіться також Цинічний удар Росії по Сам... [1368 chars]","url":"https://24tv.ua/rosiya-vdarila-po-energetichnomu-obyektu-hersonshhini-yaki-naslidki_n2857193","image":"https://24tv.ua/resources/photos/news/202506/2857193.jpg?v=1751024862000&w=1200&h=675","publishedAt":"2025-06-27T11:48:13Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Співачка KOLA вперше показала фото з весілля і чоловіка, якого ретельно приховує","description":"Українська співачка KOLA (справжнє ім'я - Анастасія Прудіус) уперше показала фото з весілля і свого чоловіка, обличчя якого ретельно приховує.","content":"Відомо, що у її обранця є двоє синів від першого шлюбу.\nУкраїнська співачка KOLA (справжнє ім'я - Анастасія Прудіус) уперше показала фото з весілля і свого чоловіка, якого ретельно приховує.\nЗ нагоди річниці урочистої події виконавиця опублікувала в ... [985 chars]","url":"https://www.unian.ua/lite/stars/spivachka-kola-vpershe-pokazala-foto-z-vesillya-i-cholovika-yakogo-retelno-prihovuye-13050738.html","image":"https://images.unian.net/photos/2025_06/thumb_files/1000_545_1751023595-5879.jpg?1","publishedAt":"2025-06-27T11:41:32Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Камалія розповіла про аліменти та чи підписувала шлюбний контракт із Захуром","description":"Камалія запевнила, що Захур платить невеликі аліменти, та наголосила на важливості шлюбного контракту. А ще розповіла, чи намагалася врятувати шлюб","content":"Співачка Камалія продовжує розповідати про причини свого розлучення із Захуром та ділитися раніше не озвученими деталями.\nВ інтерв'ю ТСН 48-річна артистка розказала про аліменти від екса, чи був у них шлюбний контракт та про інші цікаві подробиці роз... [3884 chars]","url":"https://tabloid.pravda.com.ua/person/zhinka-maye-buti-zahishchenoyu-kamaliya-pro-alimenti-vid-zahura-vazhlivist-shlyubnogo-kontraktu-ta-chi-namagalisya-voni-vryatuvati-shlyub-2010678/","image":"https://tabloid.pravda.com.ua/images/tabloid_img/favicon.ico","publishedAt":"2025-06-27T11:30:00Z","source":{"name":"tabloid.pravda.com.ua","url":"https://tabloid.pravda.com.ua"}},{"title":"Сирський заявив про зачистку Покровського напрямку від диверсійно-штурмових груп РФ","description":"Головнокомандувач ЗСУ Олександр Сирський заявив про знешкодження російських диверсійно-штурмових груп, які намагались просунутись на Покровському напрямку протягом двох тижнів, наразі ситуація під контролем.","content":"Головнокомандувач ЗСУ Олександр Сирський заявив про знешкодження російських диверсійно-штурмових груп, які намагались просунутись на Покровському напрямку протягом двох тижнів, наразі ситуація під контролем.\nДжерело: Сирський у Telegram\nПряма мова Си... [1363 chars]","url":"https://www.pravda.com.ua/news/2025/06/27/7519055/","image":"https://img.pravda.com/images/doc/7/5/7519055_fb_image_ukr_2025_06_27_15_00_00.jpg","publishedAt":"2025-06-27T11:24:17Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Єврокомісія підтримує відкриття першого переговорного кластера щодо вступу України до ЄС - фон дер Ляєн","description":"Україна під постійними обстрілами продовжує втілювати реформи, тому Єврокомісія підтримує відкриття першого переговорного кластера про вступ нашої держави до Європейського Союзу. — Укрінформ.","content":"«Україна під постійними обстрілами втілює реформу за реформою, що справляє величезне враження. Тому Єврокомісія підтримує відкриття першого переговорного кластера. Україна виконала свої зобов’язання, і зараз ми маємо зробити те саме. Процес інтеграці... [2950 chars]","url":"https://www.ukrinform.ua/rubric-polytics/4008972-evrokomisia-pidtrimue-vidkritta-persogo-peregovornogo-klastera-sodo-vstupu-ukraini-do-es-fon-der-laen.html","image":"https://static.ukrinform.com/photos/2024_10/thumb_files/630_360_1729249928-978.jpg","publishedAt":"2025-06-27T11:19:00Z","source":{"name":"Укрінформ","url":"https://www.ukrinform.ua"}}]}