{"totalArticles":125602,"articles":[{"title":"Apple здалася і готова замінити свій ШІ на ChatGPT в iPhone, щоб \"врятувати\" Siri","description":"Компанія тестує моделі OpenAI і Anthropic для своєї оновленої версії голосового помічника. Це може бути як постійним, так і тимчасовим рішенням,","content":"Apple після провалу Apple Intelligenc може перевести Siri на технології OpenAI або Anthropic.\nСхоже, що Apple визнала свою поразку на ринку ШІ-асистентів. У всякому разі, на це натякає бажання Купертіно \"прокачати\" Siri за допомогою стороннього ШІ. З... [1357 chars]","url":"https://www.unian.ua/techno/neiroseti/rozumna-siri-apple-zdalasya-i-gotova-zaminiti-sviy-shi-na-chatgpt-v-ayfonah-13054599.html","image":"https://images.unian.net/photos/2025_07/thumb_files/1000_545_1751370476-3594.jpg?1","publishedAt":"2025-07-01T12:32:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Син Бекхема повеселився з тестем після сварки з батьками - фото","description":"Старший син Девіда й Вікторії Бекхемів, Бруклін і його дружина привітали її батька, мільярдера Нельсона Пельтца з 83-річчям. Родина зібралася для святкування на тлі конфлікту Бекхемів","content":"Старший син Девіда й Вікторії Бекхемів, 26-річний Бруклін у компанії дружини, 30-річної моделі й акторки Ніколи Пельтц відвідав вечірку з нагоди дня народження її батька, мільярдера Нельсона Пельтца, якого раніше особисто привітав.\nУ своєму Instagram... [1330 chars]","url":"https://tabloid.pravda.com.ua/lounge/sin-bekhema-poveselivsya-z-testem-pislya-svarki-z-batkami-foto-2010739/","image":"https://imgnewtabl.pravda.com.ua/tabloid/images/doc/6/a/213875/6a04b460b4d3e36d4612c3c67dd70e75.jpeg","publishedAt":"2025-07-01T12:15:00Z","source":{"name":"ТаблоID","url":"https://tabloid.pravda.com.ua"}},{"title":"Класико між Динамо та Шахтарем відбудеться за 4 тури до кінця сезону","description":"Центральні матчі чемпіонату відбудуться 1 листопада 2025 та 2 травня 2026 ⋆ Футбол на Sport.ua","content":"Українська Прем'єр-ліга оприлюднила календар матчів сезону 2025/26.\nУ ньому визначено дати проведення двох головних поєдинків чемпіонату – українського Класіко між Динамо та Шахтарем.\nПерше протистояння двох грандів відбудеться в 11 турі, дата – 1 ли... [452 chars]","url":"https://sport.ua/uk/news/774848-klasiko-mizh-dinamo-ta-shahtarem-vidbudetsya-za-4-turi-do-kintsya-sezonu","image":"https://pic.sport.ua/images/news/0/19/74/og_uk_774848.jpg","publishedAt":"2025-07-01T12:14:00Z","source":{"name":"Sport.ua","url":"https://sport.ua"}},{"title":"У Львівській ОВА відреагували на розслідування про виїзд чоловіків за листами з підписом імператора","description":"Львівська обласна військова адміністрація прокоментувала розслідування журналістів NGL.media, які встановили, що у 2022 році ОВА дозволяла виїзд чоловіків за кордон за листами від неіснуючої організації з підписом російського імператора Олександра ІІІ.","content":"Львівська обласна військова адміністрація прокоментувала розслідування журналістів NGL.media, які встановили, що у 2022 році ОВА дозволяла виїзд чоловіків за кордон за листами від неіснуючої організації з підписом російського імператора Олександра ІІ... [1741 chars]","url":"https://www.pravda.com.ua/news/2025/07/1/7519664/","image":"https://img.pravda.com/images/doc/7/5/7519664_fb_image_ukr_2025_07_01_15_46_49.jpg","publishedAt":"2025-07-01T12:12:46Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"В Азербайджані - вже сім затриманих у рамках розслідування щодо агентства Sputnik","description":"В Азербайджані затримали вже сімох осіб в ході оперативно-розшукових заходів у Бакинській філії російського пропагандистського агентства","content":"В Азербайджані затримали вже сімох осіб в ході оперативно-розшукових заходів у Бакинській філії російського пропагандистського агентства \"Россия сегодня\" (\"Sputnik Азербайджан\").\nПро це повідомляє \"Європейська правда\" з посиланням на APA.\nКрім того, ... [905 chars]","url":"https://www.eurointegration.com.ua/news/2025/07/1/7214969/","image":"https://img.eurointegration.com.ua/images/doc/a/5/a5de97c-68629988dee0b68629988dee0c175129229668629988dee0968629988dee0a.jpeg","publishedAt":"2025-07-01T12:07:41Z","source":{"name":"Європейська правда","url":"https://www.eurointegration.com.ua"}},{"title":"У Кремлі відповіли на заяву представника Трампа щодо затягування переговорів","description":"Напередодні посланець Трампа Кіт Келлог заявив, що Росії слід негайно припинити вогонь і перейти до тристоронніх переговорів для припинення війни","content":"У Кремлі 1 липня заперечили спеціальному посланцеві президента США Дональда Трампа з питань України, який заявив, що Росія гальмує мирні переговори для припинення війни проти України.\nРечник російського президента Дмитро Пєсков заявив, що Росія вдячн... [1869 chars]","url":"https://www.radiosvoboda.org/a/news-kreml-ssha-ukraina/33460819.html","image":"https://gdb.rferl.org/81973bb8-06d5-4487-8b0e-8842f2a8cb7b_w1200_h630.jpg","publishedAt":"2025-07-01T11:47:15Z","source":{"name":"Радіо Свобода","url":"https://www.radiosvoboda.org"}},{"title":"Азербайджан вступає у \"війну\" з РФ: чому виник і що змінює конфлікт між країнами","description":"Чи можливий гарячий конфлікт між Москвою та Баку? І чому нинішнє загострення можна вважати заздалегідь підготовленим Кремлем?","content":"\"У РФ свідомо розраховували завдати дошкульного та болючого удару по гідності азербайджанців\"\nМіж Росією та Азербайджаном відбувається безпрецедентне загострення відносин. Вже зараз можна казати, що нинішня криза виявилась набагато глибшою, аніж мину... [8846 chars]","url":"https://www.eurointegration.com.ua/articles/2025/07/1/7214930/","image":"https://img.eurointegration.com.ua/images/doc/e/c/ec84710-1200.jpg","publishedAt":"2025-07-01T11:30:00Z","source":{"name":"Європейська правда","url":"https://www.eurointegration.com.ua"}},{"title":"Лужність океану на Енцеладі може виявитися вищою, ніж очікувалося","description":"Океан, що ховається під кригою супутника Сатурна Енцелада має більш лужне середовище, ніж вважалося раніше","content":"Океан, що ховається під кригою супутника Сатурна Енцелада, має більш лужне середовище, ніж вважалося раніше. Такий висновок науковці зробили на основі даних про викиди фосфатів, зібрані космічним апаратом Cassini.\nВнутрішня будова Енцелада. Джерело: ... [1738 chars]","url":"https://universemagazine.com/luzhnist-okeanu-na-enczeladi-mozhe-vyyavytysya-vyshhoyu-nizh-ochikuvalosya/","image":"https://universemagazine.com/wp-content/uploads/2025/07/the-oceans-on-enceladu.jpg","publishedAt":"2025-07-01T10:38:40Z","source":{"name":"Universe Space Tech","url":"https://universemagazine.com"}},{"title":"По заводу \"Купол\" в РФ вдарили дрони СБУ: зафіксовано два влучання – джерела","description":"Зранку 1 липня далекобійні дрони СБУ вразили завод Купол в російському Іжевську, де окупанти виробляють ЗРК Тор та Оса, а також безпілотники для російської армії.","content":"Зранку 1 липня далекобійні дрони СБУ вразили завод \"Купол\" в російському Іжевську, де окупанти виробляють ЗРК \"Тор\" та \"Оса\", а також безпілотники для російської армії.\nДжерело: поінформовані співрозмовники УП в СБУ\nДеталі: За словами джерела, 1 липн... [643 chars]","url":"https://www.pravda.com.ua/news/2025/07/1/7519630/","image":"https://img.pravda.com/images/doc/7/5/7519630_fb_image_ukr_2025_07_01_14_26_25.jpg","publishedAt":"2025-07-01T10:23:41Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Вчені придумали інноваційний метод, що допоможе дістатися до найвіддаленішої планети Сонячної системи","description":"У зовнішніх межах Сонячної системи, далеко за орбітою Плутона, обертається Седна — один із найзагадковіших карликових світів. Орбіта планети настільки","content":"У зовнішніх межах Сонячної системи, далеко за орбітою Плутона, обертається Седна — один із найзагадковіших карликових світів. Орбіта планети настільки екстремальна, що одне обертання навколо Сонця триває понад 11 000 років. Нині вчені розглядають нов... [2092 chars]","url":"https://noworries.news/vcheni-prydumaly-innovaczijnyj-metod-shho-dopomozhe-distatysya-do-najviddalenishoyi-planety-sonyachnoyi-systemy/","image":"https://noworries.news/wp-content/uploads/2025/07/new-propulsion-systems.jpg","publishedAt":"2025-07-01T10:20:00Z","source":{"name":"noworries.news","url":"https://noworries.news"}}]}