{"totalArticles":6742592,"articles":[{"title":"Вибухи у Запоріжжі та Дніпрі 18.06.2025","description":"До Запоріжжя та Дніпра вночі 18 червня підлітали Шахеди, по російських дронах працювала ППО. Що відомо про наслідки атаки Шахедами по Запоріжжю та Дніпру сьогодні - 24 Канал.","content":"Про це повідомляє 24 Канал з посиланням на очільника Запорізької ОВА Івана Федорова та місцеві телеграм-канали.\nДо теми Росія масштабувала виробництво ударних БпЛА: як це може вплинути на тактику атак\nЩо відомо про роботу ППО у Запорізькій області\nОн... [1719 chars]","url":"https://24tv.ua/zaporizkiy-oblasti-chuli-vibuhi-pratsyuye-ppo_n2849211","image":"https://24tv.ua/resources/photos/news/202506/2849211.jpg?v=1750195033000&w=1200&h=675","publishedAt":"2025-06-18T01:00:34Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Україна ініціює термінове засідання Радбезу ООН після ракетної атаки РФ","description":"Після масованого нічного обстрілу Києва 17 червня Україна подала запит на термінове засідання Ради Безпеки ООН — подробиці на Фактах ICTV","content":"Після масованої нічної атаки Росії 17 червня Україна направила запит на термінове скликання Ради Безпеки ООН.\nПро це Укрінформу повідомив постійний представник України при ООН Андрій Мельник.\nЗа його словами, внаслідок обстрілу загинули мирні жителі ... [1112 chars]","url":"https://fakty.com.ua/ua/ukraine/20250617-ukrayina-inicziyuye-terminove-zasidannya-radbezu-oon-pislya-raketnoyi-ataky-rf/","image":"https://cdn.fakty.com.ua/wp-content/uploads/2023/04/22/screenshot_4-768x432.png","publishedAt":"2025-06-17T21:22:30Z","source":{"name":"Факти ICTV","url":"https://fakty.com.ua"}},{"title":"Вступ США у війну проти Ірану","description":"Президент Сполучених Штатів Америки Дональд Трамп може вступити у війну проти Ірану, щоб зупинити ядерну програму країни, заявив Джей Ді Венс.","content":"Він запевняє, що Трамп використовуватиме армію лише для досягнення цілей американського народу.\nПрезидент Сполучених Штатів Америки Дональд Трамп може вступити у війну проти Ірану, щоб зупинити ядерну програму країни.\nПро це свідчить допис американсь... [1920 chars]","url":"https://www.unian.ua/world/vstup-ssha-u-viynu-proti-iranu-zayava-vensa-13041432.html","image":"https://images.unian.net/photos/2025_02/thumb_files/620_324_1740769960-7993.jpg?1","publishedAt":"2025-06-17T20:19:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Зеленський закликав G7 інвестувати у виробництво зброї в Україні","description":"Володимир Зеленський на саміті G7 закликав міжнародних партнерів збільшити інвестиції у виробництво зброї в Україні, зокрема на дрони-перехоплювачі – подробиці на Фактах ICTV","content":"Президент Володимир Зеленський закликав міжнародних партнерів збільшити інвестиції у виробництво зброї в Україні. Зокрема, йдеться про нові дрони-перехоплювачі, важливі як для Європи, так і для Індо-Тихоокеанського регіону.\nПро це він заявив на спеці... [1479 chars]","url":"https://fakty.com.ua/ua/ukraine/20250617-zelenskyj-zaklykav-g7-investuvaty-u-vyrobnycztvo-zbroyi-v-ukrayini/","image":"https://cdn.fakty.com.ua/wp-content/uploads/2025/02/26/zelenskyj-768x432.jpg","publishedAt":"2025-06-17T20:17:00Z","source":{"name":"Факти ICTV","url":"https://fakty.com.ua"}},{"title":"Новий Генпрокурор України призначений","description":"Руслан Кравченко - новий генеральний прокурор України. Його кандидатуру висунув на голосування президент Зеленський. Що відомо про нового Генпрокурора, біографія коротко та кар'єра- 24 Канал","content":"Вранці 17 червня стало відомо, що Комітет з питань правоохоронної діяльності рекомендував Раді призначити Руслана Кравченка Генпрокурором України, передає 24 Канал із посиланням на Ярослава Железняка.\nДивіться також Главою місії України при НАТО стал... [1053 chars]","url":"https://24tv.ua/noviy-genprokuror-ukrayini-hto-tse-shho-vidomo-pro-priznachennya_n2848619","image":"https://24tv.ua/resources/photos/news/202506/2848619.jpg?v=1750159423000&w=1200&h=675","publishedAt":"2025-06-17T20:05:01Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Honda створила найдешевший електрокар: з'явилося перше фото","description":"Honda готує одразу кілька бюджетних моделей наступного покоління. А нова Honda Super EV стане найдешевшим електрокаром компанії на глобальному ринку. Несподівано в мережі показали перше фото автомобіля. Honda Подробиці стали відомі Motor1.","content":"Honda готує одразу кілька бюджетних моделей наступного покоління. А нова Honda Super EV стане найдешевшим електрокаром компанії на глобальному ринку. Несподівано в мережі показали перше фото автомобіля.\nВідео дня\nПодробиці стали відомі Motor1. Поки щ... [769 chars]","url":"https://www.obozrevatel.com/ukr/avto-oboz/honda-stvorila-najdeshevshij-elektrokar-zyavilosya-pershe-foto.htm","image":"https://i.obozrevatel.com/news/2025/6/17/honda-super-ev.jpg?size=1200x630","publishedAt":"2025-06-17T19:38:00Z","source":{"name":"Obozrevatel","url":"https://www.obozrevatel.com"}},{"title":"Ядерна зброя в Ірані","description":"Президент Дональд Трамп 17 червня 2025 року закликав до евакуації Тегерану. Заявив, що Іран не може мати ядерну зброю. Трамп про ядерку Ірану - Геополітика","content":"Таку заяву у вівторок, 17 червня, зробив президент США Дональд Трамп у своїй соцмережі Truth Social. Про це повідомляє 24 Канал з посиланням на агентство Reuters та Associated Press.\nДивіться також Велика війна на Близькому Сході: як конфлікт Ізраїлю... [850 chars]","url":"https://24tv.ua/geopolitics/yaderna-zbroya-irani-tramp-zrobiv-novu-zayavu-17-chervnya-zaklikaye_n2849139","image":"https://24tv.ua/resources/photos/news/202506/2849139.jpg?v=1750184547000&w=1200&h=675","publishedAt":"2025-06-17T19:25:33Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Зеленський закликав лідерів G7 допомогти Україні з ППО","description":"Системи протиповітряної оборони в Україні успішно перехопили значну кількість дронів і ракет завдяки підтримці лідерів G7. Для збереження життів важли...","content":"Системи протиповітряної оборони в Україні успішно перехопили значну кількість дронів і ракет завдяки підтримці лідерів G7. Для збереження життів важливо продовжувати надавати Україні сучасні системи ППО.\nПро це повідомляє РБК-Україна з посиланням на ... [854 chars]","url":"https://www.rbc.ua/rus/news/pitannya-zhittya-i-smerti-zelenskiy-zaklikav-1750185858.html","image":"https://www.rbc.ua/static/img/_/z/_zelenskiy_foto_vitaliy_nosach_rbk_ukrayina_02__1__964f735e5edfbe903f39c6ffed3bc12f_1300x820.jpg","publishedAt":"2025-06-17T18:44:18Z","source":{"name":"РБК-Україна","url":"https://www.rbc.ua"}},{"title":"Зупинення імпорту російського газу в ЄС","description":"У ЄС зробили офіційну пропозицію про повне зупинення імпорту газу та нафти з Росії до кінця 2027 року ᐅ TSN.ua(новини 1+1).","content":"Єврокомісія пропонує повне зупинення імпорту газу РФ / © Associated Press\nРеклама\nЄврокомісія зробила офіційну пропозицію про повне зупинення імпорту газу та нафти з Росії до кінця 2027 року.\nПро це йдеться на сайті Єврокомісії.\nЩо пропонує Єврокоміс... [911 chars]","url":"https://tsn.ua/svit/povne-zupynennia-importu-hazu-ta-nafty-z-rf-v-yes-zrobyly-ofitsiynu-zaiavu-2851499.html","image":"https://img.tsn.ua/cached/205/tsn-d1c7980c2793b1401d3d1b4f99d2baf6/thumbs/1200x630/65/bb/b43b8dc6201f65fc574febad1e8fbb65.jpeg","publishedAt":"2025-06-17T18:36:20Z","source":{"name":"tsn.ua","url":"https://tsn.ua"}},{"title":"Bloomberg: У лідерів G7 не вийшло переконати Трампа посилити тиск на Росію","description":"Обговорення між лідерами Групи семи напередодні не підштовхнуло президента США Дональда Трампа піти на жорсткіші санкції проти Росії.","content":"Обговорення між лідерами \"Групи семи\" напередодні не підштовхнуло президента США Дональда Трампа піти на жорсткіші санкції проти Росії.\nДжерело: про це агентству Bloomberg розповіли проінформовані джерела, пише \"Європейська правда\"\nДеталі: Трамп неод... [1109 chars]","url":"https://www.pravda.com.ua/news/2025/06/17/7517586/","image":"https://img.pravda.com/images/doc/7/5/7517586_fb_image_ukr_2025_06_17_22_27_58.jpg","publishedAt":"2025-06-17T18:28:04Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}}]}