{"totalArticles":6979078,"articles":[{"title":"Зеленський заявив, що Україна протистоїть не лише Росії","description":"24 червня у Гаазі Зеленський заявив, що Україна протистоїть цілій мережі ворогів, які охоплюють Росію, Іран, Північну Кореї та китайські компанії - 24 Канал","content":"24 червня президент Зеленський перебуває у Гаазі для участі у саміті НАТО. Глава держави виступив на пленарному засіданні Форуму оборонних індустрій, передає 24 Канал.\nДивіться також Точно не хочу бачити глобальних угод між Америкою і Росією, – Зелен... [689 chars]","url":"https://24tv.ua/zelenskiy-zayaviv-shho-ukrayina-protistoyit-ne-lishe-rosiyi_n2854540","image":"https://24tv.ua/resources/photos/news/202506/2854540.jpg?v=1750773768000&w=1200&h=675","publishedAt":"2025-06-24T14:41:17Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Шидкість обертання Землі зростає","description":"Вчені заявили, що швидкість обертання Землі зростає, а отже тривалість доби стає меншою. На це є кілька причин. Читайте докладно в матеріалі УНІАН","content":"Це зокрема означає, що тривалість доби стає меншою.\nШвидкість обертання Землі прискорюється, що робить тривалість доби трохи меншою. Хоча йдеться про зміни на лічені мілісекунди, за останні 5 років встановлено кілька рекордів з найменшої тривалості д... [2119 chars]","url":"https://www.unian.ua/science/shidkist-obertannya-zemli-zrostaye-vcheni-13047579.html","image":"https://images.unian.net/photos/2023_04/thumb_files/620_324_1681198217-2468.jpg?1","publishedAt":"2025-06-24T14:40:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Wellboy розповів про свою залежність та розлад психіки, від якого лікується","description":"25-річний Антон Вельбой зізнався, що йому поки не вдалося позбутися залежності від марихуани. Як вона вплинула на психічне здоров'я артиста","content":"Співак Антон Вельбой (Wellboy) зізнався, що навіть лікування у реабілітаційному центрі не допомогло йому побороти залежність від марихуани. Він знов і знов повертається до згубної звички, яка вже позначилася на його психічному здоров'ї.\nПро це 25-річ... [1744 chars]","url":"https://tabloid.pravda.com.ua/focus/wellboy-rozpoviv-pro-svoyu-zalezhnist-ta-rozlad-psihiki-vid-yakogo-likuyetsya-2010619/","image":"https://imgnewtabl.pravda.com.ua/tabloid/images/doc/7/f/212651/7f205f1e7d3e9f1e2c31aa900dc26cf4.jpeg","publishedAt":"2025-06-24T14:30:00Z","source":{"name":"ТаблоID","url":"https://tabloid.pravda.com.ua"}},{"title":"ГУР і МЗС евакуювали 31 українця з Ірану","description":"ГУР і МЗС України евакуювали 31 громадянина з Ірану, серед них 14 дітей. Операцію провели за дорученням Зеленського — читайте на Фактах ICTV","content":"За дорученням президента Володимира Зеленського Головне управління розвідки Міністерства оборони спільно з Міністерством закордонних справ України провели успішну евакуацію 31 українського громадянина з території Ірану.\nПро це повідомили у Головному ... [1194 chars]","url":"https://fakty.com.ua/ua/svit/20250624-gur-i-mzs-evakuyuvaly-31-ukrayinczya-z-iranu-sered-nyh-14-ditej/","image":"https://cdn.fakty.com.ua/wp-content/uploads/2025/06/24/h4oo2aq-768x432.jpeg","publishedAt":"2025-06-24T14:22:00Z","source":{"name":"fakty.com.ua","url":"https://fakty.com.ua"}},{"title":"Зеленський підтримав вимоги Трампа до НАТО","description":"Зеленський підтримав вимоги Трампа до країн НАТО щодо необхідності збільшити витрати на оборону до 5% ВВП - читайте докладно в матеріалі УНІАН","content":"Президент України закликав країни НАТО збільшити видатки на власну оборону.\nНемає жодних ознак того, що Путін хоче припинити війну проти України, натомість є свідчення, що Росія готується до нападу на країни НАТО. Саме тому країнам альянсу варто збіл... [2247 chars]","url":"https://www.unian.ua/politics/samit-nato-volodimir-zelenskiy-pidtrimav-vimogi-donalda-trampa-13047774.html","image":"https://images.unian.net/photos/2025_05/thumb_files/620_324_1746277571-9177.jpg?1","publishedAt":"2025-06-24T13:44:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Старий супутник NASA раптово \"ожив\" і вибухнув у космосі: вчені приголомшені","description":"Астрономи зафіксували рідкісний спалах енергії від супутника NASA Relay 2, який мовчав понад пів століття — ймовірно, його активував удар мікрометеороїда.","content":"Астрономи випадково зафіксували рідкісний спалах енергії від супутника NASA Relay 2, який мовчав понад пів століття — ймовірно, його активував удар мікрометеороїда.\nДивовижний енергетичний вибух, зафіксований астрономами з Університету Кертіна (Австр... [1782 chars]","url":"https://www.unian.ua/science/stariy-suputnik-nasa-raptovo-ozhiv-i-vibuhnuv-u-kosmosi-vcheni-prigolomsheni-13047654.html","image":"https://images.unian.net/photos/2025_06/thumb_files/620_324_1750764254-7272.jpg?1","publishedAt":"2025-06-24T13:30:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Леся Нікітюк показала, як виглядає після пологів","description":"Вона каже, що упродовж вагітності зовсім не переживала про вагу, варикоз чи розтяжки","content":"Вона каже, що упродовж вагітності зовсім не переживала про вагу, варикоз чи розтяжки\nФото: Інстаграм/ @lesia_nikituk\nУкраїнська ведуча та акторка Леся Нікітюк, яка нещодавно стала мамою, розповіла, що найбільше її лякало під час вагітності. У своїх I... [549 chars]","url":"https://pravdatutnews.com/lifestyle/2025/06/24/61681-lesya-nikityuk-pokazala-yak-vyglyadaye-pislya-pologiv","image":"https://pravdatutnews.com/sites/default/files/news/2025/06/24/2025-06-24_16.14.56.jpg","publishedAt":"2025-06-24T13:16:21Z","source":{"name":"ПравдаТУТ NEWS","url":"https://pravdatutnews.com"}},{"title":"Обсерваторія Віри Рубін показала детальні фото далеких галактик","description":"Обсерваторія Віри Рубін у Чилі оприлюднила перші зображення далеких галактик і туманностей із неймовірною деталізацією за 10 годин тестів. Виявлено 2104 нових астероїди та інші об'єкти.","content":"За трохи більше ніж 10 годин тестових спостережень вдалося зафіксувати мільйони далеких галактик, зоряні туманності та тисячі раніше невідомих астероїдів. Це без перебільшення відкриває нову еру в дослідженні космосу, розповідає 24 Канал із посилання... [3245 chars]","url":"https://24tv.ua/tech/observatoriya-viri-rubin-pokazala-detalni-foto-dalekih-galaktik_n2854084","image":"https://24tv.ua/resources/photos/news/202506/2854084.jpg?v=1750746878000&w=1200&h=675","publishedAt":"2025-06-24T13:06:07Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Металіст розпочав підготовку до сезону. Оголошено склад","description":"У розпорядженні тренерського штабу 34 футболісти ⋆ Футбол на Sport.ua","content":"Харківський «Металіст» вийшов з відпустки і розпочав підготовку до нового сезону. Літні навчально-тренувальні збори пройдуть в Ужгороді.\nУ розпорядженні Андрія Аніщенка знаходяться 34 футболісти. В ході зборів буде визначено основний склад і найближч... [1011 chars]","url":"https://sport.ua/uk/news/772939-metalist-rozpochav-pidgotovku-do-sezonu-ogolosheno-sklad","image":"https://pic.sport.ua/images/news/0/19/64/og_uk_772939.jpg","publishedAt":"2025-06-24T13:06:00Z","source":{"name":"Sport.ua","url":"https://sport.ua"}},{"title":"Кондратюк розповів, де служить його старший син","description":"Старший син продюсера Ігоря Кондратюка Сергій долучився до ЗСУ - його коментар","content":"Продюсер Ігор Кондратюк розказав, де служить його старший син Сергій, який долучився до ЗСУ.\nУ новому випуску \"ТУР Зірками\" на Люкс ФМ зірковий батько вимушено повідомив про це.\nЗа словами Ігоря, він розповів про сина лише тому, що Віталій Козловськи... [995 chars]","url":"https://tabloid.pravda.com.ua/lounge/kondratyuk-rozpoviv-de-sluzhit-yogo-starshiy-sin-2010617/","image":"https://imgnewtabl.pravda.com.ua/tabloid/images/doc/1/e/212606/1e7c9cd0e425a491347282d372484693.jpeg","publishedAt":"2025-06-24T13:00:00Z","source":{"name":"ТаблоID","url":"https://tabloid.pravda.com.ua"}}]}