{"totalArticles":6791152,"articles":[{"title":"Як передові графічні технології змінили сучасний геймінг: DLSS 4, Multi Frame Generation, Ray Traicing, Path Tracing","description":"Прогрес в комп’ютерних технологіях нерідко починається з геймерського світу, а і","content":"Розділ Технології виходить за підтримки\nПрогрес в комп’ютерних технологіях нерідко починається з геймерського світу, а інноваційний ігровий досвід значною мірою розвивається завдяки сучасним рішенням, що пропонує NVIDIA. Сьогодні ми поговоримо про ак... [13865 chars]","url":"https://itc.ua/ua/articles/yak-peredovi-grafichni-tehnologiyi-zminyly-suchasnyj-gejming-dlss-4-multi-frame-generation-ray-traicing-path-tracing/","image":"https://itc.ua/wp-content/uploads/2025/06/cover-1.jpg","publishedAt":"2025-06-18T04:00:50Z","source":{"name":"ITC.ua","url":"https://itc.ua"}},{"title":"Зеленський перервав візит в Канаду","description":"Український лідер скасував пресконференцію та низку зустрічей, запланованих на полях саміту G7. Деталі читайте на сайті УНІАН просто зараз.","content":"Український лідер скасував пресконференцію та низку зустрічей, запланованих на полях саміту G7.\nПрезидент України Володимир Зеленський перервав візит до Канади й повертається в Київ, повідомляють канадський мовник CBC News та Суспільне.\nДжерела в укр... [992 chars]","url":"https://www.unian.ua/world/zelenskiy-perervav-vizit-v-kanadu-zmi-nazvali-prichinu-13041498.html","image":"https://images.unian.net/photos/2025_06/thumb_files/620_324_1750217501-8482.jpeg?1","publishedAt":"2025-06-18T03:53:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Adobe випустив додаток для створення відео та зображень на основі ШІ","description":"Компанія Adobe Inc. випустила окремий мобільний додаток Firefly для Android та iOS для створення та редагування зображень на основі штучного інтелекту. — Укрінформ.","content":"Компанія Adobe Inc. випустила окремий мобільний додаток Firefly для Android та iOS для створення та редагування зображень на основі штучного інтелекту.\nПро це повідомляє Bloomberg, передає Укрінформ.\nНовий додаток пропонує такі можливості, як генерат... [1251 chars]","url":"https://www.ukrinform.ua/rubric-world/4005319-adobe-vipustiv-dodatok-dla-stvorenna-video-ta-zobrazen-na-osnovi-si.html","image":"https://static.ukrinform.com/photos/2025_06/thumb_files/630_360_1750171076-620.jpeg","publishedAt":"2025-06-18T03:50:00Z","source":{"name":"Укрінформ","url":"https://www.ukrinform.ua"}},{"title":"Новий недорогий електрокросовер Nissan Leaf показали в деталях. Фото","description":"Кросовер Nissan Leaf 2026 модельного року виявився новим поколінням знаменитого недорогого електрокара з Японії. Цей довгоочікуваний автомобіль уже офіційно розсекречено, його показали в деталях на нових фото. Nissan Як нагадує OBOZ.","content":"Кросовер Nissan Leaf 2026 модельного року виявився новим поколінням знаменитого недорогого електрокара з Японії. Цей довгоочікуваний автомобіль уже офіційно розсекречено, його показали в деталях на нових фото.\nВідео дня\nЯк нагадує OBOZ.UA, модель пер... [1214 chars]","url":"https://www.obozrevatel.com/ukr/avto-oboz/novij-nedorogij-elektrokrosover-nissan-leaf-pokazali-v-detalyah-foto.htm","image":"https://i.obozrevatel.com/news/2025/6/18/nissan-leaf.jpg?size=1200x630","publishedAt":"2025-06-18T02:58:00Z","source":{"name":"Obozrevatel","url":"https://www.obozrevatel.com"}},{"title":"Вибухи у Запоріжжі та Дніпрі 18.06.2025","description":"До Запоріжжя та Дніпра вночі 18 червня підлітали Шахеди, по російських дронах працювала ППО. Що відомо про наслідки атаки Шахедами по Запоріжжю та Дніпру сьогодні - 24 Канал.","content":"Про це повідомляє 24 Канал з посиланням на очільника Запорізької ОВА Івана Федорова та місцеві телеграм-канали.\nДо теми Росія масштабувала виробництво ударних БпЛА: як це може вплинути на тактику атак\nЩо відомо про роботу ППО у Запорізькій області\nОн... [1719 chars]","url":"https://24tv.ua/zaporizkiy-oblasti-chuli-vibuhi-pratsyuye-ppo_n2849211","image":"https://24tv.ua/resources/photos/news/202506/2849211.jpg?v=1750195033000&w=1200&h=675","publishedAt":"2025-06-18T01:00:34Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Зеленський скоротив візит до Канади й повертається в Україну - ЗМІ","description":"Президент Володимир Зеленський скоротив свій візит до Канади й повертається в Україну.","content":"Президент Володимир Зеленський скоротив свій візит до Канади й повертається в Україну.\nДжерело: канадський мовник CBC News, Суспільне\nДеталі: Джерела в українській делегації повідомили CBC News, що Зеленський скорочує свій візит після смертоносного о... [774 chars]","url":"https://www.pravda.com.ua/news/2025/06/18/7517609/","image":"https://img.pravda.com/images/doc/7/5/7517609_fb_image_ukr_2025_06_18_03_23_31.jpg","publishedAt":"2025-06-18T00:13:18Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"біографія та що відомо про можливого нового генпрокурора","description":"Що відомо про Кравченка Руслана Андрійовича – біографія, кар'єра та сім'я. Детальніше про Кравченка Руслана, якого президент України подав на призначення на посаду генпрокурора до Ради – читайте на Фактах ICTV","content":"Верховна Рада України призначила Руслана Кравченка на посаду генерального прокурора, за відповідне рішення проголосували 273 народні депутати.\nБіографію Руслана Кравченка читайте в матеріалі на Фактах ICTV.\nРуслан Кравченко: що відомо про освіту поте... [2917 chars]","url":"https://fakty.com.ua/ua/ukraine/20250618-ruslan-kravchenko-shho-vidomo-pro-kandydata-na-posadu-genprokurora-ukrayiny/","image":"https://cdn.fakty.com.ua/wp-content/uploads/2025/06/16/ruslan-kravchenko-768x432.jpg","publishedAt":"2025-06-17T22:13:00Z","source":{"name":"Факти ICTV","url":"https://fakty.com.ua"}},{"title":"Мерц і Макрон закликали до посилення тиску на Росію","description":"Канцлер Німеччини Фрідріх Мерц та президент Франції Емманюель Макрон після засідання G7 у Канаді закликали до посилення тиску на Росію.","content":"Зеленський та іноземні лідери в Канаді, фото з Х Мерца\nКанцлер Німеччини Фрідріх Мерц та президент Франції Емманюель Макрон після засідання G7 у Канаді закликали до посилення тиску на Росію.\nДжерело: Мерц та Макрон у соцмережі Х\nПряма мова Мерца: \"Я ... [757 chars]","url":"https://www.pravda.com.ua/news/2025/06/18/7517600/","image":"https://img.pravda.com/images/doc/7/5/7517600_fb_image_ukr_2025_06_18_00_53_29.jpg","publishedAt":"2025-06-17T21:25:43Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Україна ініціює термінове засідання Радбезу ООН після ракетної атаки РФ","description":"Після масованого нічного обстрілу Києва 17 червня Україна подала запит на термінове засідання Ради Безпеки ООН — подробиці на Фактах ICTV","content":"Після масованої нічної атаки Росії 17 червня Україна направила запит на термінове скликання Ради Безпеки ООН.\nПро це Укрінформу повідомив постійний представник України при ООН Андрій Мельник.\nЗа його словами, внаслідок обстрілу загинули мирні жителі ... [1112 chars]","url":"https://fakty.com.ua/ua/ukraine/20250617-ukrayina-inicziyuye-terminove-zasidannya-radbezu-oon-pislya-raketnoyi-ataky-rf/","image":"https://cdn.fakty.com.ua/wp-content/uploads/2023/04/22/screenshot_4-768x432.png","publishedAt":"2025-06-17T21:22:30Z","source":{"name":"Факти ICTV","url":"https://fakty.com.ua"}},{"title":"Найдешевший кросовер Audi показали в подробицях. Фото","description":"Нова Audi Q3 3 покоління – тепер найдешевший кросовер німецького виробника. Автомобіль на базі Volkswagen Tiguan 2025 року в подробицях показали після офіційної прем'єри. кросовер З машиною близько познайомилися на каналі Autogefühl.","content":"Нова Audi Q3 3 покоління – тепер найдешевший кросовер німецького виробника. Автомобіль на базі Volkswagen Tiguan 2025 року в подробицях показали після офіційної прем'єри.\nВідео дня\nЗ машиною близько познайомилися на каналі Autogefühl. Модель Audi Q3 ... [878 chars]","url":"https://www.obozrevatel.com/ukr/avto-oboz/najdeshevshij-krosover-audi-pokazali-v-podrobitsyah-foto.htm","image":"https://i.obozrevatel.com/news/2025/6/17/audi-q31.jpg?size=1200x630","publishedAt":"2025-06-17T21:06:00Z","source":{"name":"Obozrevatel","url":"https://www.obozrevatel.com"}}]}