{"totalArticles":7084648,"articles":[{"title":"PH to implement framework on crypto-assets","description":"MANILA – The Philippines will implement a framework on crypto-assets to combat cross-border tax evasion and illicit financial flows, the Department of Finance (DOF) said. In a statement on Tuesday, the DOF said the Philippines committed to execute the Crypto-Asset Reporting Framework (CARF) by…","content":"MANILA – The Philippines will implement a framework on crypto-assets to combat cross-border tax evasion and illicit financial flows, the Department of Finance (DOF) said.\nIn a statement on Tuesday, the DOF said the Philippines committed to execute th... [2374 chars]","url":"https://www.pna.gov.ph/articles/1252345","image":"https://files01.pna.gov.ph/ograph/2023/10/18/dof-passage-1-1.jpg","publishedAt":"2025-06-17T16:03:00Z","source":{"name":"Philippine News Agency","url":"https://www.pna.gov.ph"}},{"title":"Health Unit announces another measles case, more exposures","description":"Health officials are putting out the word after another case of the measles has been discovered. According to ...","content":"Health officials are putting out the word after another case of the measles has been discovered.\nAccording to Peterborough Public Health, measles has been identified in a vaccinated resident who was a contact of the first case shared last week.\nThe H... [1268 chars]","url":"https://www.ptbotoday.ca/2025/06/17/health-unit-announcing-another-measles-case-more-exposures/","image":"https://media-cdn.socastsrm.com/wordpress/wp-content/blogs.dir/2053/files/2021/01/public-health-office-1200x675.jpg","publishedAt":"2025-06-17T15:35:45Z","source":{"name":"PTBO Today","url":"https://www.ptbotoday.ca"}},{"title":"Four guilty of actions after Ashling Murphy murder","description":"Two brothers of convicted murderer Jozef Puska, along with their wives have been found guilty of charges connected with their actions in the aftermath of the murder of teacher Ashling Murphy in 2022.","content":"Two brothers of convicted murderer Jozef Puska, along with their wives have been found guilty of charges connected with their actions in the aftermath of the murder of teacher Ashling Murphy in 2022.\nMarek Puska and Lubomir Puska Jr were convicted of... [3215 chars]","url":"https://www.rte.ie/news/courts/2025/0617/1518865-puska-family-court/","image":"https://www.rte.ie/images/0022b77c-1600.jpg","publishedAt":"2025-06-17T15:34:09Z","source":{"name":"RTE.ie","url":"https://www.rte.ie"}},{"title":"Ripple and SEC want appeals paused - Is a breakthrough ruling coming soon?","description":"Ripple may be nearing a breakthrough settlement with the SEC, as both parties pause appeals. Could this clear the path for an XRP rally?","content":"Ripple and the SEC have jointly paused appeals, signaling a potential endgame in the multi-year legal battle.\nCould this be the final catalyst that unlocks XRP’s suppressed potential?\nAfter nearly five years of legal wrangling, the Ripple vs. SEC cas... [2749 chars]","url":"https://ambcrypto.com/ripple-and-sec-want-appeals-paused-is-a-breakthrough-ruling-coming-soon/","image":"https://ambcrypto.com/wp-content/uploads/2025/06/Ritika-15-1000x600.webp","publishedAt":"2025-06-17T15:04:05Z","source":{"name":"AMBCrypto","url":"https://ambcrypto.com"}},{"title":"34 malaria cases recorded in Ernakulam over past two months","description":"Ernakulam reports 34 malaria cases, majority imported, emphasizing need for testing, prevention, and vector control measures.","content":"Ernakulam has reported over 30 confirmed cases of malaria since April 1, 2025.\nThe total number of confirmed cases as on June 13 was 34. Of these, 21 cases were reported between May 1 and June 13. In April, as many as 13 confirmed cases were reported... [1991 chars]","url":"https://www.thehindu.com/news/cities/Kochi/34-malaria-cases-recorded-in-ernakulam-over-past-two-months/article69704782.ece","image":"https://www.thehindu.com/theme/images/og-image.png","publishedAt":"2025-06-17T14:57:00Z","source":{"name":"The Hindu","url":"https://www.thehindu.com"}},{"title":"Wildfires could be harming our oceans and disrupting their carbon storage","description":"Wildfires pollute waterways and could affect their ability to sequester carbon, recent University of British Columbia research shows. Dr. Brian Hunt, professor in the Institute for the Oceans and Fisheries (IOF), and Emily Brown, IOF research scientist, discuss how wildfires affect our waters and what this means in a changing…","content":"Wildfires pollute waterways and could affect their ability to sequester carbon, recent University of British Columbia research shows.\nDr. Brian Hunt, professor in the Institute for the Oceans and Fisheries (IOF), and Emily Brown, IOF research scienti... [4002 chars]","url":"https://news.ubc.ca/2025/06/wildfires-could-be-harming-our-oceans-and-disrupting-their-carbon-storage/","image":"https://news.ubc.ca/wp-content/uploads/2025/06/img_4349hunt-feature.png","publishedAt":"2025-06-17T14:55:00Z","source":{"name":"UBC News","url":"https://news.ubc.ca"}},{"title":"Queer Dublin photographer Alex Del Chill reimagines human transformation in new project","description":"Dublin-based queer Irish/Italian photographer Alex Del Chill has launched 'Metallic Cocoon', the first chapter of his new photo saga.","content":"Dublin-based queer Irish/Italian photographer Alex Del Chill has launched ‘Metallic Cocoon’, the first chapter of his visionary photo saga Project Transhumanism. Captured at Flux Studios, the series merges mythic imagery with cyber-inspired aesthetic... [2487 chars]","url":"https://gcn.ie/photographer-alex-del-chill-new-project/","image":"https://gcn.ie/wp-content/uploads/2025/06/alex-del-chill-facebook-img.png","publishedAt":"2025-06-17T14:54:51Z","source":{"name":"gcn.ie","url":"https://gcn.ie"}},{"title":"Plane shortage and snags: Air India cancels nine long hauls today, mostly Dreamliners","description":"India News: NEW DELHI: Air India on Tuesday cancelled at least eight international flights to be operated on Boeing 787 Dreamliner and one on a B777. The B787 can.","content":"NEW DELHI: Air India on Tuesday cancelled at least eight international flights to be operated on Boeing 787 Dreamliner and one on a B777. The B787 cancellations were for: Ahmedabad-London Gatwick; Gatwick-Amritsar; Delhi to Vienna, Paris and Dubai; B... [2886 chars]","url":"https://timesofindia.indiatimes.com/india/plane-shortage-and-snags-air-india-cancels-nine-long-hauls-today-mostly-on-dreamliners/articleshow/121913086.cms","image":"https://static.toiimg.com/thumb/msid-121913158,width-1070,height-580,imgsize-338342,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","publishedAt":"2025-06-17T14:53:00Z","source":{"name":"Times of India","url":"https://timesofindia.indiatimes.com"}},{"title":"No winners in major lotto draws on June 17","description":"No bettors won the jackpot prizes in the latest major lotto draws by the Philippine Charity Sweepstakes Office (PCSO) on Tuesday.","content":"MANILA, Philippines — No bettors won the jackpot prizes in the latest major lotto draws by the Philippine Charity Sweepstakes Office (PCSO) on Tuesday.\nREAD: Lotto Results – June 17, 2025\nBased on the PCSO’s evening draw on June 17, no one won the ja... [465 chars]","url":"https://newsinfo.inquirer.net/2071610/no-winners-in-major-lotto-draws-on-june-17","image":"https://www.inquirer.net/wp-content/uploads/2016/10/new-inq-fb-def.jpg","publishedAt":"2025-06-17T14:51:00Z","source":{"name":"Inquirer.net","url":"https://newsinfo.inquirer.net"}},{"title":"Disgraced singer Gary Glitter to stay in jail as parole bid refused","description":"In 2015, the 81-year-old, whose real name is Paul Gadd, was jailed for child sex offences and then, in 2023, less than six weeks after he was released halfway through his 16-year sentence, he was recalled to jail for breaching his licence conditions.","content":"Gary Glitter will stay in prison after the Parole Board refused the disgraced singer's bid to be released.\nGlitter, 81, was recalled to jail less than six weeks after he was released halfway through his 16-year sentence in 2023 for breaching his lice... [2678 chars]","url":"https://news.sky.com/story/disgraced-singer-gary-glitter-to-stay-in-jail-as-parole-bid-refused-13384989","image":"https://e3.365dm.com/24/02/1600x900/skynews-gary-glitter-parole_6447208.jpg?20240207103155","publishedAt":"2025-06-17T14:48:02Z","source":{"name":"Sky News","url":"https://news.sky.com"}}]}