{"totalArticles":6688836,"articles":[{"title":"The Path to Cervical Cancer Eradication: Overcoming Barriers to HPV Vaccination","description":"Significant challenges persist, particularly in low- and middle-income countries.","content":"In 2025, an estimated 13,360 women in the United States will be diagnosed with invasive cervical cancer, and more than 4300 will die from the disease. Globally, cervical cancer remains the fourth most common cancer among women, with approximately 660... [10398 chars]","url":"https://www.pharmacytimes.com/view/the-path-to-cervical-cancer-eradication-overcoming-barriers-to-hpv-vaccination","image":"https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/a5d54f2e069fac2c3f878854abd84fa94e53f72f-5184x2920.jpg?fit=crop&auto=format","publishedAt":"2025-06-12T14:08:13Z","source":{"name":"Pharmacy Times","url":"https://www.pharmacytimes.com"}},{"title":"Police probe murder of man in Bacolod","description":"BACOLOD CITY – Police are investigating if the murder of a man in Barangay Alangilan here this week is tied to his father’s alleged involvement in illegal...","content":"BACOLOD CITY – Police are investigating if the murder of a man in Barangay Alangilan here this week is tied to his father’s alleged involvement in illegal drugs.\nPOLICE Col. Joeresty Coronica (left), Bacolod City police director, and Police Major Joe... [2632 chars]","url":"https://mb.com.ph/2025/06/12/police-probe-murder-of-man-in-bacolod","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/12/18950.webp","publishedAt":"2025-06-12T13:48:03Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Webb telescope spots infant planets in different stages of development","description":"WASHINGTON - The James Webb Space Telescope has observed two large planets at different stages of infancy - one with an atmosphere brimming with dusty clouds and the other encircled by a disk of material - orbiting a young sun-like star in a discovery that illustrates the complex nature of how planetary systems develop. Read more at straitstimes.com.","content":"An artist's rendition of the sun-like star YSES-1 in the center, with the planet YSES-1 b and its dusty circumplanetary disk (right) and the planet YSES-1 c with silicate clouds in its atmosphere (left), is seen in this handout image obtained by Reut... [4352 chars]","url":"https://www.straitstimes.com/world/webb-telescope-spots-infant-planets-in-different-stages-of-development","image":"https://cassette.sphdigital.com.sg/image/straitstimes/076977d2b232242360f1466c0e514a4d0127de51ae69bfd6f2938fa7f7da1b29","publishedAt":"2025-06-12T13:39:36Z","source":{"name":"The Straits Times","url":"https://www.straitstimes.com"}},{"title":"May 2025 US Inflation Print Increased Less Than Expected","description":"May’s U.S. Consumer Price Index reading was a welcome sign for investors, with price growth increasing less than expected.","content":"GENERAL RISKS & CONSIDERATIONS . Any views, strategies or products discussed in this material may not be appropriate for all individuals and are subject to risks. Investors may get back less than they invested, and past performance is not a reliable ... [4656 chars]","url":"https://www.jpmorgan.com/insights/outlook/economic-outlook/cpi-report-may-2025","image":"https://www.jpmorgan.com/content/dam/jpmorgan/images/jpma/cpi-report-may-2025/cpi-report-may-2025-1440x810.jpg","publishedAt":"2025-06-12T13:27:58Z","source":{"name":"J.P. Morgan","url":"https://www.jpmorgan.com"}},{"title":"Understanding us: Researchers apply algorithm to decode complex genome sequences","description":"Over the last 10 years, breakthroughs in understanding the genetic instructions passed from parent to offspring have put researchers closer than ever before to efficiently decoding DNA with 100% accuracy. However, this analysis approach, called genome sequencing, still poses a challenge for certain regions of the genome.","content":"This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\nError identification and curation analysis overview. Credit: Genome B... [7926 chars]","url":"https://phys.org/news/2025-06-algorithm-decode-complex-genome-sequences.html","image":"https://scx2.b-cdn.net/gfx/news/hires/2025/understanding-us-resea-1.jpg","publishedAt":"2025-06-12T13:27:05Z","source":{"name":"Phys.org","url":"https://phys.org"}},{"title":"Jason Wilcox names three traits Matheus Cunha will help with at Man Utd, Ruben Amorim will love it","description":"Matheus Cunha is officially a Manchester United player and director of football Jason Wilcox named three traits he will bring to the team.","content":"Manchester United’s first signing of the summer transfer window is officially here as Matheus Cunha has arrived at Old Trafford after an initial fee agreement earlier in June.\nMatheus Cunha’s agreement was confirmed by Man Utd but his official unveil... [2860 chars]","url":"https://www.unitedinfocus.com/news/jason-wilcox-names-three-traits-matheus-cunha-will-help-with-at-man-utd-ruben-amorim-will-love-it/","image":"https://cdn1.unitedinfocus.com/uploads/14/2025/06/GettyImages-2219791686-scaled.jpg","publishedAt":"2025-06-12T13:20:21Z","source":{"name":"United In Focus","url":"https://www.unitedinfocus.com"}},{"title":"Cholesterol shields cancer cells from heat treatment in hyperthermia therapy","description":"Hyperthermia, a cancer treatment using controlled heat to kill tumor cells, shows promise but faces limitations due to some tumor cells' unexpected heat resistance.","content":"Hyperthermia, a cancer treatment using controlled heat to kill tumor cells, shows promise but faces limitations due to some tumor cells' unexpected heat resistance. Researchers from Japan have now discovered that high cholesterol levels in cancer cel... [5326 chars]","url":"https://www.news-medical.net/news/20250612/Cholesterol-shields-cancer-cells-from-heat-treatment-in-hyperthermia-therapy.aspx","image":"https://www.news-medical.net/image-handler/picture/2014/7/Chemo_Vials-620x480.jpg","publishedAt":"2025-06-12T13:14:00Z","source":{"name":"News-Medical","url":"https://www.news-medical.net"}},{"title":"787 Dreamliner: Boeing’s flagship long-distance plane","description":"Aircraft has suffered several setbacks, including repeated and costly delivery suspensions between 2021 and 2023, due to manufacturing quality issues.","content":"The Boeing 787 Dreamliner that crashed in India on Thursday is the pride of the US company’s catalogue for long-distance planes: a fuel-efficient, wide-body aircraft able to transport up to 330 people.\nLightweight\nAfter first entering service in Octo... [2033 chars]","url":"https://www.dawn.com/news/1916742/787-dreamliner-boeings-flagship-long-distance-plane","image":"https://i.dawn.com/large/2025/06/12175915479eff2.jpg?r=180319","publishedAt":"2025-06-12T13:13:02Z","source":{"name":"Dawn","url":"https://www.dawn.com"}},{"title":"Metal Gear Solid Delta: Snake Eater Has an Online Multiplayer Mode Called Fox Hunt With Completely Different Gameplay Than Metal Gear Online","description":"Konami is bringing back Metal Gear multiplayer with Metal Gear Solid Delta: Snake Eater, but don’t expect it to play like Metal Gear Online.","content":"Konami is bringing back Metal Gear multiplayer with Metal Gear Solid Delta: Snake Eater, but don’t expect it to play like Metal Gear Online.\nMetal Gear Online is the fondly remembered multiplayer spin-off bundled with 2008’s Metal Gear Solid 4: Guns ... [3307 chars]","url":"https://www.ign.com/articles/metal-gear-solid-delta-snake-eater-has-an-online-multiplayer-mode-called-fox-hunt-with-completely-different-gameplay-than-metal-gear-online","image":"https://assets-prd.ignimgs.com/2025/06/12/mgs-1749723318793.png?width=1280","publishedAt":"2025-06-12T13:11:45Z","source":{"name":"IGN","url":"https://www.ign.com"}},{"title":"Philomena (Phill) Conway nee Enright","description":"Riversdale Court, Castlebar and formerly of Lagduff, Ballycroy and Lisselton, Co. Kerry - peacefully at University Hospital, Galway. Predeceased by her son Colum and daughter Nora-Mai. Phill will be sadly missed by her heartbroken family, daughters Rose, Philo, Sinead and Fiona and her sons Peter Paul, Dermot and Michael and their partners, adored grandchildren her","content":"Riversdale Court, Castlebar and formerly of Lagduff, Ballycroy and Lisselton, Co. Kerry – peacefully at University Hospital, Galway.\nPredeceased by her son Colum and daughter Nora-Mai.\nPhill will be sadly missed by her heartbroken family, daughters R... [385 chars]","url":"https://www.midwestradio.ie/obituaries/philomena-phill-conway-nee-enright/","image":"https://www.midwestradio.ie/wp-content/uploads/2025/06/Philomena-Conway.jpg","publishedAt":"2025-06-12T13:09:13Z","source":{"name":"Midwest Radio","url":"https://www.midwestradio.ie"}}]}