{"totalArticles":6882100,"articles":[{"title":"619 nabbed, 640 firearms seized in 5-month gun ban in Central Luzon","description":"CAMP OLIVAS, Pampanga – A total of 619 violators were nabbed in Central Luzon during the five-month implementation of the nationwide gun ban for the May 12...","content":"CAMP OLIVAS, Pampanga – A total of 619 violators were nabbed in Central Luzon during the five-month implementation of the nationwide gun ban for the May 12 midterm elections.\nAside from the arrest of violators, 640 assorted illegal firearms were also... [942 chars]","url":"https://mb.com.ph/2025/06/12/619-nabbed-640-firearms-seized-in-5-month-gun-ban-in-central-luzon","image":"https://mb.com.ph/manilabulletin/uploads/images/2025/06/12/18947.webp","publishedAt":"2025-06-12T12:48:00Z","source":{"name":"Manila Bulletin","url":"https://mb.com.ph"}},{"title":"Stock market today: Live updates","description":"Wednesday marked a losing session on Wall Street, with the S&P 500 snapping its three-day win streak, as did the Nasdaq Composite.","content":"Traders wait for Voyager Technologies to begin trading during the company's IPO at the New York Stock Exchange (NYSE) in New York City, U.S., June 11, 2025.\nStock futures fell early Thursday as U.S. President Donald Trump threatened setting unilatera... [2843 chars]","url":"https://www.cnbc.com/2025/06/11/stock-market-today-live-updates.html","image":"https://image.cnbcfm.com/api/v1/image/108158023-17496642612025-06-11t174807z_659699206_rc2h0fas0nei_rtrmadp_0_voyager-ipo.jpeg?v=1749664380&w=1920&h=1080","publishedAt":"2025-06-12T12:44:00Z","source":{"name":"CNBC","url":"https://www.cnbc.com"}},{"title":"PBBM: PH wants alliance based on ‘mutual respect, shared goals’","description":"MANILA – The Philippines, which has gone a long way from a “fledgling Republic to an active and responsible member of the community of nations,” is seeking an alliance that is based on “mutual respect, reciprocity, and shared goals,” President Ferdinand R. Marcos Jr. said Thursday.…","content":"FORGING ALLIANCE. President Ferdinand R. Marcos Jr. (left) hosts the traditional vin d’honneur at Malacañan Palace in Manila on Thursday (June 12, 2025), as the nation celebrates its 127th Independence Day. In his toast remarks, Marcos said the Phili... [4436 chars]","url":"https://www.pna.gov.ph/articles/1252070","image":"https://files01.pna.gov.ph/ograph/2025/06/12/pbbm-hosting-vin-dhonneur.jpg","publishedAt":"2025-06-12T12:24:52Z","source":{"name":"Philippine News Agency","url":"https://www.pna.gov.ph"}},{"title":"Deadly civilian plane crashes in India over the decades","description":"NEW DELHI, India: An Air India plane bound for London with 242 people on board crashed minutes after taking off from India’s western city of Ahmedabad on Thursday, the airline and police said, and India’s federal health minister said that “many people” were killed. Following are details of some other airline accidents in India in recent years: AUGUST 2020 Twenty-one people","content":"London-bound Air India flight with more than 240 aboard crashes after takeoff from Ahmedabad, India\nAHMEDABAD, India: An Air India passenger plane bound for London with more than 240 people on board crashed Thursday in India’s northwestern city of Ah... [4752 chars]","url":"https://www.arabnews.com/node/2604278/world","image":"https://www.arabnews.com/sites/default/files/styles/660x371_watermarksaudi/public/main-image/2025/06/12/4611188-581225493.png?itok=TPsg7poj","publishedAt":"2025-06-12T12:24:05Z","source":{"name":"Arab News","url":"https://www.arabnews.com"}},{"title":"Air India plane bound for London crashes on takeoff","description":"Visuals showed debris on fire, with thick black smoke rising up into the sky near the airport.","content":"“In this sad hour, my thoughts are with everyone affected,” Modi said in a social media post. Starmer said he was being kept updated as the situation developed. “My thoughts are with the passengers and their families at this deeply distressing time,”... [5437 chars]","url":"https://www.theage.com.au/world/asia/air-india-plane-bound-for-london-crashes-on-takeoff-20250612-p5m71m.html","image":"https://static.ffx.io/images/$zoom_1.3238%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_jpg/t_theage_no_label_no_age_social_wm/66723b86f42a257c8c8e14e975610b3531e060b5a42a4e03ef5a025841cf5aa7","publishedAt":"2025-06-12T12:23:35Z","source":{"name":"The Age","url":"https://www.theage.com.au"}},{"title":"Jay Pharoah and Sommore to Headline Third Annual Because","description":"The star-studded comedy showcase returns to DC from October 10–12, with performances by Tisha Campbell, and more....","content":"Washington, DC, June 12, 2025 (GLOBE NEWSWIRE) -- NICE CROWD, in partnership with Events DC, is proud to announce Jay Pharoah and Sommore as the headline acts at the third annual Because They’re Funny (BTF) DC Comedy Festival, returning to Washington... [5688 chars]","url":"https://www.globenewswire.com/news-release/2025/06/12/3098294/0/en/Jay-Pharoah-and-Sommore-to-Headline-Third-Annual-Because-They-re-Funny-DC-Comedy-Festival-Tickets-Now-Available.html","image":"https://ml.globenewswire.com/Resource/Download/a5e41c31-29f6-426e-bb79-8b288d652924","publishedAt":"2025-06-12T12:05:56Z","source":{"name":"GlobeNewswire","url":"https://www.globenewswire.com"}},{"title":"'Never seen this many': Mid Island's largest bat colony grows to more than 2,000","description":"Count was held in North Oyster this past weekend","content":"Count was held in North Oyster this past weekend\nThe central Island's largest bat colony has a new population record after growing by about 330 little brown myotis since the first count of the season.\nOn Saturday, June 7, the most volunteers in the h... [3598 chars]","url":"https://www.nanaimobulletin.com/local-news/never-seen-this-many-mid-islands-largest-bat-colony-grows-to-more-than-2000-8059662","image":"https://www.bpmcdn.com/f/files/nanaimo/bat-count-25.jpg;w=1200;h=800;mode=crop","publishedAt":"2025-06-12T12:05:00Z","source":{"name":"Nanaimo News Bulletin","url":"http://www.nanaimobulletin.com"}},{"title":"Ahmedabad plane crash live updates: 120 people feared dead after Air India crash; Rescue ops underway","description":"Ahmedabad plane crash live: An Air India flight carrying 242 passengers crashed near Ahmedabad Airport. As per sources, at least 120 people are feared dead. London-bound Flight AI 171 crashed moments after taking off from Sardar Vallabhbhai Patel International Airport.","content":"Ahmedabad plane crash live updates: At least 120 people are feared dead after an Air India flight carrying 242 passengers crashed near Ahmedabad Airport. The plane, en-route to London, crashed in a residential area, five minutes after taking off from... [618 chars]","url":"https://www.hindustantimes.com/india-news/ahmedabad-plane-crash-live-updates-air-india-flight-crashes-ahmedabad-airport-death-toll-news-101749717953751.html","image":"https://www.hindustantimes.com/ht-img/img/2025/06/12/550x309/Air_India_plane_crash_1749720328540_1749729594246.jpg","publishedAt":"2025-06-12T12:00:19Z","source":{"name":"Hindustan Times","url":"https://www.hindustantimes.com"}},{"title":"Trump's 2026 budget cuts would force the world's most powerful solar telescope to close","description":"The Daniel K. Inouye Solar Telescope, the most powerful instrument of its kind in the world, may not survive President Trump's 2026 budget request.","content":"Funding for the Daniel K. Inouye Solar Telescope, the most powerful instrument of its kind in the world, is under threat with President Trump's 2026 budget proposal.\nANCHORAGE, AK — There was a pindrop silence in the room on Tuesday (June 10), as Chr... [4549 chars]","url":"https://www.space.com/astronomy/earth/trumps-2026-budget-cuts-would-force-the-worlds-most-powerful-solar-telescope-to-close","image":"https://cdn.mos.cms.futurecdn.net/r4cj7sc67SUUjYDDsCEvZ8.jpg","publishedAt":"2025-06-12T12:00:00Z","source":{"name":"Space","url":"https://www.space.com"}},{"title":"Alexander-Arnold is presented as a Real Madrid player","description":"Watch and follow live coverage as Real Madrid present new signing Trent Alexander-Arnold to their fans.","content":"'Something that is out of reach for most players'\nReal Madrid\nTrent Alexander-Arnold on whether he ever believed he would play in the white of Real Madrid on previous visits to the club: \"It's not something you dream of because it is something that i... [466 chars]","url":"https://www.bbc.com/sport/football/live/ce81ez2rr5rt","image":"https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/05e9/live/681e87f0-4781-11f0-9471-e380f647874e.jpg","publishedAt":"2025-06-12T11:55:52Z","source":{"name":"BBC","url":"https://www.bbc.com"}}]}