{"totalArticles":124928,"articles":[{"title":"Найкращі відеокарти 2025 року","description":"Найкраща відеокарта для більшості - AMD Radeon RX 9070. Вона добре справляється з іграми в 1440p і прекрасно показує себе з трасуванням променів.","content":"Усі вони демонструють чудове співвідношення ціни-якості та ще не скоро застаріють.\nАвторитетні оглядачі з PC Gamer протестували всі відеокарти, випущені в цьому поколінні, і склали добірку найбільш вдалих графічних прискорювачів, які можна придбати в... [2354 chars]","url":"https://www.unian.ua/techno/hardware/naykrashchi-videokarti-2025-roku-eksperti-protestuvali-sotnyu-modeley-i-vibrali-ci-5-13058451.html","image":"https://images.unian.net/photos/2025_07/thumb_files/1000_545_1751708672-9436.jpg?1","publishedAt":"2025-07-05T10:35:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Це вам не краш-тести на ютубі: Apple показала, як тестує свої пристрої на міцність","description":"Apple поділилася унікальними подробицями про те, як тестує свої девайси перед виходом. Компанія пустила у свою спеціальну лабораторію журналістів.","content":"Наприклад, для краш-тестів компанія використовує спеціального робота, який упускає пристрої з різної висоти.\nApple поділилася унікальними подробицями про те, як тестує свої девайси перед тим, як випустити їх на ринок. Виробник пустив у свою спеціальн... [2339 chars]","url":"https://www.unian.ua/techno/gadgets/ce-vam-ne-krash-testi-na-yutubi-apple-pokazala-yak-testuye-iphone-na-micnist-13058397.html","image":"https://images.unian.net/photos/2025_07/thumb_files/1000_545_1751705390-8295.jpg?1","publishedAt":"2025-07-05T09:35:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Microsoft закрила нову гру від творця DOOM Джона Ромеро","description":"Romero Games, студія, заснована творцем DOOM Джоном Ромеро і Брендою Ромеро, втратила фінансування свого нового проєкту і змушена звільняти співробітників","content":"Подружжя Джон і Бренда Ромеро дізналося про зупинку фінансування буквально за ніч до ухвалення рішення.\nRomero Games, студія, заснована творцем DOOM Джоном Ромеро і його дружиною Брендою Ромеро, втратила фінансування свого нового проєкту і змушена зв... [1156 chars]","url":"https://www.unian.ua/games/microsoft-zakrila-novu-gru-vid-tvorcya-doom-dzhona-romero-13058370.html","image":"https://images.unian.net/photos/2025_07/thumb_files/1000_545_1751704475-3980.jpg?1","publishedAt":"2025-07-05T08:58:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Samsung Fold - моделі Galaxy Z Flip 7 FE, Flip 7 і Fold 7 витекли до анонсу - УНІАН","description":"9 липня Samsung представить нове покоління складних смартфонів. Чекаємо щонайменше три моделі: Galaxy Z Fold 7, Galaxy Z Flip 7 і вперше бюджетний Flip 7 FE.","content":"Galaxy Z Fold 7 може стати новим найтоншим складним смартфоном, а Flip 7 отримає зовнішній екран на всю передню панель.\n9 липня компанія Samsung представить нове покоління фірмових складаних смартфонів. Чекаємо щонайменше три моделі: Galaxy Z Fold 7,... [1846 chars]","url":"https://www.unian.ua/techno/gadgets/samsung-fold-modeli-galaxy-z-flip-7-fe-flip-7-i-fold-7-vitekli-do-anonsu-13058358.html","image":"https://images.unian.net/photos/2025_07/thumb_files/1000_545_1751702929-2506.jpg?1","publishedAt":"2025-07-05T08:40:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"\"Путінська методичка\" сварки Росії та Азербайджану. Чи отримала Україна нового союзника","description":"Конфлікт між РФ та Азербайджаном підтверджує існування певної \"путінської методички\" - алгоритму створення образу ворога та поширення дезінформації в сучасній Росії.","content":"\"Путінська методичка\" сварки Росії та Азербайджану. Чи отримала Україна нового союзника\nАвтор фото, Getty Images Підпис до фото, Володимир Путін та Ільхам Алієв - під час зустрічі лідерів РФ, Азербайджану та Вірменії в Сочі, 31 жовтня 2022 року\nAutho... [10354 chars]","url":"https://www.bbc.com/ukrainian/articles/cn0qx2lypk4o","image":"https://ichef.bbci.co.uk/news/1024/branded_ukrainian/7000/live/de0c63e0-584f-11f0-a07d-dd7c432cf458.jpg","publishedAt":"2025-07-05T07:52:30Z","source":{"name":"BBC","url":"https://www.bbc.com"}},{"title":"Названо вживаний кросовер, який не можна купувати","description":"Механік Педро Бастіда радить уникати вживаного Audi Q5 2009 року через численні технічні та електричні проблеми, що впливають на надійність","content":"Під час купівлі вживаних автомобілів потрібно бути дуже уважним, щоб не купити модель з технічними проблемами. Іспанський механік Педро Бастіда вважає, що не потрібно купувати кросовер Audi Q5 2009 року випуску, оскільки у нього часто бувають технічн... [2242 chars]","url":"https://today.ua/480130-mehanik-nazval-poderzhannyj-krossover-kotoryj-nelzya-pokupat/","image":"https://today.ua/storage/images/media/jul2025/4775-mexanik-crop-1200-650.webp","publishedAt":"2025-07-05T07:51:00Z","source":{"name":"Today.ua","url":"https://today.ua"}},{"title":"Стало відомо, скільки Valve заробляє зі Steam","description":"Компанія Valve, якій належить Steam, залишається однією з найприбутковіших. У 2021 році комісія від продажів у Steam принесла компанії 2 мільярди доларів.","content":"За даними Financial Times, 2021 року кожен співробітник Valve приносив компанії 3.5 мільйона доларів на рік.\nКомпанія Valve, якій належить Steam, залишається однією з найприбутковіших і при цьому нечисленних в індустрії. Раніше масштаби їхніх доходів... [1066 chars]","url":"https://www.unian.ua/games/stalo-vidomo-skilki-valve-zaroblyaye-zi-steam-13058298.html","image":"https://images.unian.net/photos/2025_07/thumb_files/1000_545_1751701107-7475.jpg?1","publishedAt":"2025-07-05T07:51:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Вімблдон-2025: перша ракетка України Еліна Світоліна завершила виступ на турнірі","description":"Українка Еліна Світоліна припинила боротьбу на Вімблдоні-2025, поступившись у третьому раунді жіночого одиночного розряду.","content":"Українка Еліна Світоліна припинила боротьбу на Вімблдоні-2025, поступившись у третьому раунді жіночого одиночного розряду.\nЗа інформацією «Патріота Донбасу» з посиланням на SportArena, у першому сеті українська тенісистка не змогла знайти свій ритм і... [302 chars]","url":"https://donpatriot.news/vimbldon-2025-persha-raketka-ukrayiny-elina-svitolina-zavershyla-vystup-na-turniri","image":"https://donpatriot.news/wp-content/uploads/2024/02/tenis.jpeg","publishedAt":"2025-07-05T07:47:58Z","source":{"name":"Патріот Донбасу","url":"https://donpatriot.news"}},{"title":"Помер актор, який зіграв Коула в серіалі \"Всі жінки","description":"У віці 56 років помер американський актор Джуліан Макмехон, який зіграв роль демона Коула в культовому серіалі \"Всі жінки – відьми\". Це підтвердила його дружина","content":"Помер австралійсько-американськй актор Джуліан Макмехон, відомий за роллю демона Коула в культовому телесеріалі \"Всі жінки – відьми\". Йому було 56 років.\nПро це повідомила дружина актора Келлі Макмехон та колеги з серіалу \"Частини тіла\" (Nick/Tuck), ... [811 chars]","url":"https://life.pravda.com.ua/society/pomer-aktor-yakiy-zigrav-koula-v-seriali-vsi-zhinki-vidmi-shcho-trapilosya-309041/","image":"https://imglife.pravda.com.ua/life/images/doc/7/3/100635/731a93cd56e670b442c8ea1046ab4caa.jpeg?w=1920&q=90","publishedAt":"2025-07-05T07:29:00Z","source":{"name":"Українська правда","url":"https://life.pravda.com.ua"}},{"title":"Трамп після \"хорошої\" розмови із Зеленським запевнив, що допомагатиме Україні","description":"Президент США Дональд Трамп заявив, що задоволений розмовою з Володимиром Зеленським напередодні.","content":"Президент США Дональд Трамп заявив, що задоволений розмовою з Володимиром Зеленським напередодні.\nДжерело: Трамп журналістам у пʼятницю ввечері на борту Air Force One, \"Європейська правда\"\nДеталі: Трамп сказав, що в нього із Зеленським \"була хороша р... [981 chars]","url":"https://www.pravda.com.ua/news/2025/07/5/7520292/","image":"https://img.pravda.com/images/doc/7/5/7520292_fb_image_ukr_2025_07_05_11_12_49.jpg","publishedAt":"2025-07-05T07:28:36Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}}]}