{"totalArticles":7288992,"articles":[{"title":"Втрати Росії - Шаманбат ГУР МО влаштув засідку на окупантів - відео - 24 Канал","description":"Бійці Шаманбату ГУР МО влаштували засідку на російських штурмовиків. Частину окупантів ліквідовано, частину взято у полон, ворожий транспорт залишився на ходу - 24 Канал","content":"У ГУР показали ексклюзивне відео, як вдалося \"викосити\" ворожу мотогрупу, передає 24 Канал.\nДивіться також Скільки окупантів загинули з початку повномасштабного вторгнення: підрахунки журналістів\nБійці взяли у полон частину російських штурмовиків\nЗас... [722 chars]","url":"https://24tv.ua/vtrati-rosiyi-shamanbat-gur-mo-vlashtuv-zasidku-okupantiv-video_n2858337","image":"https://24tv.ua/resources/photos/news/202506/2858337.jpg?v=1751207298000&w=1200&h=675","publishedAt":"2025-06-29T14:56:17Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"Сенатор Грем заявив, що Трамп підтримав законопроєкт про санкції проти РФ, але \"послаблений\"","description":"Ініціатор законопроєкту щодо санкцій проти Росії за торгівлю нафтою, сенатор-республіканець Ліндсі Грем заявив, що президент США Дональд Трамп підтримав їхнє ухвалення в Конгресі, однак законопроєкт не тягтиме за собою обовʼязкових санкцій проти РФ.","content":"Ліндсі Грем у Києві в 2023 році, фото Future Publishing via Getty Images\nІніціатор законопроєкту щодо санкцій проти Росії за торгівлю нафтою, сенатор-республіканець Ліндсі Грем заявив, що президент США Дональд Трамп підтримав їхнє ухвалення в Конгрес... [1104 chars]","url":"https://www.pravda.com.ua/news/2025/06/29/7519332/","image":"https://img.pravda.com/images/doc/7/5/7519332_fb_image_ukr_2025_06_29_18_23_14.jpg","publishedAt":"2025-06-29T14:47:00Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Asus представила професійний монітор ProArt PA32QCV • Mezha.Media","description":"Asus ProArt PA32QCV орієнтований на професіоналів, які працюють із графікою та кольором, однак не розрахований на геймерську аудиторію. Модель оснащена 31,5-дюймовою IPS-панеллю з високою роздільною здатністю 6016×3884 пікселів.","content":"Цікавлюся різного роду електронікою і технологіями з 2004 року. Люблю грати в комп'ютерні ігри, а також розуміюся на роботі різних гаджетів. Регулярно стежу за новинами світу технологій і сам пишу матеріали про це.\nКомпанія Asus офіційно розкрила хар... [1255 chars]","url":"https://mezha.media/news/predstavleno-monitor-asus-proart-pa32qcv-303010/","image":"https://img.mezha.media/mezhaprod/images/doc/d/a/269367/da260f6b2241e98b59305db3a3c2005c.jpeg","publishedAt":"2025-06-29T14:31:00Z","source":{"name":"Mezha.Media","url":"https://mezha.media"}},{"title":"Іран зберіг потенціал для збагачення урану - МАГАТЕ","description":"Американські удари не знищили основні компоненти, а лише відкинули програму на кілька місяців назад.","content":"Американські удари не знищили основні компоненти, а лише відкинули програму на кілька місяців назад.\nІрану достатньо буде всього кілька місяців для початку збагачення урану, зазначив генеральний директор Міжнародного агентства з атомної енергії Рафае... [1502 chars]","url":"https://ua.korrespondent.net/world/4794439-iran-zberih-potentsial-dlia-zbahachennia-uranu-mahate","image":"https://kor.ill.in.ua/m/1260x900/4332243.jpg","publishedAt":"2025-06-29T12:19:00Z","source":{"name":"Korrespondent.net","url":"https://ua.korrespondent.net"}},{"title":"Google Pixel 7 заборонили в Японії - Pixel 8 і 9 наступні","description":"Google втратив право продавати смартфони Pixel 7 у Японії за результатами патентної суп","content":"Pixel 7 та Pixel 7 Pro / Google\nGoogle втратив право продавати смартфони Pixel 7 у Японії за результатами патентної суперечки з корейською компанією Pantech.\nРішення японського окружного суду визнає Google винним у порушенні патенту, пов’язаного зі з... [1913 chars]","url":"https://itc.ua/ua/novini/google-pixel-7-zaboronyly-v-yaponiyi-pixel-8-i-9-nastupni/","image":"https://itc.ua/wp-content/uploads/2022/11/Pixel-7-and-Pixel-7-Pro_large.jpeg","publishedAt":"2025-06-29T12:16:55Z","source":{"name":"ITC.ua","url":"https://itc.ua"}},{"title":"Вєрку Сердючку розкритикували через пісні російською","description":"Вєрка Сердючка 13 червня виступила в Києві, де заспівала російською мовою свої відомі треки. Про те, як артистка прокоментувала цей скандал - дивіться на Show24","content":"Артистка публічно прокоментувала хейт. Повідомляє Show 24 із посиланням на телеграм-канал Новини.LIVE Одеса.\nЦікаво Як виглядала Лорен Санчес – мати трьох дітей, і як жила до знайомства з Безосом: архівні фото\nТак, під час виступу Андрій Данилко емоц... [386 chars]","url":"https://24tv.ua/show24/vyerku-serdyuchku-rozkritikuvali-cherez-pisni-rosiyskoyu-yak_n2858241","image":"https://24tv.ua/resources/photos/news/202506/2858241.jpg?v=1751198016000&w=1200&h=675","publishedAt":"2025-06-29T12:10:16Z","source":{"name":"24 Канал","url":"https://24tv.ua"}},{"title":"В Угорщині заявили про зняття санкцій США, які заважали росіянам розширити АЕС \"Пакш\"","description":"Міністр закордонних справ Угорщини Петер Сійярто у неділю подякував США за скасування санкцій, що стримували розширення атомної електростанції Пакш, проєкт якої реалізує Росатом.","content":"Міністр закордонних справ Росії Сергій Лавров (ліворуч) слухає міністра закордонних справ Угорщини Петера Сійярто (праворуч) після переговорів у державній резиденції Ново-Огарьово 17 лютого 2016 року в Москві, Росія/Getty Images\nМіністр закордонних с... [1407 chars]","url":"https://www.pravda.com.ua/news/2025/06/29/7519314/","image":"https://img.pravda.com/images/doc/7/5/7519314_fb_image_ukr_2025_06_29_15_23_24.jpg","publishedAt":"2025-06-29T11:49:00Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}},{"title":"Відьмак 4 геймплей: Відьмак 4 не буде виглядати так, як у геймплейному демо","description":"CD Projekt RED нагадала, що демо \"Відьмак 4\" не відображає те, який вигляд матиме гра. Розробники підкреслили, що воно показує можливості Unreal Engine.","content":"Після турбулентного запуску Cyberpunk 2077 компанія вирішила кілька разів перестрахуватися.\nCD Projekt RED ще раз нагадала, що показане демо \"Відьмак 4\" не відображає те, який вигляд гра матиме на релізі.\nВ інтерв'ю GamesRadar технічний продакт-менед... [1126 chars]","url":"https://www.unian.ua/games/vidmak-4-geympley-vidmak-4-ne-bude-viglyadati-tak-yak-u-geympleynomu-demo-13052376.html","image":"https://images.unian.net/photos/2025_06/thumb_files/1000_545_1751196099-3430.jpg?1","publishedAt":"2025-06-29T11:37:00Z","source":{"name":"УНІАН","url":"https://www.unian.ua"}},{"title":"Ольга Сумська розповіла про нову роботу доньки, яка відмовилася від акторства","description":"Акторка Ольга Сумська розповіла, чим зараз займається її молодша донька Ганна, яка не захотіла стати акторкою - ким вона працює ᐅTSN.ua(новини 1+1)","content":"Ольга Сумська з молодшою донькою\nРеклама\nУкраїнська акторка Ольга Сумська розсекретила, чим займається її молодша донька від Віталія Борисюка після відмови від акторства.\nРаніше 23-річна Ганна Борисюк зізнавалась, що не хоче йти стопами зіркових бать... [1344 chars]","url":"https://tsn.ua/glamur/olha-sumska-rozkryla-chym-zaymayetsia-yiyi-23-richna-donka-pislia-vidmovy-vid-aktorskoyi-karyery-2859509.html","image":"https://img.tsn.ua/cached/602/tsn-7d69491ed57b2e0aebe0922b41d97a86/thumbs/1200x630/ae/03/84c55790802acb8cc9d0fb273f7103ae.jpeg","publishedAt":"2025-06-29T11:00:19Z","source":{"name":"tsn.ua","url":"https://tsn.ua"}},{"title":"Зеленський підписав указ про вихід з конвенції про заборону протипіхотних мін - нардеп","description":"Президент Володимир Зеленський підписав указ, яким увів у дію рішення Ради національної безпеки і оборони України про вихід нашої держави з Оттавської конвенції — міжнародного договору, що забороняє застосування, накопичення та виробництво протипіхотних мін.","content":"Президент Володимир Зеленський підписав указ, яким увів у дію рішення Ради національної безпеки і оборони України про вихід нашої держави з Оттавської конвенції — міжнародного договору, що забороняє застосування, накопичення та виробництво протипіхот... [902 chars]","url":"https://www.pravda.com.ua/news/2025/06/29/7519309/","image":"https://img.pravda.com/images/doc/7/5/7519309_fb_image_ukr_2025_06_29_14_10_02.jpg","publishedAt":"2025-06-29T10:38:05Z","source":{"name":"Українська правда","url":"https://www.pravda.com.ua"}}]}